----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Sensitivity Analysis 
> 1.log
  log type:  text
 opened on:  16 Apr 2023, 13:57:33

. 
. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta", clear 
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta", clear 

. 
. drop dispuniform i10_ndx i10_npr i10_pr1-i10_pr25 los prday1-prday25 key_nis pl_nchs totchg hosp_locteac
> h

. 
. gen sens_cohort = 0

. replace sens_cohort = 1 if explicitsepsis==1
(124 real changes made)

. replace sens_cohort = 0 if age<18 & died==. & age==. & male==. & race==.
(0 real changes made)

. 
. drop if sens_cohort == 0
(7,105,374 observations deleted)

. 
. svyset hosp_nis [pw=discwt]

Sampling weights: discwt
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: hosp_nis
           FPC 1: <zero>

. 
. gen zipinc_qrtl_2 = 0

. replace zipinc_qrtl_2 = zipinc_qrtl
(124 real changes made, 5 to missing)

. replace zipinc_qrtl_2 = 1 if zipinc_qrtl_2 == 2
(37 real changes made)

. replace zipinc_qrtl_2 = 2 if zipinc_qrtl_2 == 3 | zipinc_qrtl_2 == 4
(41 real changes made)

. 
. *For CIs
. gen zipinc_qrtl_0_50 =0

. replace zipinc_qrtl_0_50=1 if zipinc_qrtl_2==1
(78 real changes made)

. gen zipinc_qrtl_50_100 =0

. replace zipinc_qrtl_50_100=1 if zipinc_qrtl_2==2
(41 real changes made)

. gen zipinc_qrtl_miss=0

. replace zipinc_qrtl_miss=1 if zipinc_qrtl_2==5
(0 real changes made)

. 
. *Defined PAD
. gen allPAD = 0

. foreach num of numlist 2/40 {
  2.         replace allPAD = 1 if inlist(i10_dx`num', "I70211",  "I70212",  "I70213",  "I70221",  "I70222
> ") | inlist(i10_dx`num', "I70223",  "I70231",  "I70232",  "I70233", "I70234") | inlist(i10_dx`num', "I70
> 235",  "I70241",  "I70245",  "I70242",  "I70243") | inlist(i10_dx`num', "I70244",  "I70261",  "I70262", 
>  "I70263",  "I70291") | inlist(i10_dx`num', "I70292",  "I70293",  "I70301",  "I70302",  "I70303") | inli
> st(i10_dx`num', "I70311",  "I70312",  "I70313",  "I70321",  "I70322") | inlist(i10_dx`num', "I70323",  "
> I70331",  "I70332",  "I70333 ",  "I70334") | inlist(i10_dx`num', "I70335",  "I70341",  "I70342",  "I7034
> 3",  "I70344") | inlist(i10_dx`num', "I70345",  "I70361",  "I70362",  "I70363",  "I70391") | inlist(i10_
> dx`num', "I70392",  "I70393",  "I70401",  "I70402",  "I70403") | inlist(i10_dx`num', "I70411",  "I70412"
> ,  "I70413",  "I70421",  "I70423") | inlist(i10_dx`num', "I70431",  "I70432",  "I70433",  "I70434",  "I7
> 0441") | inlist(i10_dx`num', "I70442",  "I70443",  "I70444",  "I70445",  "I70461") | inlist(i10_dx`num',
>  "I70462",  "I70463",  "I70491",  "I70492",  "I70493") | inlist(i10_dx`num', "I70501",  "I70502",  "I705
> 03",  "I70511",  "I70512") | inlist(i10_dx`num', "I70513",  "I70521",  "I70522",  "I70523",  "I70531") |
>  inlist(i10_dx`num', "I70532",  "I70533",  "I70534",  "I70541",  "I70542") | inlist(i10_dx`num', "I70543
> ",  "I70544",  "I70561",  "I70562",  "I70563") | inlist(i10_dx`num', "I70591",  "I70592",  "I70593",  "I
> 70601",  "I70602") | inlist(i10_dx`num', "I70603",  "I70611",  "I70612",  "I70613",  "I70621") | inlist(
> i10_dx`num', "I70622",  "I70623",  "I70631",  "I70632",  "I70633") | inlist(i10_dx`num', "I70634",  "I70
> 641",  "I70642",  "I70643",  "I70644") | inlist(i10_dx`num', "I70661",  "I70662",  "I70663",  "I70691", 
>  "I70692") | inlist(i10_dx`num', "I70693",  "I70701",  "I70702",  "I70703",  "I70711") | inlist(i10_dx`n
> um', "I70712",  "I70713",  "I70721",  "I70722",  "I70723") | inlist(i10_dx`num', "I70731",  "I70732",  "
> I70733",  "I70734",  "I70735") | inlist(i10_dx`num', "I70741",  "I70742",  "I70743",  "I70744",  "I70745
> ") | inlist(i10_dx`num', "I70761",  "I70762",  "I70763",  "I70791",  "I70792") | inlist(i10_dx`num', "Z9
> 5820")
  3. } 
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta", clear 

. 
. drop dispuniform i10_ndx i10_npr i10_pr1-i10_pr25 los prday1-prday25 key_nis pl_nchs totchg hosp_locteac
> h

. 
. gen sens_cohort = 0

. replace sens_cohort = 1 if explicitsepsis==1
(124 real changes made)

. replace sens_cohort = 0 if age<18 & died==. & age==. & male==. & race==.
(0 real changes made)

. 
. drop if sens_cohort == 0
(7,105,374 observations deleted)

. 
. svyset hosp_nis [pw=discwt]

Sampling weights: discwt
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: hosp_nis
           FPC 1: <zero>

. 
. gen zipinc_qrtl_2 = 0

. replace zipinc_qrtl_2 = zipinc_qrtl
(124 real changes made, 5 to missing)

. replace zipinc_qrtl_2 = 1 if zipinc_qrtl_2 == 2
(37 real changes made)

. replace zipinc_qrtl_2 = 2 if zipinc_qrtl_2 == 3 | zipinc_qrtl_2 == 4
(41 real changes made)

. 
. *For CIs
. gen zipinc_qrtl_0_50 =0

. replace zipinc_qrtl_0_50=1 if zipinc_qrtl_2==1
(78 real changes made)

. gen zipinc_qrtl_50_100 =0

. replace zipinc_qrtl_50_100=1 if zipinc_qrtl_2==2
(41 real changes made)

. gen zipinc_qrtl_miss=0

. replace zipinc_qrtl_miss=1 if zipinc_qrtl_2==5
(0 real changes made)

. 
. *Defined PAD
. gen allPAD = 0

. foreach num of numlist 2/40 {
  2.         replace allPAD = 1 if inlist(i10_dx`num', "I70211",  "I70212",  "I70213",  "I70221",  "I70222
> ") | inlist(i10_dx`num', "I70223",  "I70231",  "I70232",  "I70233", "I70234") | inlist(i10_dx`num', "I70
> 235",  "I70241",  "I70245",  "I70242",  "I70243") | inlist(i10_dx`num', "I70244",  "I70261",  "I70262", 
>  "I70263",  "I70291") | inlist(i10_dx`num', "I70292",  "I70293",  "I70301",  "I70302",  "I70303") | inli
> st(i10_dx`num', "I70311",  "I70312",  "I70313",  "I70321",  "I70322") | inlist(i10_dx`num', "I70323",  "
> I70331",  "I70332",  "I70333 ",  "I70334") | inlist(i10_dx`num', "I70335",  "I70341",  "I70342",  "I7034
> 3",  "I70344") | inlist(i10_dx`num', "I70345",  "I70361",  "I70362",  "I70363",  "I70391") | inlist(i10_
> dx`num', "I70392",  "I70393",  "I70401",  "I70402",  "I70403") | inlist(i10_dx`num', "I70411",  "I70412"
> ,  "I70413",  "I70421",  "I70423") | inlist(i10_dx`num', "I70431",  "I70432",  "I70433",  "I70434",  "I7
> 0441") | inlist(i10_dx`num', "I70442",  "I70443",  "I70444",  "I70445",  "I70461") | inlist(i10_dx`num',
>  "I70462",  "I70463",  "I70491",  "I70492",  "I70493") | inlist(i10_dx`num', "I70501",  "I70502",  "I705
> 03",  "I70511",  "I70512") | inlist(i10_dx`num', "I70513",  "I70521",  "I70522",  "I70523",  "I70531") |
>  inlist(i10_dx`num', "I70532",  "I70533",  "I70534",  "I70541",  "I70542") | inlist(i10_dx`num', "I70543
> ",  "I70544",  "I70561",  "I70562",  "I70563") | inlist(i10_dx`num', "I70591",  "I70592",  "I70593",  "I
> 70601",  "I70602") | inlist(i10_dx`num', "I70603",  "I70611",  "I70612",  "I70613",  "I70621") | inlist(
> i10_dx`num', "I70622",  "I70623",  "I70631",  "I70632",  "I70633") | inlist(i10_dx`num', "I70634",  "I70
> 641",  "I70642",  "I70643",  "I70644") | inlist(i10_dx`num', "I70661",  "I70662",  "I70663",  "I70691", 
>  "I70692") | inlist(i10_dx`num', "I70693",  "I70701",  "I70702",  "I70703",  "I70711") | inlist(i10_dx`n
> um', "I70712",  "I70713",  "I70721",  "I70722",  "I70723") | inlist(i10_dx`num', "I70731",  "I70732",  "
> I70733",  "I70734",  "I70735") | inlist(i10_dx`num', "I70741",  "I70742",  "I70743",  "I70744",  "I70745
> ") | inlist(i10_dx`num', "I70761",  "I70762",  "I70763",  "I70791",  "I70792") | inlist(i10_dx`num', "Z9
> 5820")
  3. } 
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. *Count tables
. svy: tabulate died allPAD, count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =   1                            Number of obs   =        124
Number of PSUs   = 105                            Population size = 620.000283
                                                  Design df       =        104

----------------------------------------------------------
Died      |
during    |
hospitali |                     allPAD                    
zation    |              0               1           Total
----------+-----------------------------------------------
        0 | 505.0002438000    4.9999858000  510.0002296000
        1 | 110.0000532000    0.0000000000  110.0000532000
          | 
    Total | 615.0002970000    4.9999858000  620.0002828000
----------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.2174
    Design-based  F(1, 104)       =    0.2157     P = 0.6433

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. 
. log close
      name:  <unnamed>
       log:  /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Sensitivity Analysis 
> 1.log
  log type:  text
 closed on:  16 Apr 2023, 14:27:52
----------------------------------------------------------------------------------------------------------
