----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stuthiiyer/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Table 1.log
  log type:  text
 opened on:   3 Dec 2024, 00:00:52

. use "/Users/stuthiiyer/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /2016-2020.dta", clear

. *Moving on to Table 1 creation
. 
. svyset hosp_nis [pw=discwt]

Sampling weights: discwt
             VCE: linearized
     Single unit: missing
        Strata 1: <one>
 Sampling unit 1: hosp_nis
           FPC 1: <zero>

. 
. *Proportion of sepsis hospitalizations that died
. svy: prop died
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8885464   .0004767      .8876085    .8894776
          1  |   .1114536   .0004767      .1105224    .1123915
--------------------------------------------------------------

. 
. *Proportion PAD among sepsis hospitalizations
. svy: tab allPAD, count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
   allPAD |              count
----------+-------------------
        0 | 8499418.1243202705
        1 |  889199.8626595702
          | 
    Total | 9388617.9869798403
------------------------------
Key:    count = Weighted count

. svy: proportion allPAD
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      allPAD |
          0  |   .9052896   .0006635      .9039809    .9065823
          1  |   .0947104   .0006635      .0934177    .0960191
--------------------------------------------------------------

. 
. *Coronary Artery Disease
. gen cad = 0

. foreach num of numlist 2/40 {
  2. replace cad = 1 if inlist(i10_dx`num', "I200", "I201", "I202", "I208", "I209") | inlist(i10_dx`num', "I210", "I2101", "
> I2102", "I2109", "I211") | inlist(i10_dx`num', "I2111", "I2119", "I212", "I2121", "I2129") | inlist(i10_dx`num', "I213", "
> I214", "I219", "I21A1", "I256") | inlist(i10_dx`num', "I21A9", "I220", "I221", "I222", "I228") | inlist(i10_dx`num', "I229
> ", "I230", "I231", "I232", "I233") | inlist(i10_dx`num', "I234", "I235", "I236", "I237", "I238") | inlist(i10_dx`num', "I2
> 40", "I241", "I248", "I249", "I250") | inlist(i10_dx`num', "I2510", "I25110", "I25111") | inlist(i10_dx`num', "I25112", "I
> 25118", "I25119", "I252", "I25700") | inlist(i10_dx`num', "I25701", "I25702", "I25708", "I25709", "I25710") | inlist(i10_d
> x`num', "I25711", "I25712", "I25718", "I25719", "I25720") | inlist(i10_dx`num', "I25721", "I25728", "I25729", "I25730", "I
> 25731") | inlist(i10_dx`num', "I25732", "I25738", "I25739", "I25750", "I25751") | inlist(i10_dx`num', "I25752", "I25758", 
> "I25759", "I25760", "I25761") | inlist(i10_dx`num', "I25762", "I25768", "I25769", "I25790", "I25791") | inlist(i10_dx`num'
> , "I25792", "I25798", "I25799", "I25810", "I2582") | inlist(i10_dx`num', "I2583", "I2584", "I2589", "I259", "I255")
  3. }
(34,603 real changes made)
(38,122 real changes made)
(30,228 real changes made)
(29,894 real changes made)
(31,732 real changes made)
(33,455 real changes made)
(35,100 real changes made)
(36,050 real changes made)
(36,414 real changes made)
(35,622 real changes made)
(33,942 real changes made)
(31,586 real changes made)
(28,771 real changes made)
(25,745 real changes made)
(21,900 real changes made)
(19,453 real changes made)
(16,624 real changes made)
(12,393 real changes made)
(10,639 real changes made)
(8,866 real changes made)
(7,516 real changes made)
(6,222 real changes made)
(5,257 real changes made)
(3,969 real changes made)
(1,615 real changes made)
(1,368 real changes made)
(1,089 real changes made)
(925 real changes made)
(765 real changes made)
(415 real changes made)
(274 real changes made)
(211 real changes made)
(141 real changes made)
(136 real changes made)
(137 real changes made)
(94 real changes made)
(81 real changes made)
(69 real changes made)
(58 real changes made)

. 
. svy: tab allPAD cad,  count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            cad                            
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 6057733.3823962826  2441684.7419249024  8499418.1243211851
        1 |  423479.9498896034   465719.9127699217   889199.8626595251
          | 
    Total | 6481213.3322858857  2907404.6546948240  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  4.21e+04
    Design-based  F(1, 4919)      =  2.23e+04     P = 0.0000

. svy: proportion cad
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cad |
          0  |   .6903267   .0008484       .688661    .6919874
          1  |   .3096733   .0008484      .3080126     .311339
--------------------------------------------------------------

. svy: proportion cad if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cad |
          0  |   .4762483   .0018621      .4725991    .4799001
          1  |   .5237517   .0018621      .5200999    .5274009
--------------------------------------------------------------

. svy: proportion cad if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cad |
          0  |   .7127233   .0008211       .711111    .7143303
          1  |   .2872767   .0008211      .2856697     .288889
--------------------------------------------------------------

. 
. *Now focus on people with PAD & CAD
. gen pnc = 0

. replace pnc=1 if allPAD ==1 & cad==1
(93,144 real changes made)

. *Make a variable that includes PAD/PAD+CAD/CAD as categories to look at the revasc outcomes
. gen cat=0

. replace cat = 1 if allPAD == 1 & pnc==0
(84,696 real changes made)

. replace cat = 2 if pnc==1
(93,144 real changes made)

. replace cat = 3 if cad==1 & pnc==0
(488,337 real changes made)

. 
. svy: tab cat, count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
      cat |              count
----------+-------------------
        0 | 6057733.3823962789
        1 |  423479.9498896034
        2 |  465719.9127699217
        3 | 2441684.7419249024
          | 
    Total | 9388617.9869807083
------------------------------
Key:    count = Weighted count

. svy: prop cat
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cat |
          0  |    .645221   .0009254      .6434046    .6470332
          1  |   .0451057    .000412      .0443048    .0459203
          2  |   .0496047   .0003304      .0489609    .0502566
          3  |   .2600686   .0007459      .2586089    .2615336
--------------------------------------------------------------

. 
. svy: tab allPAD, count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
   allPAD |              count
----------+-------------------
        0 | 8499418.1243202761
        1 |  889199.8626595703
          | 
    Total | 9388617.9869798478
------------------------------
Key:    count = Weighted count

. svy: proportion allPAD
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      allPAD |
          0  |   .9052896   .0006635      .9039809    .9065823
          1  |   .0947104   .0006635      .0934177    .0960191
--------------------------------------------------------------

. 
. *Elixhauser
. svy: mean elix
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |    4.99141     .00616      4.979334    5.003487
--------------------------------------------------------------

. svy: mean elix if allPAD==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.552069   .0085984      5.535212    5.568926
--------------------------------------------------------------

. svy: mean elix if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   4.932755   .0060429      4.920908    4.944602
--------------------------------------------------------------

. svy: regress elix allPAD
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919
                                                   F(1, 4919)      =   8793.64
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0074

------------------------------------------------------------------------------
             |             Linearized
        elix | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      allPAD |   .6193145   .0066043    93.77   0.000     .6063671    .6322619
       _cons |   4.932755   .0060429   816.29   0.000     4.920908    4.944602
------------------------------------------------------------------------------

. 
. svy: mean elix if cat==3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.607374   .0076813      5.592315    5.622432
--------------------------------------------------------------

. svy: mean elix if cat==2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.830649   .0100943       5.81086    5.850439
--------------------------------------------------------------

. svy: mean elix if cat==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.245702   .0095819      5.226917    5.264487
--------------------------------------------------------------

. svy: mean elix if cat==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   4.660837   .0055796      4.649898    4.671776
--------------------------------------------------------------

. svy:regress elix cat
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919
                                                   F(1, 4919)      =  31928.92
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0429

------------------------------------------------------------------------------
             |             Linearized
        elix | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         cat |    .332663   .0018617   178.69   0.000     .3290133    .3363128
       _cons |   4.683856   .0055843   838.75   0.000     4.672909    4.694804
------------------------------------------------------------------------------

. 
. *Making age
. svy: mean age
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   68.69458   .0428278      68.61061    68.77854
--------------------------------------------------------------

. svy: mean age if allPAD==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   73.41536    .054775      73.30798    73.52275
--------------------------------------------------------------

. svy: mean age if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   68.20069   .0438195      68.11479     68.2866
--------------------------------------------------------------

. svy:regress age allPAD
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919
                                                   F(1, 4919)      =  10566.11
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0096

------------------------------------------------------------------------------
             |             Linearized
         age | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      allPAD |    5.21467   .0507305   102.79   0.000     5.115215    5.314124
       _cons |   68.20069   .0438195  1556.40   0.000     68.11479     68.2866
------------------------------------------------------------------------------

. 
. svy: mean age if cat==3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   73.64205   .0386742      73.56623    73.71787
--------------------------------------------------------------

. svy: mean age if cat==2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   74.71754   .0540234      74.61163    74.82346
--------------------------------------------------------------

. svy: mean age if cat==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   71.98329   .0749204      71.83641    72.13017
--------------------------------------------------------------

. svy: mean age if cat==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   66.00745   .0464604      65.91637    66.09853
--------------------------------------------------------------

. svy:regress age cat
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919
                                                   F(1, 4919)      =  55343.61
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0506

------------------------------------------------------------------------------
             |             Linearized
         age | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         cat |   2.663302    .011321   235.25   0.000     2.641107    2.685496
       _cons |    66.2323   .0459643  1440.95   0.000     66.14219    66.32241
------------------------------------------------------------------------------

. 
. *Making sex
. 
. foreach var of varlist allPAD cat {
  2.         svy: tab `var' male,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            male                           
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 4263644.0868001729  4235774.0375158768  8499418.1243160497
        1 |  370734.9505046050   518464.9121549195   889199.8626595245
          | 
    Total | 4634379.0373047777  4754238.9496707963  9388617.9869734626
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 4621.7077
    Design-based  F(1, 4919)      = 3636.5841     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            male                           
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 3187584.1443046923  2870149.2380832629  6057733.3823879557
        1 |  202209.9745601991   221269.9753293983   423479.9498895974
        2 |  168524.9759443971   297194.9368255098   465719.9127699069
        3 | 1076059.9424940168  1365624.7994310735  2441684.7419250901
          | 
    Total | 4634379.0373033052  4754238.9496692438  9388617.9869734589
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  1.72e+04
    Design-based  F(2.97, 14619.32)= 4985.7290    P = 0.0000

. svy: proportion male if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |    .416931   .0013302      .4143256     .419541
          1  |    .583069   .0013302       .580459    .5856744
--------------------------------------------------------------

. svy: proportion male if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .5016395   .0005525      .5005564    .5027226
          1  |   .4983605   .0005525      .4972774    .4994436
--------------------------------------------------------------

. 
. svy: proportion male if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .4407039   .0008414      .4390551     .442354
          1  |   .5592961   .0008414       .557646    .5609449
--------------------------------------------------------------

. svy: proportion male if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .3618591   .0016978      .3585372    .3651942
          1  |   .6381409   .0016978      .6348058    .6414628
--------------------------------------------------------------

. svy: proportion male if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |    .477496   .0018006      .4739672     .481027
          1  |    .522504   .0018006       .518973    .5260328
--------------------------------------------------------------

. svy: proportion male if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .5262008   .0006403      .5249453     .527456
          1  |   .4737992   .0006403       .472544    .4750547
--------------------------------------------------------------

. 
. *Defining race categories, where ethnicity is when race=3...can make a separate variable
. label define race 1 "White" 2 "Black" 3 "Hispanic" 4 "Asian or Pacific Islander" 5 "Native American" 6 "Other", replace

. label value race race 

. 
. gen white = 0 

. replace white = 1 if race==1
(1,313,494 real changes made)

. gen black = 0 

. replace black = 1 if race==2
(269,053 real changes made)

. gen hispanic = 0

. replace hispanic = 1 if race==3
(181,030 real changes made)

. gen asian = 0 

. replace asian = 1 if race==4
(51,751 real changes made)

. gen native = 0

. replace native = 1 if race==5
(14,022 real changes made)

. gen race_other = 0 

. replace race_other = 1 if race==6
(48,374 real changes made)

. 
. foreach var of varlist white black hispanic asian native race_other {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
    white |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2576734.5134384320   244414.9541588976  2821149.4675973295
        1 | 5922683.6108809300   644784.9085006388  6567468.5193815697
          | 
    Total | 8499418.1243193615   889199.8626595364  9388617.9869734496
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  613.2333
    Design-based  F(1, 4919)      =  210.6812     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
    black |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7278352.9315557275   764999.8457840644  8043352.7773397928
        1 | 1221065.1927623069   124200.0168754993  1345265.2096378061
          | 
    Total | 8499418.1243180353   889199.8626595638  9388617.9869734496
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   20.8629
    Design-based  F(1, 4919)      =   10.2968     P = 0.0013
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
 hispanic |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7665908.4914958812   817559.8941696625  8483468.3856655434
        1 |  833509.6328255110    71639.9684898986   905149.6013154095
          | 
    Total | 8499418.1243213918   889199.8626595610  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  565.9750
    Design-based  F(1, 4919)      =  179.4516     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
    asian |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8266403.3185780104   863459.8808090657  9129863.1993870754
        1 |  233014.8057440974    25739.9818504999   258754.7875945974
          | 
    Total | 8499418.1243221071   889199.8626595656  9388617.9869734496
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   14.0983
    Design-based  F(1, 4919)      =    3.4191     P = 0.0645
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   native |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8433883.1619357727   884624.8680200706  9318508.0299558435
        1 |   65534.9623858988     4574.9946395000    70109.9570253988
          | 
    Total | 8499418.1243216712   889199.8626595705  9388617.9869734552
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  142.9627
    Design-based  F(1, 4919)      =  102.8833     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
race_othe |                           allPAD                          
r         |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8275808.2046001693   870939.8703560738  9146748.0749562420
        1 |  223609.9197214036    18259.9923035001   241869.9120249036
          | 
    Total | 8499418.1243215725   889199.8626595740  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  213.8241
    Design-based  F(1, 4919)      =  155.0566     P = 0.0000

. svy: tab race allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
Race      |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
    White | 5922683.6108809207   644784.9085006388  6567468.5193815595
    Black | 1221065.1927623060   124200.0168754993  1345265.2096378051
 Hispanic |  833509.6328255110    71639.9684898986   905149.6013154096
 Asian or |  233014.8057440975    25739.9818504999   258754.7875945974
 Native A |   65534.9623858988     4574.9946395000    70109.9570253988
    Other |  223609.9197214035    18259.9923035001   241869.9120249036
          | 
    Total | 8499418.1243201364   889199.8626595367  9388617.9869734738
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(5)         = 1077.4719
    Design-based  F(3.78, 18577.38)=   88.5868    P = 0.0000

. svy: prop race
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                         Number of obs   = 1,877,724
Number of PSUs   = 4,920                         Population size = 9,388,618
                                                 Design df       =     4,919

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .6995139   .0027018      .6941907    .7047838
                    Black  |   .1432868   .0017938       .139806    .1468395
                 Hispanic  |   .0964092   .0018328      .0928755    .1000626
Asian or Pacific Islander  |   .0275605   .0008714      .0259026    .0293213
          Native American  |   .0074675   .0003096      .0068845    .0080996
                    Other  |    .025762   .0007082      .0244095    .0271874
----------------------------------------------------------------------------

. svy: proportion race if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                        Number of obs   =    177,840
Number of PSUs   = 4,749                        Population size = 889,199.86
                                                Design df       =      4,748

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .7251293   .0031039      .7190026    .7311725
                    Black  |   .1396762   .0020702      .1356667    .1437844
                 Hispanic  |   .0805668   .0019336      .0768566    .0844397
Asian or Pacific Islander  |   .0289474   .0012887      .0265251    .0315836
          Native American  |   .0051451   .0002704      .0046412    .0057033
                    Other  |   .0205353   .0007236      .0191636     .022003
----------------------------------------------------------------------------

. svy: proportion race if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                         Number of obs   = 1,699,884
Number of PSUs   = 4,919                         Population size = 8,499,418
                                                 Design df       =     4,918

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |    .696834   .0027217      .6914718    .7021432
                    Black  |   .1436646   .0018025      .1401668    .1472346
                 Hispanic  |   .0980667   .0018627       .094475    .1017796
Asian or Pacific Islander  |   .0274154   .0008567      .0257849    .0291459
          Native American  |   .0077105   .0003225      .0071033    .0083692
                    Other  |   .0263089   .0007184      .0249365    .0277545
----------------------------------------------------------------------------

. 
. foreach var of varlist white black hispanic asian native race_other {
  2.         svy: tab `var' cat,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
    white |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 1943409.5845293181   129049.9829353013   115364.9712235992   633324.9289098876  2821149.4675981062
        1 | 4114323.7978610424   294429.9669543070   350354.9415463071  1808359.8130152808  6567468.5193769373
          | 
    Total | 6057733.3823903603   423479.9498896083   465719.9127699063  2441684.7419251683  9388617.9869734533
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 7548.9351
    Design-based  F(2.67, 13133.79)= 1184.5145    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
    black |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5127703.2417986281   356209.9381373063   408789.9076467123  2150649.6897581760  8043352.7773408229
        1 |  930030.1405953062    67270.0117523004    56930.0051232003   291035.0521670057  1345265.2096378123
          | 
    Total | 6057733.3823939348   423479.9498896067   465719.9127699126  2441684.7419251814  9388617.9869734533
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 3847.3870
    Design-based  F(2.79, 13700.57)=  758.4750    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
 hispanic |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5422728.7017661612   385854.9673965090   431704.9267731242  2243179.7897305125  8483468.3856663071
        1 |  635004.6806309832    37624.9824931000    34014.9859967999   198504.9521945053   905149.6013153883
          | 
    Total | 6057733.3823971441   423479.9498896089   465719.9127699241  2441684.7419250184  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 2904.7516
    Design-based  F(2.62, 12871.89)=  405.0426    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
    asian |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5891858.5244081970   410299.9570828056   453159.9237262209  2374544.7941693896  9129863.1993866134
        1 |  165874.8579885003    13179.9928068000    12559.9890437000    67139.9477555990   258754.7875945994
          | 
    Total | 6057733.3823966980   423479.9498896056   465719.9127699209  2441684.7419249886  9388617.9869734608
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =   42.8323
    Design-based  F(2.26, 11102.80)=    6.2307    P = 0.0012
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
   native |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 6006628.4268057961   421094.9552113049   463529.9128087217  2427254.7351297033  9318508.0299555250
        1 |   51104.9555906996     2384.9946783000     2189.9999612000    14430.0067952000    70109.9570253996
          | 
    Total | 6057733.3823964950   423479.9498896049   465719.9127699216  2441684.7419249029  9388617.9869734701
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  447.8722
    Design-based  F(2.58, 12692.82)=  100.5895    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
race_othe |                                                cat                                                
r         |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5896338.4326730445   414889.9486848056   456049.9216712198  2379469.7719274722  9146748.0749565419
        1 |  161394.9497239008     8590.0012048000     9669.9910987000    62214.9699974996   241869.9120249004
          | 
    Total | 6057733.3823969457   423479.9498896056   465719.9127699198  2441684.7419249718  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  232.9689
    Design-based  F(2.50, 12299.58)=   46.9857    P = 0.0000

. svy: tab race cat,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
Race      |                                                cat                                                
(uniform) |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
    White | 4114323.7978610401   294429.9669543071   350354.9415463071  1808359.8130152803  6567468.5193769354
    Black |  930030.1405953062    67270.0117523004    56930.0051232003   291035.0521670056  1345265.2096378123
 Hispanic |  635004.6806309831    37624.9824931000    34014.9859967999   198504.9521945053   905149.6013153882
 Asian or |  165874.8579885003    13179.9928068000    12559.9890437000    67139.9477555990   258754.7875945994
 Native A |   51104.9555906996     2384.9946783000     2189.9999612000    14430.0067952000    70109.9570253996
    Other |  161394.9497239008     8590.0012048000     9669.9910987000    62214.9699974996   241869.9120249004
          | 
    Total | 6057733.3823904293   423479.9498896075   465719.9127699073  2441684.7419250901  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(15)        = 8902.3107
    Design-based  F(11.26, 55380.71)=  312.1790   P = 0.0000

. svy: proportion race if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                         Number of obs   =   488,337
Number of PSUs   = 4,860                         Population size = 2,441,685
                                                 Design df       =     4,859

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .7406197   .0026903      .7353108     .745859
                    Black  |   .1191944   .0015812      .1161292    .1223292
                 Hispanic  |   .0812984   .0017043      .0780192    .0847027
Asian or Pacific Islander  |   .0274974   .0009195      .0257511    .0293585
          Native American  |   .0059099   .0002649      .0054126    .0064525
                    Other  |   .0254803   .0008148      .0239309    .0271273
----------------------------------------------------------------------------

. svy: proportion race if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                        Number of obs   =     93,144
Number of PSUs   = 4,636                        Population size = 465,719.91
                                                Design df       =      4,635

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .7522868   .0030685      .7462223    .7582534
                    Black  |   .1222409   .0019775      .1184166    .1261709
                 Hispanic  |   .0730374   .0017968      .0695921    .0766392
Asian or Pacific Islander  |    .026969   .0012516      .0246208    .0295344
          Native American  |   .0047024    .000316      .0041217    .0053644
                    Other  |   .0207635   .0008413      .0191767    .0224787
----------------------------------------------------------------------------

. svy: proportion race if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                        Number of obs   =     84,696
Number of PSUs   = 4,650                        Population size = 423,479.95
                                                Design df       =      4,649

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .6952631   .0035348      .6882892    .7021484
                    Black  |   .1588505   .0025738      .1538695    .1639616
                 Hispanic  |   .0888471   .0023751      .0842996    .0936149
Asian or Pacific Islander  |   .0311231   .0014552      .0283933     .034106
          Native American  |   .0056319    .000335      .0050119    .0063282
                    Other  |   .0202843   .0007719      .0188251    .0218541
----------------------------------------------------------------------------

. svy: proportion race if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                         Number of obs   = 1,211,547
Number of PSUs   = 4,913                         Population size = 6,057,733
                                                 Design df       =     4,912

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .6791854   .0027818      .6737076    .6846142
                    Black  |   .1535277   .0019394      .1497641    .1573684
                 Hispanic  |   .1048255   .0019683      .1010289    .1087474
Asian or Pacific Islander  |   .0273823   .0008527      .0257593    .0291046
          Native American  |   .0084363   .0003636      .0077526    .0091798
                    Other  |   .0266428   .0007111      .0252837    .0280728
----------------------------------------------------------------------------

. 
. *Defining median income categories
. foreach n of numlist 1/4 {
  2. gen income_q`n' = 0
  3. replace income_q`n' = 1 if zipinc_qrtl==`n'
  4. }
(583,315 real changes made)
(487,295 real changes made)
(428,804 real changes made)
(345,081 real changes made)

. gen income_q_miss = 0

. replace income_q_miss=1 if zipinc_qrtl==.
(33,229 real changes made)

. replace zipinc_qrtl=5 if zipinc_qrtl==.
(33,229 real changes made)

. 
. foreach var of varlist income_q1 income_q2 income_q3 income_q4 income_q_miss {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
income_q1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5842168.3586196592   629874.8708225428  6472043.2294422025
        1 | 2657249.7657000730   259324.9918369918  2916574.7575370646
          | 
    Total | 8499418.1243197322   889199.8626595347  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  331.5602
    Design-based  F(1, 4919)      =  100.8868     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
income_q2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 6290393.4918979760   661749.8869325619  6952143.3788305381
        1 | 2209024.6324225729   227449.9757269992  2436474.6081495723
          | 
    Total | 8499418.1243205499   889199.8626595611  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   14.1612
    Design-based  F(1, 4919)      =    7.1769     P = 0.0074
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
income_q3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 6562443.9053225508   682154.9195656513  7244598.8248882014
        1 | 1936974.2189958354   207044.9430938986  2144019.1620897339
          | 
    Total | 8499418.1243183855   889199.8626595499  9388617.9869734738
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   22.3792
    Design-based  F(1, 4919)      =   11.5908     P = 0.0007
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
income_q4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 6955703.5755031779   707509.9103244592  7663213.4858276369
        1 | 1543714.5488143337   181689.9523350995  1725404.5011494330
          | 
    Total | 8499418.1243175119   889199.8626595587  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  553.2427
    Design-based  F(1, 4919)      =   89.3134     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
income_q_ |                           allPAD                          
miss      |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8346963.1659404822   875509.8629930706  9222473.0289335530
        1 |  152454.9583817017    13689.9996665000   166144.9580482017
          | 
    Total | 8499418.1243221834   889199.8626595706  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   59.8105
    Design-based  F(1, 4919)      =   54.3403     P = 0.0000

. svy: tab zipinc_qrtl allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
Median    |
household |
income    |
national  |
quartile  |
for       |
patient   |                           allPAD                          
ZIP Code  |                  0                   1               Total
----------+-----------------------------------------------------------
        1 | 2657249.7657000809   259324.9918369918  2916574.7575370725
        2 | 2209024.6324225804   227449.9757269993  2436474.6081495793
        3 | 1936974.2189958349   207044.9430938986  2144019.1620897334
        4 | 1543714.5488143330   181689.9523350995  1725404.5011494325
        5 |  152454.9583817017    13689.9996665000   166144.9580482017
          | 
    Total | 8499418.1243145298   889199.8626594892  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(4)         =  766.6377
    Design-based  F(2.44, 11997.06)=   68.1163    P = 0.0000

. svy: proportion zipinc_qrtl if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .2916386   .0035814      .2846674    .2987092
          2  |   .2557917   .0023248      .2512608    .2603759
          3  |   .2328441   .0022033      .2285525    .2371915
          4  |   .2043297   .0038407      .1969032    .2119624
          5  |   .0153959   .0003449      .0147341    .0160869
--------------------------------------------------------------

. svy: proportion zipinc_qrtl if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |    .312639    .003014      .3067609     .318578
          2  |    .259903   .0018185      .2563538     .263484
          3  |   .2278949    .001776      .2244319    .2313955
          4  |   .1816259   .0026802      .1764306    .1869395
          5  |   .0179371   .0002554      .0174432    .0184448
--------------------------------------------------------------

. 
. foreach var of varlist income_q1 income_q2 income_q3 income_q4 income_q_miss {
  2.         svy: tab `var' cat,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
income_q1 |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4147008.7045034147   299974.9369749046   329899.9338476141  1695159.6541115490  6472043.2294374816
        1 | 1910724.6778861717   123505.0129147002   135819.9789223003   746525.0878135510  2916574.7575367233
          | 
    Total | 6057733.3823895864   423479.9498896048   465719.9127699144  2441684.7419250999  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  483.7676
    Design-based  F(2.57, 12641.00)=   70.0240    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
income_q2 |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4488428.6621980183   317849.9547588020   343899.9321737085  1801964.8296949491  6952143.3788254783
        1 | 1569304.7201922042   105629.9951307994   121819.9805961996   639719.9122301325  2436474.6081493353
          | 
    Total | 6057733.3823902225   423479.9498896014   465719.9127699081  2441684.7419250817  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =   63.8526
    Design-based  F(2.80, 13796.40)=   13.2880    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
income_q3 |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4681534.0266381009   324389.9840710027   357764.9354946043  1880909.8786824741  7244598.8248861823
        1 | 1376199.3557531987    99089.9658185995   107954.9772752994   560774.8632427419  2144019.1620898391
          | 
    Total | 6057733.3823912991   423479.9498896023   465719.9127699037  2441684.7419252163  9388617.9869734608
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =   35.7965
    Design-based  F(2.83, 13901.64)=    7.7620    P = 0.0001
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
          |                                                cat                                                
income_q4 |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4970713.7223821450   335089.9705580022   372419.9397664024  1984989.8531222511  7663213.4858288001
        1 | 1087019.6600114256    88389.9793315995    93299.9730034995   456694.8888030363  1725404.5011495608
          | 
    Total | 6057733.3823935706   423479.9498896018   465719.9127699019  2441684.7419252871  9388617.9869734589
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  707.9845
    Design-based  F(2.10, 10329.00)=   71.0109    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
income_q_ |                                                cat                                                
miss      |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5943248.4138507238   416614.9531957054   458894.9097973201  2403714.7520891670  9222473.0289329160
        1 |  114484.9685459007     6864.9966939000     6825.0029726000    37969.9898357998   166144.9580482006
          | 
    Total | 6057733.3823966244   423479.9498896054   465719.9127699201  2441684.7419249667  9388617.9869734570
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  290.4527
    Design-based  F(2.92, 14363.41)=   84.0629    P = 0.0000

. svy: tab zipinc_qrtl cat,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
Median    |
household |
income    |
national  |
quartile  |
for       |
patient   |                                                cat                                                
ZIP Code  |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        1 | 1910724.6778861659   123505.0129147002   135819.9789223003   746525.0878135508  2916574.7575367168
        2 | 1569304.7201922028   105629.9951307994   121819.9805961996   639719.9122301324  2436474.6081493339
        3 | 1376199.3557531987    99089.9658185996   107954.9772752993   560774.8632427419  2144019.1620898396
        4 | 1087019.6600114245    88389.9793315995    93299.9730034995   456694.8888030364  1725404.5011495599
        5 |  114484.9685459007     6864.9966939000     6825.0029726000    37969.9898357998   166144.9580482006
          | 
    Total | 6057733.3823888926   423479.9498895987   465719.9127698988  2441684.7419252614  9388617.9869734626
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(12)        = 1271.5757
    Design-based  F(7.25, 35659.44)=   54.6010    P = 0.0000

. svy: proportion zipinc_qrtl if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .3057418   .0032306      .2994453    .3121118
          2  |   .2619994   .0020324      .2580345    .2660033
          3  |   .2296672   .0019556      .2258558    .2335235
          4  |   .1870409   .0029881      .1812534    .1929697
          5  |   .0155507   .0002708      .0150287    .0160907
--------------------------------------------------------------

. svy: proportion zipinc_qrtl if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .2916345   .0036321      .2845652     .298806
          2  |   .2615735   .0025742      .2565584    .2666515
          3  |   .2318024   .0024018      .2271272    .2365444
          4  |   .2003349   .0038439      .1929053    .2079771
          5  |   .0146547   .0004368      .0138226    .0155362
--------------------------------------------------------------

. svy: proportion zipinc_qrtl if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .2916431   .0039477      .2839646    .2994425
          2  |   .2494333   .0025686      .2444317    .2545028
          3  |   .2339897   .0024915      .2291407    .2389096
          4  |   .2087229   .0041653      .2006746    .2170064
          5  |   .0162109   .0004704       .015314    .0171595
--------------------------------------------------------------

. svy: proportion zipinc_qrtl if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .3154191   .0029903      .3095864    .3213105
          2  |   .2590581   .0018015      .2555419    .2626055
          3  |   .2271806   .0017644      .2237402    .2306581
          4  |   .1794433   .0026058      .1743914    .1846088
          5  |    .018899   .0002839      .0183503    .0194637
--------------------------------------------------------------

. 
. *Making expected primary payer
. replace pay1 = 7 if pay1==.
(1,839 real changes made)

. label define pay1 1 "Medicare" 2 "Medicaid" 3 "Private" 4 "self-pay" 5 "no charge" 6 "other" 7 "missing"

. label value pay1 pay1

. 
. foreach n of numlist 1/7 {
  2. gen pay1_`n' = 0
  3. replace pay1_`n' = 1 if pay1 ==`n'
  4. }
(1,292,120 real changes made)
(221,648 real changes made)
(270,083 real changes made)
(49,071 real changes made)
(3,989 real changes made)
(38,974 real changes made)
(1,839 real changes made)

. 
. foreach var of varlist pay1_1 pay1_2 pay1_3 pay1_4 pay1_5 pay1_6 pay1_7{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2754924.5488763079   173094.9849080981  2928019.5337844058
        1 | 5744493.5754434094   716104.8777514661  6460598.4531948753
          | 
    Total | 8499418.1243197173   889199.8626595642  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.26e+04
    Design-based  F(1, 4919)      = 6393.6655     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7450248.4953232221   830129.8797578807  8280378.3750811033
        1 | 1049169.6289962735    59069.9829017000  1108239.6118979736
          | 
    Total | 8499418.1243194956   889199.8626595807  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 5026.1299
    Design-based  F(1, 4919)      = 3189.9074     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7237128.2041747607   801074.8694353885  8038203.0736101493
        1 | 1262289.9201438043    88124.9932241997  1350414.9133680041
          | 
    Total | 8499418.1243185643   889199.8626595882  9388617.9869734589
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 3191.5733
    Design-based  F(1, 4919)      = 2208.7007     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8263323.0758907497   879939.8581130707  9143262.9340038206
        1 |  236095.0484307871     9260.0045465000   245355.0529772871
          | 
    Total | 8499418.1243215371   889199.8626595706  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 1907.3046
    Design-based  F(1, 4919)      = 1621.7059     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_5 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8480088.1222349033   888584.8634423703  9368672.9856772739
        1 |   19330.0020860000      614.9992172000    19945.0013032000
          | 
    Total | 8499418.1243209019   889199.8626595703  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  190.2275
    Design-based  F(1, 4919)      =  178.6608     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_6 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8320063.1443772130   873684.8581093726  9193748.0024865847
        1 |  179354.9799446996    15515.0045502001   194869.9844948996
          | 
    Total | 8499418.1243219133   889199.8626595726  9388617.9869734626
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  105.7454
    Design-based  F(1, 4919)      =   80.1479     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_7 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8490733.1550449915   888689.8621912701  9379423.0172362607
        1 |    8684.9692755000      510.0004683000     9194.9697438000
          | 
    Total | 8499418.1243204921   889199.8626595702  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   33.0670
    Design-based  F(1, 4919)      =   34.9229     P = 0.0000

. svy: tab pay1 allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
Primary   |
expected  |
payer     |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
 Medicare | 5744493.5754434094   716104.8777514659  6460598.4531948753
 Medicaid | 1049169.6289962735    59069.9829017000  1108239.6118979736
  Private | 1262289.9201438043    88124.9932241997  1350414.9133680041
 self-pay |  236095.0484307870     9260.0045465000   245355.0529772870
 no charg |   19330.0020860000      614.9992172000    19945.0013032000
    other |  179354.9799446996    15515.0045502001   194869.9844948996
  missing |    8684.9692755000      510.0004683000     9194.9697438000
          | 
    Total | 8499418.1243204735   889199.8626595656  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(6)         =  1.33e+04
    Design-based  F(5.58, 27435.23)= 1743.8835    P = 0.0000

. svy: proportion pay1 if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .8053362   .0015667      .8022464    .8083893
   Medicaid  |   .0664305   .0008549       .064774    .0681263
    Private  |   .0991059   .0011902      .0967969    .1014639
   self-pay  |   .0104139   .0003171      .0098102    .0110543
  no charge  |   .0006916   .0000712      .0005652    .0008463
      other  |   .0174483   .0004792      .0165333    .0184129
    missing  |   .0005735   .0000693      .0004525    .0007269
--------------------------------------------------------------

. svy: proportion pay1 if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |    .675869   .0012414      .6734306     .678298
   Medicaid  |   .1234402   .0010396      .1214165    .1254927
    Private  |   .1485149   .0009941      .1465765    .1504743
   self-pay  |   .0277778   .0004907      .0268318    .0287561
  no charge  |   .0022743   .0001025       .002082    .0024843
      other  |    .021102   .0003423      .0204413    .0217836
    missing  |   .0010218    .000074      .0008865    .0011777
--------------------------------------------------------------

. 
. foreach var of varlist pay1_1 pay1_2 pay1_3 pay1_4 pay1_5 pay1_6 pay1_7{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2754924.5488763074   173094.9849080981  2928019.5337844053
        1 | 5744493.5754434112   716104.8777514661  6460598.4531948771
          | 
    Total | 8499418.1243197192   889199.8626595644  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.26e+04
    Design-based  F(1, 4919)      = 6393.6655     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7450248.4953232193   830129.8797578807  8280378.3750811005
        1 | 1049169.6289962733    59069.9829017000  1108239.6118979733
          | 
    Total | 8499418.1243194919   889199.8626595808  9388617.9869734496
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 5026.1299
    Design-based  F(1, 4919)      = 3189.9074     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7237128.2041747570   801074.8694353884  8038203.0736101447
        1 | 1262289.9201438040    88124.9932241997  1350414.9133680037
          | 
    Total | 8499418.1243185606   889199.8626595881  9388617.9869734757
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 3191.5733
    Design-based  F(1, 4919)      = 2208.7007     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8263323.0758907571   879939.8581130707  9143262.9340038281
        1 |  236095.0484307870     9260.0045465000   245355.0529772870
          | 
    Total | 8499418.1243215445   889199.8626595706  9388617.9869734626
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 1907.3046
    Design-based  F(1, 4919)      = 1621.7059     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_5 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8480088.1222348996   888584.8634423702  9368672.9856772702
        1 |   19330.0020860000      614.9992172000    19945.0013032000
          | 
    Total | 8499418.1243209001   889199.8626595702  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  190.2275
    Design-based  F(1, 4919)      =  178.6608     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_6 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8320063.1443772111   873684.8581093727  9193748.0024865847
        1 |  179354.9799446996    15515.0045502001   194869.9844948996
          | 
    Total | 8499418.1243219115   889199.8626595726  9388617.9869734701
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  105.7454
    Design-based  F(1, 4919)      =   80.1479     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_7 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8490733.1550449878   888689.8621912705  9379423.0172362570
        1 |    8684.9692755000      510.0004683000     9194.9697438000
          | 
    Total | 8499418.1243204884   889199.8626595704  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   33.0670
    Design-based  F(1, 4919)      =   34.9229     P = 0.0000

. svy: tab pay1 cat,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
Primary   |
expected  |
payer     |                                                cat                                                
(uniform) |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
 Medicare | 3812523.7648596717   327134.9676067043   388969.9101447100  1931969.8105777842  6460598.4531888701
 Medicaid |  872229.6830876409    35649.9847510999    23419.9981505999   176939.9459086978  1108239.6118980388
  Private | 1015639.9279977136    47264.9866243999    40860.0065997999   246649.9921460975  1350414.9133680109
 self-pay |  202180.0380963938     5580.0016235000     3680.0029230000    33915.0103343998   245355.0529772936
 no charg |   16705.0018219000      384.9994200000      229.9997972000     2625.0002641000    19945.0013032000
    other |  131914.9894243011     7235.0093907000     8279.9951595000    47439.9905204001   194869.9844949012
  missing |    6539.9771019000      230.0004732000      279.9999951000     2144.9921736000     9194.9697438000
          | 
    Total | 6057733.3823895231   423479.9498896041   465719.9127699099  2441684.7419250794  9388617.9869734570
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(18)        =  5.89e+04
    Design-based  F(15.74, 77424.20)= 2494.4499   P = 0.0000

. svy: proportion pay1 if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .7912446   .0012294      .7888242    .7936445
   Medicaid  |   .0724663   .0007249       .071058    .0739004
    Private  |   .1010163   .0010398       .098996    .1030732
   self-pay  |     .01389   .0002985      .0133167    .0144876
  no charge  |   .0010751   .0000838      .0009227    .0012526
      other  |   .0194292   .0003801      .0186979    .0201885
    missing  |   .0008785    .000069      .0007531    .0010247
--------------------------------------------------------------

. svy: proportion pay1 if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .8352014   .0016959      .8318496    .8384993
   Medicaid  |   .0502877    .000847       .048653    .0519744
    Private  |   .0877352   .0013869      .0850541    .0904924
   self-pay  |   .0079018   .0003417      .0072592    .0086007
  no charge  |   .0004939    .000084      .0003539    .0006892
      other  |   .0177789   .0005762      .0166838    .0189445
    missing  |   .0006012   .0000895      .0004491    .0008049
--------------------------------------------------------------

. svy: proportion pay1 if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .7724922   .0020592      .7684299     .776504
   Medicaid  |   .0841834   .0012848      .0816986    .0867366
    Private  |   .1116109   .0014099      .1088767     .114405
   self-pay  |   .0131765   .0004732      .0122804    .0141371
  no charge  |   .0009091   .0001067      .0007223    .0011442
      other  |   .0170847   .0005648      .0160118     .018228
    missing  |   .0005431   .0000895      .0003931    .0007504
--------------------------------------------------------------

. svy: proportion pay1 if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .6293647   .0012948      .6268229    .6318995
   Medicaid  |   .1439861   .0012059      .1416381    .1463665
    Private  |   .1676601   .0010447      .1656219    .1697182
   self-pay  |   .0333755   .0005978      .0322233    .0345675
  no charge  |   .0027576   .0001242      .0025246    .0030121
      other  |   .0217763   .0003571      .0210871    .0224875
    missing  |   .0010796    .000083      .0009285    .0012553
--------------------------------------------------------------

. 
. *Making hospital location variable
. replace hosp_locteach = 4 if hosp_locteach==.
(0 real changes made)

. label define hosp_locteach 1 "Rural" 2 "Urban Nonteaching" 3 "Urban Teaching" 4 "Missing"

. label value hosp_locteach hosp_locteach

. 
. foreach n of numlist 1/4 {
  2. gen hosp_locteach`n' = 0
  3. replace hosp_locteach`n' = 1 if hosp_locteach ==`n'
  4. }
(178,867 real changes made)
(439,878 real changes made)
(1,258,979 real changes made)
(0 real changes made)

. 
. foreach var of varlist hosp_locteach1 hosp_locteach2 hosp_locteach3 hosp_locteach4 {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each1     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7678223.3505949508   816059.8587583980  8494283.2093533501
        1 |  821194.7737254640    73140.0039011998   894334.7776266638
          | 
    Total | 8499418.1243204158   889199.8626595978  9388617.9869734701
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  385.4308
    Design-based  F(1, 4919)      =  147.6643     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each2     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 6503033.0510309134   686194.8158172034  7189227.8668481158
        1 | 1996385.0732940962   203005.0468424024  2199390.1201364985
          | 
    Total | 8499418.1243250091   889199.8626596057  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   38.9071
    Design-based  F(1, 4919)      =    6.1082     P = 0.0135
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each3     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2817579.8470198852   276145.0507435941  3093724.8977634790
        1 | 5681838.2773038726   613054.8119159950  6294893.0892198673
          | 
    Total | 8499418.1243237574   889199.8626595892  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  319.7726
    Design-based  F(1, 4919)      =   48.7650     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
   allPAD |              count
----------+-------------------
        0 | 8499418.1243202798
        1 |  889199.8626595701
          | 
    Total | 9388617.9869798496
------------------------------
Key:    count = Weighted count

  Only one row category.
  Statistics cannot be computed.

  Pearson:
    Uncorrected   chi2(0)         =         .
    Design-based  F(., .)         =         .     P =      .

. svy: tab hosp_locteach allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
Location/ |
teaching  |
status of |
hospital  |                           allPAD                          
(STRATA)  |                  0                   1               Total
----------+-----------------------------------------------------------
    Rural |  821194.7737254640    73140.0039011998   894334.7776266638
 Urban No | 1996385.0732940962   203005.0468424024  2199390.1201364985
 Urban Te | 5681838.2773038726   613054.8119159951  6294893.0892198673
          | 
    Total | 8499418.1243234333   889199.8626595973  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(2)         =  483.8794
    Design-based  F(1.63, 8038.34)=   51.7285     P = 0.0000

. svy: proportion hosp_locteach if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                Number of obs   =    177,840
Number of PSUs   = 4,749                Population size = 889,199.86
                                        Design df       =      4,748

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0822537    .002293      .0778687    .0868624
Urban Nonteaching  |   .2283008   .0048248      .2189801    .2378974
   Urban Teaching  |   .6894455   .0052672      .6790262    .6996761
--------------------------------------------------------------------

. svy: proportion hosp_locteach if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                 Number of obs   = 1,699,884
Number of PSUs   = 4,919                 Population size = 8,499,418
                                         Design df       =     4,918

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0966178   .0022533      .0922896    .1011262
Urban Nonteaching  |   .2348849   .0042318      .2266905    .2432824
   Urban Teaching  |   .6684973   .0046676      .6592839    .6775835
--------------------------------------------------------------------

. 
. foreach var of varlist hosp_locteach1 hosp_locteach2 hosp_locteach3 hosp_locteach4 {
  2.         svy: tab `var' cat,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
hosp_loct |                                                cat                                                
each1     |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5477438.7038268596   390699.9491893121   425359.9095690245  2200784.6467684079  8494283.2093536053
        1 |  580294.6785688049    32780.0007002999    40360.0032009001   240900.0951565911   894334.7776265959
          | 
    Total | 6057733.3823956652   423479.9498896120   465719.9127699246  2441684.7419249988  9388617.9869734757
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  462.7253
    Design-based  F(2.51, 12322.23)=   66.7139    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
hosp_loct |                                                cat                                                
each2     |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4633453.4239700735   328739.9157028111   357454.9001143077  1869579.6270549069  7189227.8668420995
        1 | 1424279.9584232981    94740.0341868016   108265.0126556027   572105.1148699219  2199390.1201356240
          | 
    Total | 6057733.3823933713   423479.9498896127   465719.9127699105  2441684.7419248288  9388617.9869734608
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =   59.1145
    Design-based  F(2.28, 11238.76)=    4.9513    P = 0.0049
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
hosp_loct |                                                cat                                                
each3     |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 2004574.6369929244   127520.0348871023   148625.0158565017   813005.2100264044  3093724.8977629328
        1 | 4053158.7453966555   295959.9150025087   317094.8969134174  1628679.5318983030  6294893.0892108846
          | 
    Total | 6057733.3823895799   423479.9498896110   465719.9127699191  2441684.7419247073  9388617.9869734682
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  391.5326
    Design-based  F(2.30, 11325.81)=   31.6607    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
      cat |              count
----------+-------------------
        0 | 6057733.3823962789
        1 |  423479.9498896034
        2 |  465719.9127699217
        3 | 2441684.7419249029
          | 
    Total | 9388617.9869807083
------------------------------
Key:    count = Weighted count

  Only one row category.
  Statistics cannot be computed.

  Pearson:
    Uncorrected   chi2(0)         =         .
    Design-based  F(., .)         =         .     P =      .

. svy: tab hosp_locteach cat,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
Location/ |
teaching  |
status of |
hospital  |                                                cat                                                
(STRATA)  |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
    Rural |  580294.6785688049    32780.0007002999    40360.0032009001   240900.0951565912   894334.7776265960
 Urban No | 1424279.9584232976    94740.0341868016   108265.0126556027   572105.1148699218  2199390.1201356235
 Urban Te | 4053158.7453966560   295959.9150025087   317094.8969134174  1628679.5318983048  6294893.0892108874
          | 
    Total | 6057733.3823887585   423479.9498896102   465719.9127699203  2441684.7419248177  9388617.9869734589
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(6)         =  592.9309
    Design-based  F(4.21, 20718.84)=   30.5181    P = 0.0000

. svy: proportion hosp_locteach if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                 Number of obs   =   488,337
Number of PSUs   = 4,860                 Population size = 2,441,685
                                         Design df       =     4,859

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0986614   .0024784       .093908     .103628
Urban Nonteaching  |   .2343075   .0043435      .2258999    .2429299
   Urban Teaching  |    .667031   .0048461      .6574636    .6764628
--------------------------------------------------------------------

. svy: proportion hosp_locteach if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                Number of obs   =     93,144
Number of PSUs   = 4,636                Population size = 465,719.91
                                        Design df       =      4,635

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0866615   .0025501      .0817909    .0917932
Urban Nonteaching  |   .2324681   .0049492      .2229068    .2423116
   Urban Teaching  |   .6808704   .0054148      .6701624    .6913908
--------------------------------------------------------------------

. svy: proportion hosp_locteach if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                Number of obs   =     84,696
Number of PSUs   = 4,650                Population size = 423,479.95
                                        Design df       =      4,649

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0774063   .0022622      .0730861    .0819592
Urban Nonteaching  |   .2237179   .0050362      .2139998     .233746
   Urban Teaching  |   .6988759   .0055003      .6879841     .709548
--------------------------------------------------------------------

. svy: proportion hosp_locteach if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                 Number of obs   = 1,211,547
Number of PSUs   = 4,913                 Population size = 6,057,733
                                         Design df       =     4,912

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |    .095794   .0022068      .0915542    .1002086
Urban Nonteaching  |   .2351176   .0042546      .2268794    .2435608
   Urban Teaching  |   .6690883   .0046751      .6598598    .6781886
--------------------------------------------------------------------

. 
. *Comorbidities
. 
. *Making uncomplicated diabetes variable without Type 1 codes
. gen cm_dm = 0 

. foreach num of numlist 2/40 {
  2. replace cm_dm = 1 if inlist(i10_dx`num', "E0821", "E0822", "E0829", "E08311", "E08319") | inlist(i10_dx`num', "E08321",
>  "E083211", "E083212", "E083213", "E083219") | inlist(i10_dx`num', "E08329", "E083291", "E083292", "E083293", "E083299") |
>  inlist(i10_dx`num', "E08331", "E083311", "E083312", "E083313", "E083319") | inlist(i10_dx`num', "E08339", "E083391", "E08
> 3392", "E083393", "E083399") | inlist(i10_dx`num', "E08341", "E083411", "E083412", "E083413", "E083419") | inlist(i10_dx`n
> um', "E08349", "E083491", "E083492", "E083493", "E083499") | inlist(i10_dx`num', "E08351", "E083511", "E083512", "E083513"
> , "E083519") | inlist(i10_dx`num', "E083521", "E083522", "E083523", "E083529", "E083531") | inlist(i10_dx`num', "E083532",
>  "E083533", "E083539", "E083541", "E083542") | inlist(i10_dx`num', "E083543", "E083549", "E083551", "E083552", "E083553") 
> | inlist(i10_dx`num', "E083559", "E08359", "E083591", "E083592", "E083593") | inlist(i10_dx`num', "E083599", "E0836", "E08
> 37X1", "E0837X2", "E0837X3") | inlist(i10_dx`num', "E0837X9", "E0839", "E0840", "E0841", "E0842") | inlist(i10_dx`num', "E
> 0843", "E0844", "E0849", "E0851", "E0852") | inlist(i10_dx`num', "E0859", "E08610", "E08618", "E08620", "E08621") | inlist
> (i10_dx`num', "E08622", "E08628", "E08630", "E08638", "E08641") | inlist(i10_dx`num', "E08649", "E0865", "E0869", "E088", 
> "E0921") | inlist(i10_dx`num', "E0922", "E0929", "E09311", "E09319", "E09321") | inlist(i10_dx`num', "E093211", "E093212",
>  "E093213", "E093219", "E09329") | inlist(i10_dx`num', "E093291", "E093292", "E093293", "E093299", "E09331") | inlist(i10_
> dx`num', "E093311", "E093312", "E093313", "E093319", "E09339") | inlist(i10_dx`num', "E093391", "E093392", "E093393", "E09
> 3399", "E09341") | inlist(i10_dx`num', "E093411", "E093412", "E093413", "E093419", "E09349") | inlist(i10_dx`num', "E09349
> 1", "E093492", "E093493", "E093499", "E09351") | inlist(i10_dx`num', "E093511", "E093512", "E093513", "E093519", "E093521"
> ) | inlist(i10_dx`num', "E093522", "E093523", "E093529", "E093531", "E093532") | inlist(i10_dx`num', "E093533", "E093539",
>  "E093541", "E093542", "E093543") | inlist(i10_dx`num', "E093549", "E093551", "E093552", "E093553", "E093559") | inlist(i1
> 0_dx`num', "E09359", "E093591", "E093592", "E093593", "E093599") | inlist(i10_dx`num', "E0936", "E0937X1", "E0937X2", "E09
> 37X3", "E0937X9") | inlist(i10_dx`num', "E0939", "E0940", "E0941", "E0942", "E0943") | inlist(i10_dx`num', "E0944", "E0949
> ", "E0951", "E0952", "E0959") | inlist(i10_dx`num', "E09610", "E09618", "E09620", "E09621", "E09622") | inlist(i10_dx`num'
> , "E09628", "E09630", "E09638", "E09641", "E09649") | inlist(i10_dx`num', "E0965", "E0969", "E098") | inlist(i10_dx`num', 
> "E1121", "E1122", "E1129") | inlist(i10_dx`num', "E11311", "E11319", "E11321", "E113211", "E113212") | inlist(i10_dx`num',
>  "E113213", "E113219", "E11329", "E113291", "E113292") | inlist(i10_dx`num', "E113293", "E113299", "E11331", "E113311", "E
> 113312") | inlist(i10_dx`num', "E113313", "E113319", "E11339", "E113391", "E113392") | inlist(i10_dx`num', "E113393", "E11
> 3399", "E11341", "E113411", "E113412") | inlist(i10_dx`num', "E113413", "E113419", "E11349", "E113491", "E113492") | inlis
> t(i10_dx`num', "E113493", "E113499", "E11351", "E113511", "E113512") | inlist(i10_dx`num', "E113513", "E113519", "E113521"
> , "E113522", "E113523") | inlist(i10_dx`num', "E113529", "E113531", "E113532", "E113533", "E113539") | inlist(i10_dx`num',
>  "E113541", "E113542", "E113543", "E113549", "E113551") | inlist(i10_dx`num', "E113552", "E113553", "E113559", "E11359", "
> E113591") | inlist(i10_dx`num', "E113592", "E113593", "E113599", "E1136", "E1137X1") | inlist(i10_dx`num', "E1137X2", "E11
> 37X3", "E1137X9", "E1139", "E1140") | inlist(i10_dx`num', "E1141", "E1142", "E1143", "E1144", "E1149") | inlist(i10_dx`num
> ', "E1151", "E1152", "E1159", "E11610", "E11618") | inlist(i10_dx`num', "E11620", "E11621", "E11622", "E11628", "E11630") 
> | inlist(i10_dx`num', "E11638", "E11641", "E11649", "E1165", "E1169") | inlist(i10_dx`num', "E118", "E1321", "E1322", "E13
> 29", "E13311") | inlist(i10_dx`num', "E13319", "E13321", "E133211", "E133212", "E133213") | inlist(i10_dx`num', "E133219",
>  "E13329", "E133291", "E133292", "E133293") | inlist(i10_dx`num', "E133299", "E13331", "E133311", "E133312", "E133313") | 
> inlist(i10_dx`num', "E133319", "E13339", "E133391", "E133392", "E133393") | inlist(i10_dx`num', "E133399", "E13341", "E133
> 411", "E133412", "E133413") | inlist(i10_dx`num', "E133419", "E13349", "E133491", "E133492", "E133493") | inlist(i10_dx`nu
> m', "E133499", "E13351", "E133511", "E133512", "E133513") | inlist(i10_dx`num', "E133519", "E133521", "E133522", "E133523"
> , "E133529") | inlist(i10_dx`num', "E133531", "E133532", "E133533", "E133539", "E133541") | inlist(i10_dx`num', "E133542",
>  "E133543", "E133549", "E133551", "E133552") | inlist(i10_dx`num', "E133553", "E133559", "E13359", "E133591", "E133592") |
>  inlist(i10_dx`num', "E133593", "E133599", "E1336", "E1337X1", "E1337X2") | inlist(i10_dx`num', "E1337X3", "E1337X9", "E13
> 39", "E1340", "E1341") | inlist(i10_dx`num', "E1342", "E1343", "E1344", "E1349", "E1351") | inlist(i10_dx`num', "E1352", "
> E1359", "E13610", "E13618", "E13620") | inlist(i10_dx`num', "E13621", "E13622", "E13628", "E13630", "E13638") | inlist(i10
> _dx`num', "E13641", "E13649", "E1365", "E1369", "E138") | inlist(i10_dx`num', "E0800", "E0801", "E0810", "E0811", "E089") 
> | inlist(i10_dx`num', "E0900", "E0901", "E0910", "E0911", "E099") | inlist(i10_dx`num', "E1100", "E1101") | inlist(i10_dx`
> num', "E1110", "E1111", "E119", "E1300", "E1301") | inlist(i10_dx`num', "E1310", "E1311", "E139", "O24011", "O24012") | in
> list(i10_dx`num', "O24013", "O24019", "O2402", "O2403", "O24111") | inlist(i10_dx`num', "O24112", "O24113", "O24119", "O24
> 12", "O2413") | inlist(i10_dx`num', "O24311", "O24312", "O24313", "O24319", "O2432") | inlist(i10_dx`num', "O2433", "O2441
> 0", "O24414", "O24415", "O24419") | inlist(i10_dx`num', "O24420", "O24424", "O24425", "O24429", "O24430") | inlist(i10_dx`
> num', "O24434", "O24435", "O24439", "O24811", "O24812") | inlist(i10_dx`num', "O24813", "O24819", "O2482", "O2483", "O2491
> 1") | inlist(i10_dx`num', "O24912", "O24913", "O24919", "O2492", "O2493")
  3. }
(26,371 real changes made)
(35,019 real changes made)
(42,547 real changes made)
(47,493 real changes made)
(54,069 real changes made)
(56,276 real changes made)
(55,060 real changes made)
(51,415 real changes made)
(48,182 real changes made)
(44,777 real changes made)
(41,450 real changes made)
(37,317 real changes made)
(33,355 real changes made)
(29,411 real changes made)
(24,408 real changes made)
(21,001 real changes made)
(17,820 real changes made)
(13,160 real changes made)
(11,236 real changes made)
(9,536 real changes made)
(7,989 real changes made)
(6,831 real changes made)
(5,846 real changes made)
(4,305 real changes made)
(1,216 real changes made)
(1,062 real changes made)
(905 real changes made)
(722 real changes made)
(584 real changes made)
(270 real changes made)
(213 real changes made)
(117 real changes made)
(78 real changes made)
(65 real changes made)
(55 real changes made)
(48 real changes made)
(41 real changes made)
(26 real changes made)
(20 real changes made)

. 
. foreach var of varlist allPAD cat {
  2.         svy: tab `var' cm_dm,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           cm_dm                           
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5190908.8443247555  3308509.2799957115  8499418.1243204679
        1 |  546229.9397792246   342969.9228803086   889199.8626595332
          | 
    Total | 5737138.7841039794  3651479.2028760202  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    8.5699
    Design-based  F(1, 4919)      =    5.0536     P = 0.0246
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           cm_dm                           
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 3925098.9452648209  2132634.4371246207  6057733.3823894411
        1 |  276984.9772616010   146494.9726280012   423479.9498896022
        2 |  269244.9625176046   196474.9502522984   465719.9127699030
        3 | 1265809.8990538958  1175874.8428711975  2441684.7419250929
          | 
    Total | 5737138.7840979220  3651479.2028761175  9388617.9869734552
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  2.57e+04
    Design-based  F(2.89, 14220.19)= 6124.9374    P = 0.0000

. 
. svy: proportion cm_dm if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |   .6142938   .0016367      .6110801    .6174975
          1  |   .3857062   .0016367      .3825025    .3889199
--------------------------------------------------------------

. svy: proportion cm_dm if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |    .610737   .0008142      .6091396    .6123319
          1  |    .389263   .0008142      .3876681    .3908604
--------------------------------------------------------------

. 
. svy: proportion cm_dm if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |   .5184166    .001148      .5161657    .5206668
          1  |   .4815834    .001148      .4793332    .4838343
--------------------------------------------------------------

. svy: proportion cm_dm if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |   .5781264    .002023      .5741553    .5820874
          1  |   .4218736    .002023      .4179126    .4258447
--------------------------------------------------------------

. svy: proportion cm_dm if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |   .6540687   .0020809      .6499779    .6581368
          1  |   .3459313   .0020809      .3418632    .3500221
--------------------------------------------------------------

. svy: proportion cm_dm if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
       cm_dm |
          0  |   .6479484   .0008058      .6463672    .6495265
          1  |   .3520516   .0008058      .3504735    .3536328
--------------------------------------------------------------

. 
. *Cerebrovascular disease (CVD)
. gen cvd = 0

. foreach num of numlist 2/40 {
  2. replace cvd = 1 if inlist(i10_dx`num', "I6000", "I6001", "I6002", "I6010", "I6011") | inlist(i10_dx`num', "I602", "I603
> 0", "I6031", "I6032", "I604") | inlist(i10_dx`num', "I6050", "I6051", "I606", "I607", "I608") | inlist(i10_dx`num', "I609"
> , "I601", "I611", "I612", "I613") | inlist(i10_dx`num', "I614", "I615", "I616", "I617", "I618") | inlist(i10_dx`num', "I61
> 9", "G459") | inlist(i10_dx`num', "I6300", "I63011", "I63012") | inlist(i10_dx`num', "I63013", "I63019", "I6302", "I63031"
> , "I63032") | inlist(i10_dx`num', "I63033", "I63039", "I6309") | inlist(i10_dx`num', "I6310", "I63111", "I63112", "I63113"
> , "I63119") | inlist(i10_dx`num', "I6312", "I63131", "I63132", "I63133", "I63139") | inlist(i10_dx`num', "I6319", "I6320",
>  "I63211", "I63212", "I63213") | inlist(i10_dx`num', "I63219", "I6322", "I63231", "I63232", "I63233") | inlist(i10_dx`num'
> , "I63239", "I6329", "I6330", "I63311", "I63312") | inlist(i10_dx`num', "I63313", "I63319", "I63321", "I63322", "I63323") 
> | inlist(i10_dx`num', "I63329", "I63331", "I63332", "I63333", "I63339") | inlist(i10_dx`num', "I63341", "I63342", "I63343"
> , "I63343", "I63349") | inlist(i10_dx`num', "I6339", "I6349", "I63411", "I63412", "I63413") | inlist(i10_dx`num', "I63419"
> , "I63421", "I63422", "I63423", "I63429") | inlist(i10_dx`num', "I63431", "I63432", "I63433", "I63439", "I63441") | inlist
> (i10_dx`num', "I63442", "I63443", "I63449", "I6349", "I6350") | inlist(i10_dx`num', "I63511", "I63512", "I63513", "I63519"
> , "I63521") | inlist(i10_dx`num', "I63522", "I63523", "I63529", "I63531", "I63532") | inlist(i10_dx`num', "I63533", "I6353
> 9", "I63541", "I63542", "I63543") | inlist(i10_dx`num', "I63549", "I6359", "I636", "I6381", "I6389") | inlist(i10_dx`num',
>  "I639", "I6501", "I6502", "I6503", "I6509") | inlist(i10_dx`num', "I651", "I6521", "I6522") | inlist(i10_dx`num', "I6523"
> , "I6529", "I658", "I659", "I6601") | inlist(i10_dx`num', "I6602", "I6603", "I6609", "I6611", "I6612")| inlist(i10_dx`num'
> , "I6613", "I6619", "I6621", "I6622", "I6623") | inlist(i10_dx`num', "I6629", "I663", "I668", "I669", "I670") | inlist(i10
> _dx`num', "I671", "I672", "I673", "I674", "I675") | inlist(i10_dx`num', "I676", "I677", "I6781", "I6782", "I6783") | inlis
> t(i10_dx`num', "I67841", "I67848", "I67850", "I67858", "I6789") | inlist(i10_dx`num', "I679", "I6900") | inlist(i10_dx`num
> ', "I69010", "I69011", "I69012", "I69013", "I69014") | inlist(i10_dx`num', "I69015", "I69018", "I69019", "I69020", "I69021
> ") | inlist(i10_dx`num', "I69022", "I69023", "I69028") | inlist(i10_dx`num', "I69031", "I69032", "I69033", "I69034", "I690
> 39") | inlist(i10_dx`num', "I69041", "I69042", "I69043", "I69044", "I69049") | inlist(i10_dx`num', "I69051", "I69052", "I6
> 9053", "I69054", "I69059") | inlist(i10_dx`num', "I69061", "I69062", "I69063", "I69064", "I69065") | inlist(i10_dx`num', "
> I69069", "I69090", "I69091", "I69092", "I69093") | inlist(i10_dx`num', "I69098", "I6910", "I69110", "I69111", "I69112") | 
> inlist(i10_dx`num', "I69113", "I69114", "I69115", "I69118", "I69119") | inlist(i10_dx`num', "I69120", "I69121", "I69122", 
> "I69123", "I69128") | inlist(i10_dx`num', "I69131", "I69132", "I69133", "I69134", "I69139") | inlist(i10_dx`num', "I69141"
> , "I69142", "I69143", "I69144", "I69149") | inlist(i10_dx`num', "I69151", "I69152", "I69153") | inlist(i10_dx`num', "I6915
> 4", "I69159", "I69161", "I69162", "I69163") | inlist(i10_dx`num', "I69164", "I69165", "I69169", "I69190", "I69191") | inli
> st(i10_dx`num', "I69192", "I69193", "I69198", "I6920", "I69210") | inlist(i10_dx`num', "I69211", "I69212", "I69213", "I692
> 14", "I69215") | inlist(i10_dx`num', "I69218", "I69219", "I69220", "I69221", "I69222") | inlist(i10_dx`num', "I69223", "I6
> 9228", "I69231", "I69232", "I69233") | inlist(i10_dx`num', "I69234", "I69239", "I69241", "I69242", "I69243") | inlist(i10_
> dx`num', "I69244", "I69249", "I69251", "I69252", "I69253") | inlist(i10_dx`num', "I69254", "I69259", "I69261", "I69262", "
> I69263") | inlist(i10_dx`num', "I69264", "I69265", "I69269", "I69290", "I69291") | inlist(i10_dx`num', "I69292", "I69293",
>  "I69298") | inlist(i10_dx`num', "I6930", "I69310", "I69311", "I69312", "I69313") | inlist(i10_dx`num', "I69314", "I69315"
> , "I69318", "I69319", "I69320") | inlist(i10_dx`num', "I69321", "I69322", "I69323", "I69328", "I69331") | inlist(i10_dx`nu
> m', "I69332", "I69333", "I69334", "I69339", "I69341") | inlist(i10_dx`num', "I69342", "I69343", "I69344", "I69349", "I6935
> 1") | inlist(i10_dx`num', "I69352", "I69353", "I69354", "I69359", "I69361") | inlist(i10_dx`num', "I69362", "I69363", "I69
> 364", "I69365", "I69369") | inlist(i10_dx`num', "I69390", "I69391", "I69392", "I69393", "I69398") | inlist(i10_dx`num', "I
> 6980", "I69810", "I69811", "I69812", "I69813") | inlist(i10_dx`num', "I69814", "I69815", "I69818", "I69819", "I69820") | i
> nlist(i10_dx`num', "I69821", "I69822", "I69823") | inlist(i10_dx`num', "I69828", "I69831", "I69832", "I69833", "I69834") |
>  inlist(i10_dx`num', "I69839", "I69841", "I69842", "I69843", "I69844") | inlist(i10_dx`num', "I69849", "I69851", "I69852",
>  "I69853", "I69854") | inlist(i10_dx`num', "I69859", "I69861", "I69862", "I69863", "I69864") | inlist(i10_dx`num', "I69869
> ", "I69890", "I69891", "I69892", "I69893") | inlist(i10_dx`num', "I69898", "I6990", "I69910", "I69911", "I69912") | inlist
> (i10_dx`num', "I69913", "I69914", "I69915", "I69918", "I69919") | inlist(i10_dx`num', "I69920", "I69921", "I69922", "I6992
> 3", "I69928") | inlist(i10_dx`num', "I69931", "I69932", "I69933", "I69934", "I69939") | inlist(i10_dx`num', "I69941", "I69
> 942", "I69943") | inlist(i10_dx`num', "I69944", "I69949", "I69951", "I69952", "I69953") | inlist(i10_dx`num', "I69954", "I
> 69959", "I69961", "I69962", "I69963") | inlist(i10_dx`num', "I69964", "I69965", "I69969", "I69990", "I69991") | inlist(i10
> _dx`num', "I69992", "I69993", "I69998") |  inlist(i10_dx`num', "H3410", "H3411", "H3412", "H3413", "G450") | inlist(i10_dx
> `num', "G451", "G452", "G453", "G454", "G458")
  3. }
(8,972 real changes made)
(13,258 real changes made)
(13,135 real changes made)
(12,395 real changes made)
(10,973 real changes made)
(9,803 real changes made)
(8,808 real changes made)
(7,694 real changes made)
(7,096 real changes made)
(6,126 real changes made)
(5,383 real changes made)
(4,645 real changes made)
(3,973 real changes made)
(3,513 real changes made)
(3,033 real changes made)
(2,659 real changes made)
(2,373 real changes made)
(1,848 real changes made)
(1,713 real changes made)
(1,528 real changes made)
(1,357 real changes made)
(1,190 real changes made)
(964 real changes made)
(814 real changes made)
(341 real changes made)
(307 real changes made)
(280 real changes made)
(228 real changes made)
(221 real changes made)
(121 real changes made)
(69 real changes made)
(54 real changes made)
(53 real changes made)
(37 real changes made)
(42 real changes made)
(36 real changes made)
(30 real changes made)
(32 real changes made)
(20 real changes made)

. 
. foreach var of varlist allPAD cat{
  2.         svy: tab `var' cvd,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            cvd                            
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7912213.2160997065   587204.9082212425  8499418.1243209485
        1 |  800784.8753908832    88414.9872686996   889199.8626595828
          | 
    Total | 8712998.0914905891   675619.8954899419  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 2219.7692
    Design-based  F(1, 4919)      = 1747.4947     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            cvd                            
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5691173.4263022281   366559.9560947071  6057733.3823969346
        1 |  383754.9501879051    39724.9997016999   423479.9498896049
        2 |  417029.9252029150    48689.9875670001   465719.9127699152
        3 | 2221039.7897985959   220644.9521264987  2441684.7419250943
          | 
    Total | 8712998.0914916433   675619.8954899057  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 6941.5851
    Design-based  F(2.97, 14613.90)= 2030.3609    P = 0.0000

. 
. svy: proportion cvd if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .9005679   .0008352      .8989186    .9021933
          1  |   .0994321   .0008352      .0978067    .1010814
--------------------------------------------------------------

. svy: proportion cvd if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .9309123   .0002871      .9303474    .9314731
          1  |   .0690877   .0002871      .0685269    .0696526
--------------------------------------------------------------

. 
. svy: proportion cvd if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .9096341   .0004951      .9086588    .9106001
          1  |   .0903659   .0004951      .0893999    .0913412
--------------------------------------------------------------

. svy: proportion cvd if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .8954522   .0011072      .8932615    .8976031
          1  |   .1045478   .0011072      .1023969    .1067385
--------------------------------------------------------------

. svy: proportion cvd if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .9061939   .0011158      .9039834    .9083587
          1  |   .0938061   .0011158      .0916413    .0960166
--------------------------------------------------------------

. svy: proportion cvd if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         cvd |
          0  |   .9394889   .0002904      .9389171    .9400558
          1  |   .0605111   .0002904      .0599442    .0610829
--------------------------------------------------------------

. 
. *ESRD
. gen esrd = 0

. replace esrd = 1 if ynel13==1
(648,259 real changes made)

. 
. foreach var of varlist allPAD cat{
  2.         svy: tab `var' esrd,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            esrd                           
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5669678.6410016641  2829739.4833198269  8499418.1243214924
        1 |  477644.9311831147   411554.9314764070   889199.8626595218
          | 
    Total | 6147323.5721847787  3241294.4147962341  9388617.9869734496
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.20e+04
    Design-based  F(1, 4919)      = 9117.0503     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            esrd                           
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 4296278.7857546806  1761454.5966351731  6057733.3823898546
        1 |  252459.9755165001   171019.9743731002   423479.9498896003
        2 |  225184.9556665978   240534.9571033003   465719.9127698981
        3 | 1373399.8552399701  1068284.8866851432  2441684.7419251134
          | 
    Total | 6147323.5721777491  3241294.4147967165  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  4.77e+04
    Design-based  F(2.95, 14531.78)=  1.27e+04    P = 0.0000

. 
. svy: proportion esrd if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .5371626   .0015483      .5341259    .5401966
          1  |   .4628374   .0015483      .4598034    .4658741
--------------------------------------------------------------

. svy: proportion esrd if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .6670667   .0007835      .6655288     .668601
          1  |   .3329333   .0007835       .331399    .3344712
--------------------------------------------------------------

. 
. svy: proportion esrd if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .5624804   .0011509      .5602229    .5647353
          1  |   .4375196   .0011509      .4352647    .4397771
--------------------------------------------------------------

. svy: proportion esrd if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .4835201   .0019498      .4796986    .4873436
          1  |   .5164799   .0019498      .5126564    .5203014
--------------------------------------------------------------

. svy: proportion esrd if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .5961557   .0020033      .5922221    .6000769
          1  |   .4038443   .0020033      .3999231    .4077779
--------------------------------------------------------------

. svy: proportion esrd if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        esrd |
          0  |   .7092222   .0007353      .7077785    .7106616
          1  |   .2907778   .0007353      .2893384    .2922215
--------------------------------------------------------------

. 
. *HTN
. gen htn = 0

. replace htn = 1 if ynel6==1 | ynel31==1
(1,331,335 real changes made)

. 
. foreach var of varlist allPAD cat{
  2.         svy: tab `var' htn,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            htn                            
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2568594.3486769460  5930823.7756433375  8499418.1243202835
        1 |  163349.9596666974   725849.9029928655   889199.8626595628
          | 
    Total | 2731944.3083436438  6656673.6786362026  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.10e+04
    Design-based  F(1, 4919)      = 9063.9638     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                            htn                            
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 2139939.4252098976  3917793.9571795948  6057733.3823894924
        1 |  100709.9721157994   322769.9777738046   423479.9498896040
        2 |   62639.9875509002   403079.9252190129   465719.9127699131
        3 |  428654.9234675093  2013029.8184576514  2441684.7419251604
          | 
    Total | 2731944.3083441067  6656673.6786300633  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  6.65e+04
    Design-based  F(2.88, 14147.76)=  1.76e+04    P = 0.0000

. 
. svy: proportion htn if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |   .1837044   .0011699      .1814221     .186009
          1  |   .8162956   .0011699       .813991    .8185779
--------------------------------------------------------------

. svy: proportion htn if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |   .3022083   .0009594      .3003307    .3040924
          1  |   .6977917   .0009594      .6959076    .6996693
--------------------------------------------------------------

. 
. svy: proportion htn if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |    .175557   .0009347      .1737321    .1773971
          1  |    .824443   .0009347      .8226029    .8262679
--------------------------------------------------------------

. svy: proportion htn if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |   .1345014   .0012882      .1319959    .1370469
          1  |   .8654986   .0012882      .8629531    .8680041
--------------------------------------------------------------

. svy: proportion htn if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |   .2378152   .0016551      .2345856    .2410752
          1  |   .7621848   .0016551      .7589248    .7654144
--------------------------------------------------------------

. svy: proportion htn if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         htn |
          0  |   .3532574   .0009915      .3513161    .3552036
          1  |   .6467426   .0009915      .6447964    .6486839
--------------------------------------------------------------

. 
. *Anticoagulants and antiplatelets
. gen chronic_ac=0

. foreach num of numlist 1/40{
  2.         replace chronic_ac=1 if inlist(i10_dx`num', "Z7901")
  3. }
(0 real changes made)
(638 real changes made)
(837 real changes made)
(1,191 real changes made)
(1,677 real changes made)
(2,437 real changes made)
(3,417 real changes made)
(4,440 real changes made)
(5,961 real changes made)
(7,207 real changes made)
(8,483 real changes made)
(9,715 real changes made)
(10,983 real changes made)
(11,892 real changes made)
(12,486 real changes made)
(12,415 real changes made)
(12,754 real changes made)
(12,615 real changes made)
(10,753 real changes made)
(10,395 real changes made)
(9,998 real changes made)
(9,465 real changes made)
(8,804 real changes made)
(8,033 real changes made)
(6,425 real changes made)
(2,647 real changes made)
(2,366 real changes made)
(2,180 real changes made)
(1,889 real changes made)
(1,683 real changes made)
(877 real changes made)
(511 real changes made)
(384 real changes made)
(394 real changes made)
(320 real changes made)
(252 real changes made)
(230 real changes made)
(201 real changes made)
(184 real changes made)
(138 real changes made)

. 
. gen chronic_ap=0

. foreach num of numlist 1/40{
  2.         replace chronic_ap=1 if inlist(i10_dx`num', "Z7902")
  3. }
(0 real changes made)
(124 real changes made)
(215 real changes made)
(285 real changes made)
(329 real changes made)
(452 real changes made)
(563 real changes made)
(786 real changes made)
(1,061 real changes made)
(1,386 real changes made)
(1,815 real changes made)
(2,199 real changes made)
(2,663 real changes made)
(3,081 real changes made)
(3,359 real changes made)
(3,478 real changes made)
(3,668 real changes made)
(3,929 real changes made)
(3,335 real changes made)
(3,444 real changes made)
(3,384 real changes made)
(3,192 real changes made)
(2,929 real changes made)
(2,728 real changes made)
(2,204 real changes made)
(990 real changes made)
(889 real changes made)
(819 real changes made)
(726 real changes made)
(637 real changes made)
(396 real changes made)
(216 real changes made)
(196 real changes made)
(162 real changes made)
(134 real changes made)
(95 real changes made)
(87 real changes made)
(100 real changes made)
(81 real changes made)
(75 real changes made)

. *Create one binary variable
. gen chronic_at=0

. replace chronic_at=1 if chronic_ac==1 | chronic_ap==1
(247,278 real changes made)

. 
. foreach var of varlist allPAD cat {
  2.         svy: tab `var' chronic_ac,  count format(%20.10f)
  3.         svy: tab `var' chronic_ap,  count format(%20.10f)
  4. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                         chronic_ac                        
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7658863.3519359641   840554.7723836154  8499418.1243195795
        1 |  743369.8996196708   145829.9630398963   889199.8626595672
          | 
    Total | 8402233.2515556347   986384.7354235117  9388617.9869734570
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 7258.0203
    Design-based  F(1, 4919)      = 5241.1837     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                         chronic_ap                        
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8274498.1265252717   224919.9977964987  8499418.1243217718
        1 |  833059.8577028828    56140.0049566999   889199.8626595829
          | 
    Total | 9107557.9842281546   281060.0027531987  9388617.9869734664
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 7455.8769
    Design-based  F(1, 4919)      = 5704.0253     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                         chronic_ac                        
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5536673.5688315034   521059.8135644190  6057733.3823959222
        1 |  362239.9575365066    61239.9923531000   423479.9498896066
        2 |  381129.9420831045    84589.9706867996   465719.9127699041
        3 | 2122189.7831060262   319494.9588192063  2441684.7419252330
          | 
    Total | 8402233.2515571415   986384.7354235250  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  1.53e+04
    Design-based  F(2.95, 14499.95)= 4202.7678    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                         chronic_ap                        
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5978783.4136727313    78949.9687239002  6057733.3823966309
        1 |  407359.9535280070    16119.9963616000   423479.9498896070
        2 |  425699.9041748156    40020.0085951000   465719.9127699157
        3 | 2295714.7128523001   145970.0290725987  2441684.7419248987
          | 
    Total | 9107557.9842278548   281060.0027531990  9388617.9869734515
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  3.71e+04
    Design-based  F(2.95, 14528.11)=  1.06e+04    P = 0.0000

. svy: proportion chronic_ac if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .8359987   .0013301      .8333744    .8385896
          1  |   .1640013   .0013301      .1614104    .1666256
--------------------------------------------------------------

. svy: proportion chronic_ac if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .9011044   .0005585      .9000041     .902194
          1  |   .0988956   .0005585       .097806    .0999959
--------------------------------------------------------------

. 
. svy: proportion chronic_ac if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .8691498   .0008554      .8674637    .8708176
          1  |   .1308502   .0008554      .1291824    .1325363
--------------------------------------------------------------

. svy: proportion chronic_ac if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .8183673   .0016914      .8150278    .8216596
          1  |   .1816327   .0016914      .1783404    .1849722
--------------------------------------------------------------

. svy: proportion chronic_ac if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .8553887   .0014721      .8524786    .8582509
          1  |   .1446113   .0014721      .1417491    .1475214
--------------------------------------------------------------

. svy: proportion chronic_ac if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ac |
          0  |   .9139844   .0004992      .9130006     .914958
          1  |   .0860156   .0004992       .085042    .0869994
--------------------------------------------------------------

. 
. svy: proportion chronic_ap if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |   .9368646    .000861      .9351554    .9385317
          1  |   .0631354    .000861      .0614683    .0648446
--------------------------------------------------------------

. svy: proportion chronic_ap if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |    .973537   .0002698      .9730028    .9740609
          1  |    .026463   .0002698      .0259391    .0269972
--------------------------------------------------------------

. 
. svy: proportion chronic_ap if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |   .9402175    .000641      .9389484    .9414618
          1  |   .0597825    .000641      .0585382    .0610516
--------------------------------------------------------------

. svy: proportion chronic_ap if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |   .9140685   .0012404      .9116053    .9164694
          1  |   .0859315   .0012404      .0835306    .0883947
--------------------------------------------------------------

. svy: proportion chronic_ap if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |   .9619345   .0007525      .9604315    .9633825
          1  |   .0380655   .0007525      .0366175    .0395685
--------------------------------------------------------------

. svy: proportion chronic_ap if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  chronic_ap |
          0  |   .9869671   .0001552      .9866592    .9872679
          1  |   .0130329   .0001552      .0127321    .0133408
--------------------------------------------------------------

. 
. *Defining outcomes (Manuscript/Table 2)
. *Mortality here, but amp in Logistic Regression .do file
. svy: prop died if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8913985   .0004869      .8904402    .8923493
          1  |   .1086015   .0004869      .1076507    .1095598
--------------------------------------------------------------

. svy: prop died if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8612854   .0009352      .8594418    .8631087
          1  |   .1387146   .0009352      .1368913    .1405582
--------------------------------------------------------------

. svy: tab allPAD died
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

-------------------------------
          |     Died during    
          |   hospitalization  
   allPAD |     0      1  Total
----------+--------------------
        0 |  .807  .0983  .9053
        1 | .0816  .0131  .0947
          | 
    Total | .8885  .1115      1
-------------------------------
Key: Cell proportion

  Pearson:
    Uncorrected   chi2(1)         = 1474.1866
    Design-based  F(1, 4919)      = 1280.1175     P = 0.0000

. 
. svy: prop died if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8685129   .0007274      .8670804    .8699324
          1  |   .1314871   .0007274      .1300676    .1329196
--------------------------------------------------------------

. svy: prop died if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |    .860925   .0012087      .8585384    .8632778
          1  |    .139075   .0012087      .1367222    .1414616
--------------------------------------------------------------

. svy: prop died if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8616818   .0012899      .8591336    .8641912
          1  |   .1383182   .0012899      .1358088    .1408664
--------------------------------------------------------------

. svy: prop died if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .9006229   .0004793      .8996793    .9015586
          1  |   .0993771   .0004793      .0984414    .1003207
--------------------------------------------------------------

. svy: tab cat died
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

-------------------------------
          |     Died during    
          |   hospitalization  
      cat |     0      1  Total
----------+--------------------
        0 | .5811  .0641  .6452
        1 | .0389  .0062  .0451
        2 | .0427  .0069  .0496
        3 | .2259  .0342  .2601
          | 
    Total | .8885  .1115      1
-------------------------------
Key: Cell proportion

  Pearson:
    Uncorrected   chi2(3)         = 5098.0958
    Design-based  F(2.96, 14580.27)= 1514.9488    P = 0.0000

. 
. *New Hospice Var for Sensitivity Analyses
. gen hospice = 0 

. foreach num of numlist 1/40 {
  2.    replace hospice = 1 if i10_dx`num' == "Z515"
  3. }
(0 real changes made)
(3,674 real changes made)
(8,215 real changes made)
(10,269 real changes made)
(5,736 real changes made)
(6,711 real changes made)
(8,214 real changes made)
(11,116 real changes made)
(14,996 real changes made)
(12,184 real changes made)
(9,764 real changes made)
(10,077 real changes made)
(10,133 real changes made)
(10,432 real changes made)
(9,955 real changes made)
(9,007 real changes made)
(8,563 real changes made)
(8,238 real changes made)
(6,589 real changes made)
(6,329 real changes made)
(5,839 real changes made)
(5,340 real changes made)
(4,977 real changes made)
(4,470 real changes made)
(3,292 real changes made)
(1,225 real changes made)
(1,074 real changes made)
(1,008 real changes made)
(870 real changes made)
(701 real changes made)
(346 real changes made)
(199 real changes made)
(198 real changes made)
(132 real changes made)
(123 real changes made)
(96 real changes made)
(71 real changes made)
(84 real changes made)
(78 real changes made)
(47 real changes made)

. replace hospice = 1 if died == 1
(116,092 real changes made)

. 
. svy: prop hospice
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
     hospice |
          0  |    .831464   .0005841      .8303159     .832606
          1  |    .168536   .0005841       .167394    .1696841
--------------------------------------------------------------

. 
. svy: tab allPAD hospice,  count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                          hospice                          
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 7096453.3156095482  1402964.8087088759  8499418.1243184246
        1 |  709844.8775999593   179354.9850595966   889199.8626595559
          | 
    Total | 7806298.1932095075  1582319.7937684725  9388617.9869734533
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 1542.1973
    Design-based  F(1, 4919)      = 1318.8302     P = 0.0000

. 
. svy: proportion hospice if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
     hospice |
          0  |   .7982962   .0011224      .7960867    .8004877
          1  |   .2017038   .0011224      .1995123    .2039133
--------------------------------------------------------------

. svy: proportion hospice if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
     hospice |
          0  |    .834934   .0005928      .8337685    .8360929
          1  |    .165066   .0005928      .1639071    .1662315
--------------------------------------------------------------

. 
. *Hosp LOS (mean + SD)
. *extended LOS is days above median LOS
. gen extLOS = 0 

. summarize los, detail

                  Length of stay (cleaned)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs           1,877,670
25%            3              0       Sum of wgt.   1,877,670

50%            5                      Mean            7.78544
                        Largest       Std. dev.      9.001047
75%            9            356
90%           16            359       Variance       81.01884
95%           22            363       Skewness       7.009683
99%           42            365       Kurtosis       124.4429

. replace extLOS = 1 if los >r(p50)
(908,306 real changes made)

. 
. foreach var of varlist allPAD cat{
  2.         svy: tab `var' extLOS,  count format(%20.10f)
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           extLOS                          
   allPAD |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 4411773.4997307938  4087644.6245853803  8499418.1243161745
        1 |  435314.9066807058   453884.9559788207   889199.8626595266
          | 
    Total | 4847088.4064114997  4541529.5805642018  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  561.3932
    Design-based  F(1, 4919)      =  245.3375     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
          |                           extLOS                          
      cat |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 3208078.7189604226  2849654.6634274102  6057733.3823878318
        1 |  207144.9622492014   216334.9876403967   423479.9498895981
        2 |  228169.9444314997   237549.9683383991   465719.9127698988
        3 | 1203694.7807684662  1237989.9611566095  2441684.7419250757
          | 
    Total | 4847088.4064095896  4541529.5805628151  9388617.9869734682
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 2429.1097
    Design-based  F(2.67, 13124.96)=  497.6642    P = 0.0000

. 
. svy: proportion extLOS if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |    .489558   .0021293      .4853844     .493733
          1  |    .510442   .0021293       .506267    .5146156
--------------------------------------------------------------

. svy: proportion extLOS if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |   .5190677   .0010755      .5169588    .5211759
          1  |   .4809323   .0010755      .4788241    .4830412
--------------------------------------------------------------

. 
. svy: proportion extLOS if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |   .4929771    .001257      .4905131    .4954416
          1  |   .5070229    .001257      .5045584    .5094869
--------------------------------------------------------------

. svy: proportion extLOS if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |   .4899295   .0022058      .4856059    .4942547
          1  |   .5100705   .0022058      .5057453    .5143941
--------------------------------------------------------------

. svy: proportion extLOS if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |   .4891494   .0027752      .4837102    .4945912
          1  |   .5108506   .0027752      .5054088    .5162898
--------------------------------------------------------------

. svy: proportion extLOS if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |
          0  |    .529584   .0011257      .5273766    .5317903
          1  |    .470416   .0011257      .4682097    .4726234
--------------------------------------------------------------

. 
. *Making Location of Hospital Discharges--Decide what data we want to present later!
. *Combine HHC + Routine
. replace dispuniform = 1 if dispuniform==6
(369,070 real changes made)

. *Missing
. replace dispuniform = 3 if dispuniform==.
(0 real changes made)

. *Died
. replace dispuniform = 4 if dispuniform==20
(209,279 real changes made)

. **Combine AMA with discharged alive, destination unknown(may have expired elsewhere)
. replace dispuniform = 6 if dispuniform==99
(467 real changes made)

. replace dispuniform = 6 if dispuniform==7
(24,126 real changes made)

. *Combine transfer other with transfer to short-term hospital
. replace dispuniform = 6 if dispuniform==2
(60,879 real changes made)

. label define dispuniform 1 "Routine" 3 "Missing" 4 "Died in hospital" 5 "Transfer other (SNF)" 6 "AMA, Discharged alive wi
> th unknown destination, Transfer to short-term hospital"

. 
. gen dispuniform1 = 0

. replace dispuniform1 = 1 if dispuniform ==1
(987,121 real changes made)

. 
. gen dispuniform5 = 0

. replace dispuniform5 = 1 if dispuniform ==5
(595,852 real changes made)

. 
. gen dispuniform6 = 0

. replace dispuniform6 = 1 if dispuniform ==6
(85,472 real changes made)

. 
. foreach var of varlist dispuniform1 dispuniform5 dispuniform6 {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm1       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 3990873.9925256963   462139.9220218196  4453013.9145475160
        1 | 4508544.1317907507   427059.9406377052  4935604.0724284556
          | 
    Total | 8499418.1243164483   889199.8626595248  9388617.9869734757
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 1625.8015
    Design-based  F(1, 4919)      =  757.7802     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm5       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 5823098.6537360456   586259.9119845389  6409358.5657205842
        1 | 2676319.4705860857   302939.9506750111  2979259.4212610968
          | 
    Total | 8499418.1243221313   889199.8626595500  9388617.9869734645
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  494.9085
    Design-based  F(1, 4919)      =  281.6192     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm6       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 8107913.4203959415   853344.8778805779  8961258.2982765194
        1 |  391504.7039250955    35854.9847789999   427359.6887040954
          | 
    Total | 8499418.1243210360   889199.8626595779  9388617.9869734608
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  122.0810
    Design-based  F(1, 4919)      =   99.7617     P = 0.0000

. svy: tab dispuniform allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

----------------------------------------------------------------------
Dispositi |
on of     |
patient   |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
        1 | 4508544.1317907488   427059.9406377052  4935604.0724284537
        4 |  923049.8180135584   123344.9865677997  1046394.8045813581
        5 | 2676319.4705860838   302939.9506750110  2979259.4212610945
        6 |  391504.7039250955    35854.9847789999   427359.6887040954
          | 
    Total | 8499418.1243154854   889199.8626595159  9388617.9869734626
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 2535.3845
    Design-based  F(2.68, 13163.21)=  570.1357    P = 0.0000

. svy: proportion dispuniform if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =    177,840
Number of PSUs   = 4,749          Population size = 889,199.86
                                  Design df       =      4,748

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .4802744   .0019934      .4763677    .4841836
          4  |   .1387146   .0009352      .1368913    .1405582
          5  |   .3406883   .0017853      .3371969     .344197
          6  |   .0403228   .0005874      .0391868    .0414902
--------------------------------------------------------------

. svy: proportion dispuniform if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,699,884
Number of PSUs   = 4,919           Population size = 8,499,418
                                   Design df       =     4,918

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .5304533   .0009455      .5285992    .5323065
          4  |   .1086015   .0004869      .1076507    .1095598
          5  |   .3148827   .0009303      .3130618    .3167092
          6  |   .0460625   .0003555      .0453705    .0467646
--------------------------------------------------------------

. 
. *How many people had routine discharge overall
. svy: tab dispuniform1,  count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

------------------------------
dispunifo |
rm1       |              count
----------+-------------------
        0 | 4453013.9145496925
        1 | 4935604.0724312142
          | 
    Total | 9388617.9869809058
------------------------------
Key:    count = Weighted count

. svy: prop dispuniform1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,877,724
Number of PSUs   = 4,920           Population size = 9,388,618
                                   Design df       =     4,919

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
dispuniform1 |
          0  |   .4742992   .0009442      .4724484    .4761507
          1  |   .5257008   .0009442      .5238493    .5275516
--------------------------------------------------------------

. 
. foreach var of varlist dispuniform1 dispuniform5 dispuniform6 {
  2.         svy: tab `var' cat,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
dispunifo |                                                cat                                                
rm1       |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 2709694.1060798792   221284.9853316991   240854.9366901015  1281179.8864446254  4453013.9145463053
        1 | 3348039.2763084960   202194.9645578991   224864.9760797983  1160504.8554805040  4935604.0724266982
          | 
    Total | 6057733.3823883757   423479.9498895982   465719.9127698999  2441684.7419251292  9388617.9869734608
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 9993.3217
    Design-based  F(2.67, 13137.92)= 2094.0335    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
dispunifo |                                                cat                                                
rm5       |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 4239813.8938326752   277404.9589833986   308854.9530011081  1583284.7598956211  6409358.5657128030
        1 | 1817919.4885568777   146074.9909061980   156864.9597687965   858399.9820295268  2979259.4212613991
          | 
    Total | 6057733.3823895529   423479.9498895966   465719.9127699046  2441684.7419251478  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         = 4763.2785
    Design-based  F(2.84, 13983.36)= 1126.2639    P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
dispunifo |                                                cat                                                
rm6       |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        0 | 5767958.6368646584   406844.9506004074   446499.9272801190  2339954.7835324602  8961258.2982776463
        1 |  289774.7455325992    16634.9992892000    19219.9854897999   101729.9583924999   427359.6887040990
          | 
    Total | 6057733.3823972587   423479.9498896075   465719.9127699190  2441684.7419249597  9388617.9869734589
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(3)         =  431.2463
    Design-based  F(2.99, 14689.16)=  123.7732    P = 0.0000

. svy: tab dispuniform cat,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   = 1,877,724
Number of PSUs   = 4,920                           Population size = 9,388,618
                                                   Design df       =     4,919

--------------------------------------------------------------------------------------------------------------
Dispositi |
on of     |
patient   |                                                cat                                                
(uniform) |                  0                   1                   2                   3               Total
----------+---------------------------------------------------------------------------------------------------
        1 | 3348039.2763084979   202194.9645578991   224864.9760797983  1160504.8554805047  4935604.0724267000
        4 |  601999.8719909617    58574.9951363000    64769.9914314999   321049.9460226113  1046394.8045813729
        5 | 1817919.4885568765   146074.9909061980   156864.9597687965   858399.9820295267  2979259.4212613981
        6 |  289774.7455325991    16634.9992892000    19219.9854897999   101729.9583924999   427359.6887040990
          | 
    Total | 6057733.3823889354   423479.9498895971   465719.9127698947  2441684.7419251427  9388617.9869734645
--------------------------------------------------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(9)         =  1.29e+04
    Design-based  F(8.09, 39818.97)= 1124.1939    P = 0.0000

. svy: proportion dispuniform if cat==3
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   488,337
Number of PSUs   = 4,860           Population size = 2,441,685
                                   Design df       =     4,859

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .4752886   .0011305      .4730728    .4775054
          4  |   .1314871   .0007274      .1300676    .1329196
          5  |   .3515605   .0011249      .3493584     .353769
          6  |   .0416638   .0004513      .0407879    .0425577
--------------------------------------------------------------

. svy: proportion dispuniform if cat==2
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     93,144
Number of PSUs   = 4,636          Population size = 465,719.91
                                  Design df       =      4,635

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .4828331   .0020596      .4787965    .4868719
          4  |    .139075   .0012087      .1367222    .1414616
          5  |   .3368225   .0019516      .3330072    .3406592
          6  |   .0412694   .0007544      .0398156    .0427739
--------------------------------------------------------------

. svy: proportion dispuniform if cat==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =     84,696
Number of PSUs   = 4,650          Population size = 423,479.95
                                  Design df       =      4,649

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .4774605   .0027477      .4720766    .4828497
          4  |   .1383182   .0012899      .1358088    .1408664
          5  |   .3449396   .0023815      .3402857    .3496234
          6  |   .0392817   .0007618      .0378151    .0408027
--------------------------------------------------------------

. svy: proportion dispuniform if cat==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   = 1,211,547
Number of PSUs   = 4,913           Population size = 6,057,733
                                   Design df       =     4,912

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 dispuniform |
          1  |   .5526885   .0009782      .5507699    .5546054
          4  |   .0993771   .0004793      .0984414    .1003207
          5  |    .300099   .0009503      .2982393    .3019653
          6  |   .0478355   .0003679      .0471194    .0485619
--------------------------------------------------------------

. 
. dtable age i.male i.race elix i.zipinc_qrtl i.pay1 i.cad i.cm_dm i.cvd i.esrd i.htn i.chronic_ac i.chronic_ap i.chronic_at
>  i.died i.hospice extLOS i.dispuniform, svy by(allPAD, tests)
note: using test regress across levels of allPAD for age, elix, and extLOS.
note: using test pearson across levels of allPAD for male, race, zipinc_qrtl, pay1, cad, cm_dm, cvd, esrd, htn,
      chronic_ac, chronic_ap, chronic_at, died, hospice, and dispuniform.

--------------------------------------------------------------------------------------------------------------------------
                                                                                          allPAD                          
                                                                       0                1               Total        Test 
--------------------------------------------------------------------------------------------------------------------------
N                                                              8,499,418 (90.5%)  889,200 (9.5%) 9,388,618 (100.0%)       
Age in years at admission                                        68.201 (15.796) 73.415 (12.176)    68.695 (15.564) <0.001
male                                                                                                                      
  0                                                            4,263,644 (50.2%) 370,735 (41.7%)  4,634,379 (49.4%) <0.001
  1                                                            4,235,774 (49.8%) 518,465 (58.3%)  4,754,239 (50.6%)       
Race (uniform)                                                                                                            
  White                                                        5,922,684 (69.7%) 644,785 (72.5%)  6,567,469 (70.0%) <0.001
  Black                                                        1,221,065 (14.4%) 124,200 (14.0%)  1,345,265 (14.3%)       
  Hispanic                                                        833,510 (9.8%)   71,640 (8.1%)     905,150 (9.6%)       
  Asian or Pacific Islander                                       233,015 (2.7%)   25,740 (2.9%)     258,755 (2.8%)       
  Native American                                                  65,535 (0.8%)    4,575 (0.5%)      70,110 (0.7%)       
  Other                                                           223,610 (2.6%)   18,260 (2.1%)     241,870 (2.6%)       
elix                                                               4.933 (2.113)   5.552 (2.016)      4.991 (2.112) <0.001
Median household income national quartile for patient ZIP Code                                                            
  1                                                            2,657,250 (31.3%) 259,325 (29.2%)  2,916,575 (31.1%) <0.001
  2                                                            2,209,025 (26.0%) 227,450 (25.6%)  2,436,475 (26.0%)       
  3                                                            1,936,974 (22.8%) 207,045 (23.3%)  2,144,019 (22.8%)       
  4                                                            1,543,715 (18.2%) 181,690 (20.4%)  1,725,405 (18.4%)       
  5                                                               152,455 (1.8%)   13,690 (1.5%)     166,145 (1.8%)       
Primary expected payer (uniform)                                                                                          
  Medicare                                                     5,744,494 (67.6%) 716,105 (80.5%)  6,460,598 (68.8%) <0.001
  Medicaid                                                     1,049,170 (12.3%)   59,070 (6.6%)  1,108,240 (11.8%)       
  Private                                                      1,262,290 (14.9%)   88,125 (9.9%)  1,350,415 (14.4%)       
  self-pay                                                        236,095 (2.8%)    9,260 (1.0%)     245,355 (2.6%)       
  no charge                                                        19,330 (0.2%)      615 (0.1%)      19,945 (0.2%)       
  other                                                           179,355 (2.1%)   15,515 (1.7%)     194,870 (2.1%)       
  missing                                                           8,685 (0.1%)      510 (0.1%)       9,195 (0.1%)       
cad                                                                                                                       
  0                                                            6,057,733 (71.3%) 423,480 (47.6%)  6,481,213 (69.0%) <0.001
  1                                                            2,441,685 (28.7%) 465,720 (52.4%)  2,907,405 (31.0%)       
cm_dm                                                                                                                     
  0                                                            5,190,909 (61.1%) 546,230 (61.4%)  5,737,139 (61.1%)  0.025
  1                                                            3,308,509 (38.9%) 342,970 (38.6%)  3,651,479 (38.9%)       
cvd                                                                                                                       
  0                                                            7,912,213 (93.1%) 800,785 (90.1%)  8,712,998 (92.8%) <0.001
  1                                                               587,205 (6.9%)   88,415 (9.9%)     675,620 (7.2%)       
esrd                                                                                                                      
  0                                                            5,669,679 (66.7%) 477,645 (53.7%)  6,147,324 (65.5%) <0.001
  1                                                            2,829,739 (33.3%) 411,555 (46.3%)  3,241,294 (34.5%)       
htn                                                                                                                       
  0                                                            2,568,594 (30.2%) 163,350 (18.4%)  2,731,944 (29.1%) <0.001
  1                                                            5,930,824 (69.8%) 725,850 (81.6%)  6,656,674 (70.9%)       
chronic_ac                                                                                                                
  0                                                            7,658,863 (90.1%) 743,370 (83.6%)  8,402,233 (89.5%) <0.001
  1                                                               840,555 (9.9%) 145,830 (16.4%)    986,385 (10.5%)       
chronic_ap                                                                                                                
  0                                                            8,274,498 (97.4%) 833,060 (93.7%)  9,107,558 (97.0%) <0.001
  1                                                               224,920 (2.6%)   56,140 (6.3%)     281,060 (3.0%)       
chronic_at                                                                                                                
  0                                                            7,456,813 (87.7%) 695,415 (78.2%)  8,152,228 (86.8%) <0.001
  1                                                            1,042,605 (12.3%) 193,785 (21.8%)  1,236,390 (13.2%)       
Died during hospitalization                                                                                               
  0                                                            7,576,368 (89.1%) 765,855 (86.1%)  8,342,223 (88.9%) <0.001
  1                                                              923,050 (10.9%) 123,345 (13.9%)  1,046,395 (11.1%)       
hospice                                                                                                                   
  0                                                            7,096,453 (83.5%) 709,845 (79.8%)  7,806,298 (83.1%) <0.001
  1                                                            1,402,965 (16.5%) 179,355 (20.2%)  1,582,320 (16.9%)       
extLOS                                                             0.481 (0.500)   0.510 (0.500)      0.484 (0.500) <0.001
Disposition of patient (uniform)                                                                                          
  1                                                            4,508,544 (53.0%) 427,060 (48.0%)  4,935,604 (52.6%) <0.001
  4                                                              923,050 (10.9%) 123,345 (13.9%)  1,046,395 (11.1%)       
  5                                                            2,676,319 (31.5%) 302,940 (34.1%)  2,979,259 (31.7%)       
  6                                                               391,505 (4.6%)   35,855 (4.0%)     427,360 (4.6%)       
--------------------------------------------------------------------------------------------------------------------------

. 
. save "/Users/stuthiiyer/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /All Sepsis.dta", replace
file /Users/stuthiiyer/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /All Sepsis.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/stuthiiyer/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Table 1.log
  log type:  text
 closed on:   3 Dec 2024, 00:42:19
----------------------------------------------------------------------------------------------------------------------------
