----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Table 1.log
  log type:  text
 opened on:  16 Apr 2023, 11:31:25

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort .dta", clear
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort .dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort .dta", clear
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort .dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta", clear
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta", clear
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta not found
r(601);

end of do-file

r(601);

. use "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Full Cohort.dta"

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. drop if full_cohort == 0
(6,714,443 observations deleted)

. 
. gen allPAD = 0

. foreach num of numlist 2/40 {
  2.         replace allPAD = 1 if inlist(i10_dx`num', "I70211",  "I70212",  "I70213",  "I70221",  "I70222
> ") | inlist(i10_dx`num', "I70223",  "I70231",  "I70232",  "I70233", "I70234") | inlist(i10_dx`num', "I70
> 235",  "I70241",  "I70245",  "I70242",  "I70243") | inlist(i10_dx`num', "I70244",  "I70261",  "I70262", 
>  "I70263",  "I70291") | inlist(i10_dx`num', "I70292",  "I70293",  "I70301",  "I70302",  "I70303") | inli
> st(i10_dx`num', "I70311",  "I70312",  "I70313",  "I70321",  "I70322") | inlist(i10_dx`num', "I70323",  "
> I70331",  "I70332",  "I70333 ",  "I70334") | inlist(i10_dx`num', "I70335",  "I70341",  "I70342",  "I7034
> 3",  "I70344") | inlist(i10_dx`num', "I70345",  "I70361",  "I70362",  "I70363",  "I70391") | inlist(i10_
> dx`num', "I70392",  "I70393",  "I70401",  "I70402",  "I70403") | inlist(i10_dx`num', "I70411",  "I70412"
> ,  "I70413",  "I70421",  "I70423") | inlist(i10_dx`num', "I70431",  "I70432",  "I70433",  "I70434",  "I7
> 0441") | inlist(i10_dx`num', "I70442",  "I70443",  "I70444",  "I70445",  "I70461") | inlist(i10_dx`num',
>  "I70462",  "I70463",  "I70491",  "I70492",  "I70493") | inlist(i10_dx`num', "I70501",  "I70502",  "I705
> 03",  "I70511",  "I70512") | inlist(i10_dx`num', "I70513",  "I70521",  "I70522",  "I70523",  "I70531") |
>  inlist(i10_dx`num', "I70532",  "I70533",  "I70534",  "I70541",  "I70542") | inlist(i10_dx`num', "I70543
> ",  "I70544",  "I70561",  "I70562",  "I70563") | inlist(i10_dx`num', "I70591",  "I70592",  "I70593",  "I
> 70601",  "I70602") | inlist(i10_dx`num', "I70603",  "I70611",  "I70612",  "I70613",  "I70621") | inlist(
> i10_dx`num', "I70622",  "I70623",  "I70631",  "I70632",  "I70633") | inlist(i10_dx`num', "I70634",  "I70
> 641",  "I70642",  "I70643",  "I70644") | inlist(i10_dx`num', "I70661",  "I70662",  "I70663",  "I70691", 
>  "I70692") | inlist(i10_dx`num', "I70693",  "I70701",  "I70702",  "I70703",  "I70711") | inlist(i10_dx`n
> um', "I70712",  "I70713",  "I70721",  "I70722",  "I70723") | inlist(i10_dx`num', "I70731",  "I70732",  "
> I70733",  "I70734",  "I70735") | inlist(i10_dx`num', "I70741",  "I70742",  "I70743",  "I70744",  "I70745
> ") | inlist(i10_dx`num', "I70761",  "I70762",  "I70763",  "I70791",  "I70792") | inlist(i10_dx`num', "Z9
> 5820")
  3. } 
(27 real changes made)
(49 real changes made)
(63 real changes made)
(94 real changes made)
(89 real changes made)
(92 real changes made)
(84 real changes made)
(87 real changes made)
(64 real changes made)
(88 real changes made)
(72 real changes made)
(74 real changes made)
(84 real changes made)
(70 real changes made)
(69 real changes made)
(77 real changes made)
(82 real changes made)
(69 real changes made)
(75 real changes made)
(62 real changes made)
(60 real changes made)
(55 real changes made)
(51 real changes made)
(58 real changes made)
(23 real changes made)
(14 real changes made)
(22 real changes made)
(15 real changes made)
(15 real changes made)
(8 real changes made)
(5 real changes made)
(4 real changes made)
(8 real changes made)
(4 real changes made)
(2 real changes made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)

. svy: tab allPAD, count format(%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

------------------------------
   allPAD |              count
----------+-------------------
        0 | 1946170.0666088334
        1 |    9105.0094872000
          | 
    Total | 1955275.0760960332
------------------------------
Key:    count = Weighted count

. svy: proportion allPAD
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   391,055
Number of PSUs   = 3,988           Population size = 1,955,275
                                   Design df       =     3,987

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      allPAD |
          0  |   .9953434   .0001293      .9950829    .9955901
          1  |   .0046566   .0001293      .0044099    .0049171
--------------------------------------------------------------

. 
. svy: tab onlysepticshock allPAD, count format (%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
onlysepti |                           allPAD                          
cshock    |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945865.0671840364     9100.0095014000  1954965.0766854363
        1 |     304.9994248000        4.9999858000      309.9994106000
          | 
    Total | 1946170.0666088364     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    1.7608
    Design-based  F(1, 3987)      =    1.7598     P = 0.1847

. svy: prop onlysepticshock if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1             Number of obs   =      1,821
Number of PSUs   = 1,041             Population size = 9,105.0095
                                     Design df       =      1,040

-----------------------------------------------------------------
                |             Linearized            Logit
                | Proportion   std. err.     [95% conf. interval]
----------------+------------------------------------------------
onlysepticshock |
             0  |   .9994509   .0005483      .9961135    .9999226
             1  |   .0005491   .0005483      .0000774    .0038865
-----------------------------------------------------------------

. svy: prop onlysepticshock if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1              Number of obs   =   389,234
Number of PSUs   = 3,987              Population size = 1,946,170
                                      Design df       =     3,986

-----------------------------------------------------------------
                |             Linearized            Logit
                | Proportion   std. err.     [95% conf. interval]
----------------+------------------------------------------------
onlysepticshock |
             0  |   .9998433   .0000217      .9997944    .9998806
             1  |   .0001567   .0000217      .0001194    .0002056
-----------------------------------------------------------------

. 
. *Intermittent Claudication
. gen IC = 0

. foreach num of numlist 2/40 {
  2.         replace IC = 1 if inlist(i10_dx`num', "I70211",  "I70212",  "I70213",  "I70311",  "I70312") |
>  inlist(i10_dx`num', "I70313",  "I70411",  "I70412",  "I70413",  "I70511") | inlist(i10_dx`num', "I70512
> ",  "I70513",  "I70611",  "I70612",  "I70613") | inlist(i10_dx`num', "I70711",  "I70712",  "I70713")
  3. }
(1 real change made)
(1 real change made)
(2 real changes made)
(5 real changes made)
(3 real changes made)
(4 real changes made)
(3 real changes made)
(7 real changes made)
(3 real changes made)
(5 real changes made)
(6 real changes made)
(8 real changes made)
(13 real changes made)
(10 real changes made)
(9 real changes made)
(2 real changes made)
(9 real changes made)
(10 real changes made)
(9 real changes made)
(8 real changes made)
(6 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *Rest Pain
. gen RP = 0

. foreach num of numlist 2/40 {
  2.         replace RP = 1 if inlist(i10_dx`num', "I70221",  "I70222",  "I70223",  "I70321",  "I70322") |
>  inlist(i10_dx`num', "I70323",  "I70421",  "I70422",  "I70423",  "I70521") | inlist(i10_dx`num', "I70522
> ",  "I70523",  "I70621",  "I70622",  "I70623") | inlist(i10_dx`num', "I70721",  "I70722",  "I70723")
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(9 real changes made)
(5 real changes made)
(2 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(3 real changes made)
(5 real changes made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)

. 
. *Ulceration & gangrene = Wounds
. gen UG = 0

. foreach num of numlist 2/40 {
  2.         replace UG = 1 if inlist(i10_dx`num', "I70231",  "I70232",  "I70233",  "I70234",  "I70241") |
>  inlist(i10_dx`num', "I70242",  "I70243",  "I70244",  "I70235",  "I70261") | inlist(i10_dx`num', "I70262
> ",  "I70263",  "I70331",  "I70332",  "I70333") | inlist(i10_dx`num', "I70334",  "I70341",  "I70342") | i
> nlist(i10_dx`num', "I70343",  "I70344",  "I70348",  "I70361",  "I70362") | inlist(i10_dx`num', "I70363",
>   "I70431",  "I70432",  "I70433",  "I70434") | inlist(i10_dx`num', "I70441",  "I70442",  "I70443", "I704
> 44", "I70535") | inlist(i10_dx`num', "I70461",  "I70462",  "I70463",  "I70531",  "I70532") | inlist(i10_
> dx`num', "I70533",  "I70534",  "I70541",  "I70542",  "I70543") | inlist(i10_dx`num', "I70544",  "I70635"
> ,  "I70561", "I70562", "I70563") | inlist(i10_dx`num', "I70631",  "I70632",  "I70633",  "I70634",  "I706
> 41") | inlist(i10_dx`num', "I70642",  "I70643",  "I70644",  "I70648",  "I70661") | inlist(i10_dx`num', "
> I70662",  "I70663",  "I70731", "I70732", "I70733") | inlist(i10_dx`num', "I70734",  "I70741",  "I70742",
>   "I70743",  "I70744") | inlist(i10_dx`num', "I70735",  "I70761",  "I70762",  "I70763", "I70238") | inli
> st(i10_dx`num', "I70245",  "I70248",  "I70335",  "I70338", "I70345") | inlist(i10_dx`num', "I70435",  "I
> 70438",  "I70445",  "I70448", "I70345") | inlist(i10_dx`num', "I70538",  "I70545",  "I70548",  "I70638",
>  "I70645") | inlist(i10_dx`num', "I70738", "I70745",  "I70748", "I70345")
  3. }
(21 real changes made)
(47 real changes made)
(58 real changes made)
(85 real changes made)
(84 real changes made)
(82 real changes made)
(75 real changes made)
(58 real changes made)
(41 real changes made)
(52 real changes made)
(39 real changes made)
(25 real changes made)
(38 real changes made)
(31 real changes made)
(17 real changes made)
(22 real changes made)
(18 real changes made)
(14 real changes made)
(14 real changes made)
(14 real changes made)
(11 real changes made)
(14 real changes made)
(6 real changes made)
(6 real changes made)
(4 real changes made)
(4 real changes made)
(4 real changes made)
(1 real change made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. foreach var of varlist IC RP UG{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
       IC |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1946170.0666088334     8400.0077959000  1954570.0744047333
        1 |       0.0000000000      705.0016913000      705.0016913000
          | 
    Total | 1946170.0666088334     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  3.01e+04
    Design-based  F(1, 3987)      =  2.58e+04     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
       RP |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1946170.0666088334     8825.0095421000  1954995.0761509333
        1 |       0.0000000000      279.9999451000      279.9999451000
          | 
    Total | 1946170.0666088334     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.20e+04
    Design-based  F(1, 3987)      =  1.14e+04     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
       UG |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945940.0664657366     4865.0068443000  1950805.0733100367
        1 |     230.0001431000     4240.0026429000     4470.0027860000
          | 
    Total | 1946170.0666088369     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.72e+05
    Design-based  F(1, 3987)      =  1.58e+05     P = 0.0000

. svy: prop IC RP UG if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
          IC |
          0  |   .9225699   .0067691      .9081994    .9348522
          1  |   .0774301   .0067691      .0651478    .0918006
             |
          RP |
          0  |   .9692477   .0041483      .9599772    .9764236
          1  |   .0307523   .0041483      .0235764    .0400228
             |
          UG |
          0  |    .534322   .0126867      .5093627    .5591106
          1  |    .465678   .0126867      .4408894    .4906373
--------------------------------------------------------------

. svy: prop IC RP UG if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        0.IC |          1          .             .           .
        0.RP |          1          .             .           .
             |
          UG |
          0  |   .9998818   .0000183      .9998398    .9999128
          1  |   .0001182   .0000183      .0000872    .0001602
--------------------------------------------------------------

. 
. *Making age
. svy: mean age if allPAD==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |   71.07248   .2792871      70.52445    71.62051
--------------------------------------------------------------

. *use summarize age if allPAD==1 & full_cohort==1 if need SD instead
. svy: mean age if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         age |    68.8105    .091582      68.63095    68.99006
--------------------------------------------------------------

. *use summarize age if allPAD==1 & full_cohort==0
. svy:regress age allPAD
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987
                                                   F(1, 3987)      =     67.65
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0001

------------------------------------------------------------------------------
             |             Linearized
         age | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      allPAD |   2.261979   .2750112     8.23   0.000     1.722803    2.801155
       _cons |    68.8105    .091582   751.35   0.000     68.63095    68.99006
------------------------------------------------------------------------------

. 
. *Making male sex
. svy: tab male allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
     male |                  0                   1               Total
----------+-----------------------------------------------------------
        0 |  965770.0663303591     3495.0043581000   969265.0706884591
        1 |  980400.0002796649     5610.0051291000   986010.0054087648
          | 
    Total | 1946170.0666100241     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   91.5802
    Design-based  F(1, 3987)      =   93.8723     P = 0.0000

. svy: proportion male if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .3838551   .0112871      .3619612    .4062302
          1  |   .6161449   .0112871      .5937698    .6380388
--------------------------------------------------------------

. svy: proportion male if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        male |
          0  |   .4962414   .0010729      .4941379    .4983449
          1  |   .5037586   .0010729      .5016551    .5058621
--------------------------------------------------------------

. 
. *Defining race categories, where ethnicity is when race=3...can make a separate variable
. label define race 1 "White" 2 "Black" 3 "Hispanic" 4 "Asian or Pacific Islander" 5 "Native American" 6 "
> Other", replace

. label value race race 

. 
. gen white = 0 

. replace white = 1 if race==1
(274,137 real changes made)

. gen black = 0 

. replace black = 1 if race==2
(54,659 real changes made)

. gen hispanic = 0

. replace hispanic = 1 if race==3
(38,855 real changes made)

. gen asian = 0 

. replace asian = 1 if race==4
(10,627 real changes made)

. gen native = 0

. replace native = 1 if race==5
(2,859 real changes made)

. gen race_other = 0 

. replace race_other = 1 if race==6
(9,918 real changes made)

. 
. foreach var of varlist white black hispanic asian native race_other {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    white |                  0                   1               Total
----------+-----------------------------------------------------------
        0 |  581590.0824332520     3000.0006458000   584590.0830790520
        1 | 1364579.9841771564     6105.0088414000  1370684.9930185564
          | 
    Total | 1946170.0666104085     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    8.1244
    Design-based  F(1, 3987)      =    7.2672     P = 0.0071
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    black |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1674724.9510677203     7255.0086447000  1681979.9597124204
        1 |  271445.1155419712     1850.0008425000   273295.1163844712
          | 
    Total | 1946170.0666096916     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   61.1842
    Design-based  F(1, 3987)      =   53.0164     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 hispanic |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1752600.0734256178     8400.0095033000  1761000.0829289178
        1 |  193569.9931839630      704.9999839000   194274.9931678630
          | 
    Total | 1946170.0666095810     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    9.8318
    Design-based  F(1, 3987)      =    9.5629     P = 0.0020
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    asian |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1893225.0971258539     8915.0095006000  1902140.1066264540
        1 |   52944.9694832960      189.9999866000    53134.9694698960
          | 
    Total | 1946170.0666091498     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    2.7533
    Design-based  F(1, 3987)      =    2.3199     P = 0.1278
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   native |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1931925.0825071768     9055.0093906000  1940980.0918977768
        1 |   14244.9841017002       50.0000966000    14294.9841983002
          | 
    Total | 1946170.0666088769     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.8345
    Design-based  F(1, 3987)      =    0.9196     P = 0.3376
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
race_othe |                           allPAD                          
r         |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1896785.0464867747     8900.0097510000  1905685.0562377747
        1 |   49385.0201224000      204.9997362000    49590.0198586000
          | 
    Total | 1946170.0666091747     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.6000
    Design-based  F(1, 3987)      =    0.4962     P = 0.4812

. svy: prop race if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                        Number of obs   =      1,821
Number of PSUs   = 1,041                        Population size = 9,105.0095
                                                Design df       =      1,040

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |    .670511    .013156      .6442014    .6957938
                    Black  |   .2031849   .0115437      .1814705    .2267778
                 Hispanic  |   .0774299   .0071926      .0644427    .0927749
Asian or Pacific Islander  |   .0208676   .0042052      .0140314      .03093
          Native American  |   .0054915   .0017323      .0029545    .0101846
                    Other  |    .022515   .0041106       .015715    .0321614
----------------------------------------------------------------------------

. svy: prop race if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                         Number of obs   =   389,234
Number of PSUs   = 3,987                         Population size = 1,946,170
                                                 Design df       =     3,986

----------------------------------------------------------------------------
                           |             Linearized            Logit
                           | Proportion   std. err.     [95% conf. interval]
---------------------------+------------------------------------------------
                      race |
                    White  |   .7011617   .0054798      .6903087    .7117933
                    Black  |   .1394766   .0036156      .1325377    .1467172
                 Hispanic  |    .099462   .0037859      .0922819    .1071349
Asian or Pacific Islander  |   .0272047   .0015501      .0243251    .0304146
          Native American  |   .0073195   .0006319      .0061791    .0086685
                    Other  |   .0253755   .0015195      .0225608    .0285311
----------------------------------------------------------------------------

. svy: tab race allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Race      |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
    White | 1364579.9841771564     6105.0088414000  1370684.9930185564
    Black |  271445.1155419712     1850.0008425000   273295.1163844712
 Hispanic |  193569.9931839630      704.9999839000   194274.9931678630
 Asian or |   52944.9694832960      189.9999866000    53134.9694698960
 Native A |   14244.9841017002       50.0000966000    14294.9841983002
    Other |   49385.0201224000      204.9997362000    49590.0198586000
          | 
    Total | 1946170.0666104867     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(5)         =   68.0080
    Design-based  F(4.93, 19665.06)=   12.4184    P = 0.0000

. 
. *Defining median income categories
. foreach n of numlist 1/4 {
  2. gen income_q`n' = 0
  3. replace income_q`n' = 1 if zipinc_qrtl==`n'
  4. }
(118,483 real changes made)
(103,578 real changes made)
(90,205 real changes made)
(71,961 real changes made)

. gen income_q_miss = 0

. replace income_q_miss=1 if zipinc_qrtl==.
(6,828 real changes made)

. 
. foreach var of varlist income_q1 income_q2 income_q3 income_q4 income_q_miss {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
income_q1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1356785.1503901144     6075.0077817000  1362860.1581718142
        1 |  589384.9162197540     3030.0017055000   592414.9179252540
          | 
    Total | 1946170.0666098683     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    7.6938
    Design-based  F(1, 3987)      =    7.4338     P = 0.0064
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
income_q2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1430660.0085119426     6725.0050989000  1437385.0136108424
        1 |  515510.0580983920     2380.0043883000   517890.0624866920
          | 
    Total | 1946170.0666103347     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.1133
    Design-based  F(1, 3987)      =    0.1097     P = 0.7405
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
income_q3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1497210.0071054432     7040.0071945000  1504250.0142999431
        1 |  448960.0595047467     2065.0022927000   451025.0617974467
          | 
    Total | 1946170.0666101901     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.1546
    Design-based  F(1, 3987)      =    0.1407     P = 0.7076
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
income_q4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1587845.0011795384     7625.0086043000  1595470.0097838384
        1 |  358325.0654308696     1480.0008829000   359805.0663137696
          | 
    Total | 1946170.0666104080     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    5.6163
    Design-based  F(1, 3987)      =    5.0394     P = 0.0248
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
income_q_ |                           allPAD                          
miss      |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1912180.0992529532     8955.0092694000  1921135.1085223532
        1 |   33989.9673559997      150.0002178000    34139.9675737997
          | 
    Total | 1946170.0666089528     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.1037
    Design-based  F(1, 3987)      =    0.0931     P = 0.7603

. 
. svy: prop zipinc_qrtl if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,791
Number of PSUs   = 1,031          Population size = 8,955.0093
                                  Design df       =      1,030

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .3383583   .0125921      .3141065    .3634903
          2  |   .2657735   .0112327      .2443224    .2883893
          3  |   .2305974   .0109616      .2097929    .2528051
          4  |   .1652707   .0104126      .1458374    .1867275
--------------------------------------------------------------

. svy: prop zipinc_qrtl if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   382,436
Number of PSUs   = 3,987           Population size = 1,912,180
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 zipinc_qrtl |
          1  |   .3082267   .0058273      .2969208    .3197673
          2  |   .2695928   .0039372      .2619437    .2773814
          3  |   .2347896   .0037862       .227448    .2422939
          4  |   .1873909   .0052566      .1773023    .1979154
--------------------------------------------------------------

. 
. replace zipinc_qrtl = 5 if zipinc_qrtl == .
(6,828 real changes made)

. svy: tab zipinc_qrtl allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Median    |
household |
income    |
national  |
quartile  |
for       |
patient   |                           allPAD                          
ZIP Code  |                  0                   1               Total
----------+-----------------------------------------------------------
        1 |  589384.9162197540     3030.0017055000   592414.9179252540
        2 |  515510.0580983920     2380.0043883000   517890.0624866920
        3 |  448960.0595047467     2065.0022927000   451025.0617974467
        4 |  358325.0654308696     1480.0008829000   359805.0663137696
        5 |   33989.9673559997      150.0002178000    34139.9675737997
          | 
    Total | 1946170.0666097619     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(4)         =   10.2496
    Design-based  F(3.99, 15888.57)=    2.3662    P = 0.0508

. 
. *Making expected primary payer
. replace pay1 = 7 if pay1==.
(371 real changes made)

. label define pay1 1 "Medicare" 2 "Medicaid" 3 "Private" 4 "self-pay" 5 "no charge" 6 "other" 7 "missing"

. label value pay1 pay1

. 
. foreach n of numlist 1/7 {
  2. gen pay1_`n' = 0
  3. replace pay1_`n' = 1 if pay1 ==`n'
  4. }
(271,922 real changes made)
(45,059 real changes made)
(55,290 real changes made)
(10,311 real changes made)
(857 real changes made)
(7,245 real changes made)
(371 real changes made)

. 
. foreach var of varlist pay1_1 pay1_2 pay1_3 pay1_4 pay1_5 pay1_6 pay1_7{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 |  593725.0223745137     1940.0037273000   595665.0261018137
        1 | 1352445.0442358938     7165.0057599000  1359610.0499957937
          | 
    Total | 1946170.0666104075     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   72.4257
    Design-based  F(1, 3987)      =   71.6469     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1721585.0216185434     8395.0073228000  1729980.0289413433
        1 |  224585.0449910826      710.0021644000   225295.0471554826
          | 
    Total | 1946170.0666096262     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   24.8940
    Design-based  F(1, 3987)      =   25.9301     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1670670.1018992593     8155.0077144000  1678825.1096136593
        1 |  275499.9647103376      950.0017728000   276449.9664831376
          | 
    Total | 1946170.0666095971     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   20.6857
    Design-based  F(1, 3987)      =   19.6180     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1894735.0423002022     8985.0096034000  1903720.0519036020
        1 |   51435.0243089028      119.9998838000    51555.0241927028
          | 
    Total | 1946170.0666091049     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   12.3940
    Design-based  F(1, 3987)      =   12.8769     P = 0.0003
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_5 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1941900.0700188784     9090.0094952000  1950990.0795140786
        1 |    4269.9965900000       14.9999920000     4284.9965820000
          | 
    Total | 1946170.0666088786     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.2477
    Design-based  F(1, 3987)      =    0.2638     P = 0.6076
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_6 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1910085.0688172264     8965.0095674000  1919050.0783846264
        1 |   36084.9977917996      139.9999198000    36224.9977115996
          | 
    Total | 1946170.0666090262     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.9988
    Design-based  F(1, 3987)      =    1.0336     P = 0.3094
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   pay1_7 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1944320.0726262599     9100.0094927000  1953420.0821189596
        1 |    1849.9939826000        4.9999945000     1854.9939771000
          | 
    Total | 1946170.0666088597     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.3082
    Design-based  F(1, 3987)      =    0.3489     P = 0.5548

. svy: prop pay1 if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .7869301   .0099302      .7667958    .8057663
   Medicaid  |   .0779793   .0063305      .0664283    .0913424
    Private  |   .1043384    .007555      .0904166    .1201206
   self-pay  |   .0131795   .0026564      .0088662    .0195499
  no charge  |   .0016474   .0009494      .0005313     .005096
      other  |   .0153761   .0028645      .0106582    .0221357
    missing  |   .0005491   .0005489      .0000772    .0038949
--------------------------------------------------------------

. svy: prop pay1 if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        pay1 |
   Medicare  |   .6949264   .0025841      .6898367     .699969
   Medicaid  |   .1153985   .0019268      .1116743    .1192302
    Private  |   .1415601   .0020364      .1376144    .1455997
   self-pay  |   .0264288   .0008957      .0247284    .0282429
  no charge  |   .0021941   .0002172      .0018069    .0026639
      other  |   .0185415    .000609      .0173846    .0197739
    missing  |   .0009506   .0001164      .0007477    .0012084
--------------------------------------------------------------

. svy: tab pay1 allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Primary   |
expected  |
payer     |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
 Medicare | 1352445.0442358938     7165.0057599000  1359610.0499957937
 Medicaid |  224585.0449910826      710.0021644000   225295.0471554826
  Private |  275499.9647103376      950.0017728000   276449.9664831376
 self-pay |   51435.0243089028      119.9998838000    51555.0241927028
 no charg |    4269.9965900000       14.9999920000     4284.9965820000
    other |   36084.9977917996      139.9999198000    36224.9977115996
  missing |    1849.9939826000        4.9999945000     1854.9939771000
          | 
    Total | 1946170.0666106162     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(6)         =   75.4532
    Design-based  F(5.96, 23761.78)=   13.0879    P = 0.0000

. 
. *Making patient location variable
. replace pl_nchs = 7 if pl_nchs==.
(1,757 real changes made)

. label define pl_nchs 1 "Central" 2 "Fringe" 3 "Large Metro" 4 "Small Metro" 5 "Micro" 6 "Not Metro/Micro
> " 7 "missing"

. label value pl_nchs pl_nchs

. 
. foreach n of numlist 1/7 {
  2. gen pl_nchs`n' = 0
  3. replace pl_nchs`n' = 1 if pl_nchs ==`n'
  4. }
(115,571 real changes made)
(91,677 real changes made)
(80,920 real changes made)
(37,378 real changes made)
(37,294 real changes made)
(26,458 real changes made)
(1,757 real changes made)

. 
. foreach var of varlist pl_nchs1 pl_nchs2 pl_nchs3 pl_nchs4 pl_nchs5 pl_nchs6 pl_nchs7{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs1 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1370939.8738952233     6480.0073910000  1377419.8812862232
        1 |  575230.1927155871     2625.0020962000   577855.1948117871
          | 
    Total | 1946170.0666108101     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.4598
    Design-based  F(1, 3987)      =    0.3637     P = 0.5465
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs2 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1489959.7523150120     6930.0090080000  1496889.7613230119
        1 |  456210.3142953239     2175.0004792000   458385.3147745238
          | 
    Total | 1946170.0666103358     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.2013
    Design-based  F(1, 3987)      =    0.1593     P = 0.6898
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs3 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1543580.1125128099     7095.0082085000  1550675.1207213099
        1 |  402589.9540970126     2010.0012787000   404599.9553757127
          | 
    Total | 1946170.0666098227     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    2.1324
    Design-based  F(1, 3987)      =    1.6286     P = 0.2020
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs4 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1760225.0364485793     8160.0071227000  1768385.0435712792
        1 |  185945.0301611076      945.0023645000   186890.0325256076
          | 
    Total | 1946170.0666096869     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    1.4254
    Design-based  F(1, 3987)      =    1.1390     P = 0.2859
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs5 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1760555.2596967854     8250.0079034000  1768805.2676001855
        1 |  185614.8069129898      855.0015838000   186469.8084967898
          | 
    Total | 1946170.0666097752     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.0454
    Design-based  F(1, 3987)      =    0.0388     P = 0.8438
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs6 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1814350.3001544538     8635.0077088000  1822985.3078632541
        1 |  131819.7664551761      470.0017784000   132289.7682335760
          | 
    Total | 1946170.0666096299     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    7.4599
    Design-based  F(1, 3987)      =    6.1137     P = 0.0135
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
 pl_nchs7 |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1937410.0646362938     9080.0095808000  1946490.0742170936
        1 |    8760.0019726000       24.9999064000     8785.0018790000
          | 
    Total | 1946170.0666088939     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    1.2487
    Design-based  F(1, 3987)      =    1.2522     P = 0.2632

. svy: prop pl_nchs if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1              Number of obs   =      1,821
Number of PSUs   = 1,041              Population size = 9,105.0095
                                      Design df       =      1,040

------------------------------------------------------------------
                 |             Linearized            Logit
                 | Proportion   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
         pl_nchs |
        Central  |   .2883031   .0149311      .2599111     .318462
         Fringe  |   .2388795   .0136677      .2130999    .2667208
    Large Metro  |   .2207577   .0146158      .1934141    .2507652
    Small Metro  |   .1037893   .0097089      .0862248    .1244445
          Micro  |   .0939045   .0081403      .0791031    .1111412
Not Metro/Micro  |   .0516201   .0060041      .0410321    .0647558
        missing  |   .0027457   .0012274      .0011412    .0065913
------------------------------------------------------------------

. svy: prop pl_nchs if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1               Number of obs   =   389,234
Number of PSUs   = 3,987               Population size = 1,946,170
                                       Design df       =     3,986

------------------------------------------------------------------
                 |             Linearized            Logit
                 | Proportion   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
         pl_nchs |
        Central  |   .2955704   .0093205      .2776304    .3141654
         Fringe  |   .2344144   .0078469      .2193816    .2501472
    Large Metro  |   .2068627   .0086724      .1903756    .2243819
    Small Metro  |   .0955441   .0051441      .0859238    .1061164
          Micro  |   .0953744   .0035695      .0886021    .1026061
Not Metro/Micro  |   .0677329   .0026694      .0626832    .0731576
        missing  |   .0045011   .0003095      .0039333    .0051506
------------------------------------------------------------------

. svy: tab pl_nchs allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Patient   |
Location: |
NCHS      |
Urban-Rur |                           allPAD                          
al Code   |                  0                   1               Total
----------+-----------------------------------------------------------
  Central |  575230.1927155871     2625.0020962000   577855.1948117871
   Fringe |  456210.3142953239     2175.0004792000   458385.3147745238
 Large Me |  402589.9540970126     2010.0012787000   404599.9553757127
 Small Me |  185945.0301611076      945.0023645000   186890.0325256076
    Micro |  185614.8069129898      855.0015838000   186469.8084967898
 Not Metr |  131819.7664551761      470.0017784000   132289.7682335760
  missing |    8760.0019726000       24.9999064000     8785.0018790000
          | 
    Total | 1946170.0666097971     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(6)         =   11.6977
    Design-based  F(5.94, 23686.31)=    1.6222    P = 0.1372

. 
. 
. *Making hospital location variable
. replace hosp_locteach = 4 if hosp_locteach==.
(0 real changes made)

. label define hosp_locteach 1 "Rural" 2 "Urban Nonteaching" 3 "Urban Teaching" 4 "Missing"

. label value hosp_locteach hosp_locteach

. 
. foreach n of numlist 1/4 {
  2. gen hosp_locteach`n' = 0
  3. replace hosp_locteach`n' = 1 if hosp_locteach ==`n'
  4. }
(37,581 real changes made)
(90,337 real changes made)
(263,137 real changes made)
(0 real changes made)

. 
. foreach var of varlist hosp_locteach1 hosp_locteach2 hosp_locteach3 hosp_locteach4 {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each1     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1758950.6717095166     8420.0092783000  1767370.6809878165
        1 |  187219.3949002815      685.0002089000   187904.3951091815
          | 
    Total | 1946170.0666097980     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    9.1716
    Design-based  F(1, 3987)      =    6.6420     P = 0.0100
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each2     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1496388.7304108837     7199.9995742000  1503588.7299850837
        1 |  449781.3361983856     1905.0099130000   451686.3461113856
          | 
    Total | 1946170.0666092692     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    4.8866
    Design-based  F(1, 3987)      =    3.8273     P = 0.0505
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
hosp_loct |                           allPAD                          
each3     |                  0                   1               Total
----------+-----------------------------------------------------------
        0 |  637000.7310985986     2590.0101219000   639590.7412204986
        1 | 1309169.3355116807     6514.9993653000  1315684.3348769806
          | 
    Total | 1946170.0666102790     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   15.1198
    Design-based  F(1, 3987)      =   11.4414     P = 0.0007
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

------------------------------
   allPAD |              count
----------+-------------------
        0 | 1946170.0666088334
        1 |    9105.0094872000
          | 
    Total | 1955275.0760960332
------------------------------
Key:    count = Weighted count

  Only one row category.
  Statistics cannot be computed.

  Pearson:
    Uncorrected   chi2(0)         =         .
    Design-based  F(., .)         =         .     P =      .

. svy: prop hosp_locteach if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                Number of obs   =      1,821
Number of PSUs   = 1,041                Population size = 9,105.0095
                                        Design df       =      1,040

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0752333   .0084084      .0603074    .0934859
Urban Nonteaching  |   .2092266   .0137304      .1835564    .2374427
   Urban Teaching  |   .7155401   .0154615      .6842536    .7448823
--------------------------------------------------------------------

. svy: prop hosp_locteach if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                 Number of obs   =   389,234
Number of PSUs   = 3,987                 Population size = 1,946,170
                                         Design df       =     3,986

--------------------------------------------------------------------
                   |             Linearized            Logit
                   | Proportion   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
     hosp_locteach |
            Rural  |   .0961989   .0048052      .0871814    .1060407
Urban Nonteaching  |    .231111   .0092465      .2134816     .249734
   Urban Teaching  |   .6726901   .0102311       .652325    .6924247
--------------------------------------------------------------------

. svy: tab hosp_locteach allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Location/ |
teaching  |
status of |
hospital  |                           allPAD                          
(STRATA)  |                  0                   1               Total
----------+-----------------------------------------------------------
    Rural |  187219.3949002815      685.0002089000   187904.3951091815
 Urban No |  449781.3361983856     1905.0099130000   451686.3461113856
 Urban Te | 1309169.3355116807     6514.9993653000  1315684.3348769806
          | 
    Total | 1946170.0666103477     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(2)         =   16.9938
    Design-based  F(2.00, 7960.01)=    6.3837     P = 0.0017

. 
. *Figuring out comorbidities
. *Elixhauser Comorbidity Index
. elixhauser i10_dx1-i10_dx40, index(10)
(0 observations deleted)
ELIXHAUSER COMORBIDITY MACRO
Providing Summary of Elixhauser Codes
OPTIONS SELECTED: 
INPUT DATA:   Quan ICD-10
OBSERVATIONAL UNIT: Visits
ID VARIABLE NAME (Given only if Unit is Patients): 
PREFIX of COMORBIDITY VARIABLES:  
SUMMARIZE ELIXHAUSER INDEX SUM: NO
SUMMARIZE INDIVIDUAL COMORBIDITIES: NO
Please wait. Thank you!
Program takes a few minutes - there are up to 40 ICD-10 codes per subject.
Iteration 1 of 40 - Program is running - Please wait
Iteration 2 of 40 - Program is running - Please wait
Iteration 3 of 40 - Program is running - Please wait
Iteration 4 of 40 - Program is running - Please wait
Iteration 5 of 40 - Program is running - Please wait
Iteration 6 of 40 - Program is running - Please wait
Iteration 7 of 40 - Program is running - Please wait
Iteration 8 of 40 - Program is running - Please wait
Iteration 9 of 40 - Program is running - Please wait
Iteration 10 of 40 - Program is running - Please wait
Iteration 11 of 40 - Program is running - Please wait
Iteration 12 of 40 - Program is running - Please wait
Iteration 13 of 40 - Program is running - Please wait
Iteration 14 of 40 - Program is running - Please wait
Iteration 15 of 40 - Program is running - Please wait
Iteration 16 of 40 - Program is running - Please wait
Iteration 17 of 40 - Program is running - Please wait
Iteration 18 of 40 - Program is running - Please wait
Iteration 19 of 40 - Program is running - Please wait
Iteration 20 of 40 - Program is running - Please wait
Iteration 21 of 40 - Program is running - Please wait
Iteration 22 of 40 - Program is running - Please wait
Iteration 23 of 40 - Program is running - Please wait
Iteration 24 of 40 - Program is running - Please wait
Iteration 25 of 40 - Program is running - Please wait
Iteration 26 of 40 - Program is running - Please wait
Iteration 27 of 40 - Program is running - Please wait
Iteration 28 of 40 - Program is running - Please wait
Iteration 29 of 40 - Program is running - Please wait
Iteration 30 of 40 - Program is running - Please wait
Iteration 31 of 40 - Program is running - Please wait
Iteration 32 of 40 - Program is running - Please wait
Iteration 33 of 40 - Program is running - Please wait
Iteration 34 of 40 - Program is running - Please wait
Iteration 35 of 40 - Program is running - Please wait
Iteration 36 of 40 - Program is running - Please wait
Iteration 37 of 40 - Program is running - Please wait
Iteration 38 of 40 - Program is running - Please wait
Iteration 39 of 40 - Program is running - Please wait
Iteration 40 of 40 - Program is running - Please wait
Total Number of Observational Units (Visits OR Patients): 391055

. gen elix = 0

. replace elix = elixsum-ynel5
(388,536 real changes made)

. 
. svy: mean elix if allPAD==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.412959   .0475107      5.319732    5.506187
--------------------------------------------------------------

. svy: mean elix if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        elix |   5.022152    .012491      4.997662    5.046641
--------------------------------------------------------------

. 
. *Diabetes
. gen dm = 0

. replace dm = 1 if ynel10==1 | ynel11==1
(155,691 real changes made)

. 
. *Tobacco Use
. gen smoke = 0

. foreach num of numlist 2/40 {
  2. replace smoke = 1 if inlist(i10_dx`num', "Z87891", "F17200", "F17201", "F17203") | inlist(i10_dx`num'
> , "F17208", "F17209", "F17210", "F17211", "F17213") | inlist(i10_dx`num', "F17218", "F17219", "F17220", 
> "F17290", "F17299") | inlist(i10_dx`num', "T65211A", "T65211S",  "T65211D" , "T65212", "T65212A") | inli
> st(i10_dx`num', "T65212D", "T65212S",  "T65213A" , "T65213D", "T65213S") | inlist(i10_dx`num', "T65214A"
> , "T65214D",  "T65214S" , "T65221A", "T65221D") | inlist(i10_dx`num', "T65221S", "T65222A",  "T65222D" ,
>  "T65222S", "T65223A") | inlist(i10_dx`num', "T65223D", "T65223S",  "T65224A" , "T65224D", "T65224S") | 
> inlist(i10_dx`num', "T65291A", "T65291D",  "T65291S" , "T65292A", "T65292D") | inlist(i10_dx`num', "T652
> 92S", "T65293A",  "T65293D" , "T65293S", "T65294A") | inlist(i10_dx`num', "T65294D", "T65294S", "F17221"
> , "F17223", "F17228") | inlist(i10_dx`num', "T65294D", "T65294S", "F17291", "F17293", "F17298")
  3. }
(679 real changes made)
(1,169 real changes made)
(1,944 real changes made)
(2,834 real changes made)
(3,752 real changes made)
(4,709 real changes made)
(5,759 real changes made)
(6,759 real changes made)
(7,340 real changes made)
(8,064 real changes made)
(8,424 real changes made)
(8,712 real changes made)
(8,895 real changes made)
(8,753 real changes made)
(8,378 real changes made)
(7,884 real changes made)
(7,447 real changes made)
(6,186 real changes made)
(5,580 real changes made)
(5,274 real changes made)
(4,672 real changes made)
(4,247 real changes made)
(3,929 real changes made)
(3,098 real changes made)
(1,215 real changes made)
(1,079 real changes made)
(914 real changes made)
(836 real changes made)
(715 real changes made)
(379 real changes made)
(205 real changes made)
(181 real changes made)
(149 real changes made)
(136 real changes made)
(87 real changes made)
(87 real changes made)
(71 real changes made)
(70 real changes made)
(45 real changes made)

. 
. *ESRD
. gen esrd = 0

. replace esrd = 1 if ynel13==1
(134,875 real changes made)

. 
. *HTN
. gen htn = 0

. replace htn = 1 if ynel6==1 | ynel31==1
(277,906 real changes made)

. 
. *Coronary Artery Disease
. gen cad = 0

. foreach num of numlist 2/40 {
  2. replace cad = 1 if inlist(i10_dx`num', "I200", "I201", "I202", "I208", "I209") | inlist(i10_dx`num', 
> "I210", "I2101", "I2102", "I2109", "I211") | inlist(i10_dx`num', "I2111", "I2119", "I212", "I2121", "I21
> 29") | inlist(i10_dx`num', "I213", "I214", "I219", "I21A1", "I256") | inlist(i10_dx`num', "I21A9", "I220
> ", "I221", "I222", "I228") | inlist(i10_dx`num', "I229", "I230", "I231", "I232", "I233") | inlist(i10_dx
> `num', "I234", "I235", "I236", "I237", "I238") | inlist(i10_dx`num', "I240", "I241", "I248", "I249", "I2
> 50") | inlist(i10_dx`num', "I2510", "I25110", "I25111") | inlist(i10_dx`num', "I25112", "I25118", "I2511
> 9", "I252", "I25700") | inlist(i10_dx`num', "I25701", "I25702", "I25708", "I25709", "I25710") | inlist(i
> 10_dx`num', "I25711", "I25712", "I25718", "I25719", "I25720") | inlist(i10_dx`num', "I25721", "I25728", 
> "I25729", "I25730", "I25731") | inlist(i10_dx`num', "I25732", "I25738", "I25739", "I25750", "I25751") | 
> inlist(i10_dx`num', "I25752", "I25758", "I25759", "I25760", "I25761") | inlist(i10_dx`num', "I25762", "I
> 25768", "I25769", "I25790", "I25791") | inlist(i10_dx`num', "I25792", "I25798", "I25799", "I25810", "I25
> 82") | inlist(i10_dx`num', "I2583", "I2584", "I2589", "I259", "I255")
  3. }
(7,377 real changes made)
(8,266 real changes made)
(6,242 real changes made)
(5,970 real changes made)
(6,343 real changes made)
(6,734 real changes made)
(7,195 real changes made)
(7,250 real changes made)
(7,435 real changes made)
(7,277 real changes made)
(6,855 real changes made)
(6,520 real changes made)
(6,028 real changes made)
(5,371 real changes made)
(4,633 real changes made)
(4,122 real changes made)
(3,521 real changes made)
(2,733 real changes made)
(2,303 real changes made)
(1,951 real changes made)
(1,666 real changes made)
(1,402 real changes made)
(1,144 real changes made)
(830 real changes made)
(358 real changes made)
(304 real changes made)
(221 real changes made)
(205 real changes made)
(147 real changes made)
(92 real changes made)
(72 real changes made)
(46 real changes made)
(38 real changes made)
(29 real changes made)
(35 real changes made)
(23 real changes made)
(21 real changes made)
(20 real changes made)
(10 real changes made)

. 
. *Dyslipidemia
. gen dys = 0

. foreach num of numlist 2/40 {
  2. replace dys = 1 if inlist(i10_dx`num', "E7800") | inlist(i10_dx`num', "E7801", "E781", "E782", "E783"
> , "E7849") | inlist(i10_dx`num', "E7841", "E785", "E786")
  3. }
(934 real changes made)
(1,374 real changes made)
(2,447 real changes made)
(3,842 real changes made)
(5,593 real changes made)
(7,286 real changes made)
(8,869 real changes made)
(9,764 real changes made)
(10,262 real changes made)
(10,566 real changes made)
(10,613 real changes made)
(10,448 real changes made)
(9,588 real changes made)
(9,244 real changes made)
(8,038 real changes made)
(7,232 real changes made)
(6,457 real changes made)
(4,968 real changes made)
(4,398 real changes made)
(3,779 real changes made)
(3,179 real changes made)
(2,808 real changes made)
(2,349 real changes made)
(1,938 real changes made)
(619 real changes made)
(492 real changes made)
(437 real changes made)
(358 real changes made)
(333 real changes made)
(150 real changes made)
(102 real changes made)
(76 real changes made)
(51 real changes made)
(59 real changes made)
(49 real changes made)
(51 real changes made)
(34 real changes made)
(13 real changes made)
(23 real changes made)

. 
. *Obesity
. gen obese = 0

. replace obese = 1 if ynel22==1
(64,779 real changes made)

. 
. foreach var of varlist dm smoke esrd htn cad dys obese {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
       dm |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1172520.0140503938     4300.0043474000  1176820.0183977936
        1 |  773650.0525595257     4805.0051398000   778455.0576993256
          | 
    Total | 1946170.0666099195     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  128.2415
    Design-based  F(1, 3987)      =  123.7648     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    smoke |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1247175.0286772461     4815.0044184000  1251990.0330956460
        1 |  698995.0379323132     4290.0050688000   703285.0430011131
          | 
    Total | 1946170.0666095591     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   98.7289
    Design-based  F(1, 3987)      =   90.3584     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
     esrd |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1276329.9453415880     4570.0060325000  1280899.9513740882
        1 |  669840.1212683602     4535.0034547000   674375.1247230602
          | 
    Total | 1946170.0666099482     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  189.9880
    Design-based  F(1, 3987)      =  198.8309     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
      htn |                  0                   1               Total
----------+-----------------------------------------------------------
        0 |  564269.8949691526     1475.0030822000   565744.8980513527
        1 | 1381900.1716412730     7630.0064050000  1389530.1780462728
          | 
    Total | 1946170.0666104255     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  144.2847
    Design-based  F(1, 3987)      =  130.4129     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
      cad |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1347129.9422525964     4200.0053262000  1351329.9475787964
        1 |  599040.1243578197     4905.0041610000   603945.1285188197
          | 
    Total | 1946170.0666104159     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  452.7169
    Design-based  F(1, 3987)      =  450.5654     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
      dys |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1206765.0420352020     4395.0083820000  1211160.0504172021
        1 |  739405.0245746481     4710.0011052000   744115.0256798482
          | 
    Total | 1946170.0666098502     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  145.0902
    Design-based  F(1, 3987)      =  144.3036     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    obese |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1623425.0406270535     7955.0082878000  1631380.0489148535
        1 |  322745.0259826847     1150.0011994000   323895.0271820847
          | 
    Total | 1946170.0666097382     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   20.4942
    Design-based  F(1, 3987)      =   19.9385     P = 0.0000

. svy: prop dm smoke esrd htn cad dys obese if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
          dm |
          0  |    .472268   .0119721      .4488542    .4958044
          1  |    .527732   .0119721      .5041956    .5511458
             |
       smoke |
          0  |   .5288302   .0126539      .5039492    .5535688
          1  |   .4711698   .0126539      .4464312    .4960508
             |
        esrd |
          0  |   .5019222   .0116186      .4791353     .524701
          1  |   .4980778   .0116186       .475299    .5208647
             |
         htn |
          0  |   .1619991   .0092075      .1447338    .1808884
          1  |   .8380009   .0092075      .8191116    .8552662
             |
         cad |
          0  |   .4612851   .0118024      .4382257    .4845114
          1  |   .5387149   .0118024      .5154886    .5617743
             |
         dys |
          0  |   .4827022   .0122264      .4587693    .5067148
          1  |   .5172978   .0122264      .4932852    .5412307
             |
       obese |
          0  |   .8736958   .0079582      .8572368     .888504
          1  |   .1263042   .0079582       .111496    .1427632
--------------------------------------------------------------

. svy: prop dm smoke esrd htn cad dys obese if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
          dm |
          0  |   .6024756   .0016893      .5991589    .6057829
          1  |   .3975244   .0016893      .3942171    .4008411
             |
       smoke |
          0  |   .6408356   .0029569       .635018     .646612
          1  |   .3591644   .0029569       .353388     .364982
             |
        esrd |
          0  |   .6558162   .0016794      .6525162    .6591013
          1  |   .3441838   .0016794      .3408987    .3474838
             |
         htn |
          0  |   .2899386   .0019731      .2860856    .2938222
          1  |   .7100614   .0019731      .7061778    .7139144
             |
         cad |
          0  |   .6921954   .0017525      .6887488    .6956207
          1  |   .3078046   .0017525      .3043793    .3112512
             |
         dys |
          0  |   .6200717   .0026429      .6148767    .6252394
          1  |   .3799283   .0026429      .3747606    .3851233
             |
       obese |
          0  |    .834164   .0016305      .8309426    .8373361
          1  |    .165836   .0016305      .1626639    .1690574
--------------------------------------------------------------

. 
. *Defining outcomes for Table 2
. *Making in-hospital mortality (primary outcome)
. svy: tab died, count format (%20.10f)
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

------------------------------
Died      |
during    |
hospitali |
zation    |              count
----------+-------------------
        0 | 1756990.0455915972
        1 |  198285.0305053956
          | 
    Total | 1955275.0760969927
------------------------------
Key:    count = Weighted count

. svy: prop died if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8769906    .007826      .8607922    .8915417
          1  |   .1230094    .007826      .1084583    .1392078
--------------------------------------------------------------

. svy: prop died if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
        died |
          0  |   .8986908   .0008856      .8969412    .9004139
          1  |   .1013092   .0008856      .0995861    .1030588
--------------------------------------------------------------

. svy: tab died allPAD,  count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Died      |
during    |
hospitali |                           allPAD                          
zation    |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1749005.0374894808     7985.0081021000  1756990.0455915809
        1 |  197165.0291202952     1120.0013851000   198285.0305053952
          | 
    Total | 1946170.0666097759     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    9.3662
    Design-based  F(1, 3987)      =    9.2029     P = 0.0024

. 
. *New Hospice Var for Sensitivity Analyses
. gen hospice = 0 

. foreach num of numlist 1/40 {
  2.    replace hospice = 1 if i10_dx`num' == "Z515"
  3. }
(0 real changes made)
(703 real changes made)
(1,377 real changes made)
(2,215 real changes made)
(1,153 real changes made)
(1,352 real changes made)
(1,667 real changes made)
(2,326 real changes made)
(3,054 real changes made)
(2,286 real changes made)
(1,909 real changes made)
(1,928 real changes made)
(1,998 real changes made)
(2,089 real changes made)
(2,027 real changes made)
(1,830 real changes made)
(1,711 real changes made)
(1,616 real changes made)
(1,312 real changes made)
(1,217 real changes made)
(1,112 real changes made)
(1,022 real changes made)
(993 real changes made)
(877 real changes made)
(668 real changes made)
(263 real changes made)
(202 real changes made)
(184 real changes made)
(194 real changes made)
(165 real changes made)
(64 real changes made)
(38 real changes made)
(46 real changes made)
(28 real changes made)
(28 real changes made)
(20 real changes made)
(18 real changes made)
(15 real changes made)
(18 real changes made)
(15 real changes made)

. replace hospice = 1 if died == 1
(21,685 real changes made)

. 
. *Making all PAD interventions
. *Suprainguinal + Infrainguinal Bypasses
. gen bysup = 0 

. foreach num of numlist 1/25 {
  2. replace bysup = 1 if inlist(i10_pr`num', "041K09J", "041K09K", "041K0AJ", "041K0JJ", "041K0JK") | inl
> ist(i10_pr`num', "041K0KJ") | inlist(i10_pr`num', "041K0KK", "041K0ZJ", "041K0ZK") | inlist(i10_pr`num',
>  "041K49J", "041K49K", "041K4AJ", "041K4AK", "041K4JJ") | inlist(i10_pr`num', "041K4JK", "041K4KJ", "041
> K4KK", "041K4ZJ", "041K4ZK") | inlist(i10_pr`num', "041L09K", "041L0AH", "041L0AK", "041L0JH", "041L0JK"
> ) | inlist(i10_pr`num', "041L0KH", "041L0KK", "041L0ZH", "041L0ZK", "041L49H") | inlist(i10_pr`num', "04
> 1L49K", "041L4AH", "041L4AK", "041L4JH", "041L4JK") | inlist(i10_pr`num', "041L4KH", "041L4KK", "041L4ZH
> ", "041L4ZK", "041K09H") | inlist(i10_pr`num', "041K09L", "041K09M", "041K09N", "041K09P", "041K09Q") | 
> inlist(i10_pr`num', "041K09S", "041K0AH", "041K0AL", "041K0AM", "041K0AN") | inlist(i10_pr`num', "041K0A
> P", "041K0AQ", "041K0AS", "041K0JH", "041K0JL") | inlist(i10_pr`num', "041K0JM", "041K0JN", "041K0JP", "
> 041K0JQ", "041K0JS") | inlist(i10_pr`num', "041K0KH", "041K0KL", "041K0KM", "041K0KN", "041K0KP") | inli
> st(i10_pr`num', "041K0KQ", "041K0KS", "041K0ZH", "041K0ZL", "041K0ZM") | inlist(i10_pr`num', "041K0ZN", 
> "041K0ZP", "041K0ZQ", "041K0ZS", "041K49H") | inlist(i10_pr`num', "041K49L", "041K49M", "041K49N", "041K
> 49P", "041K49Q") | inlist(i10_pr`num', "041K49S", "041K4AH", "041K4AL", "041K4AM", "041K4AN") | inlist(i
> 10_pr`num', "041K4AP", "041K4AQ", "041K4AS", "041K4JH", "041K4JL") | inlist(i10_pr`num', "041K4JM", "041
> K4JN", "041K4JP", "041K4JQ", "041K4JS") | inlist(i10_pr`num', "041K4KH", "041K4KL", "041K4KM", "041K4KN"
> , "041K4KP") | inlist(i10_pr`num', "041K4KQ", "041K4KS", "041K4ZH", "041K4ZL", "041K4ZM") | inlist(i10_p
> r`num', "041K4ZN", "041K4ZP", "041K4ZQ", "041K4ZS", "041L09J") | inlist(i10_pr`num', "041L09L", "041L09M
> ", "041L09N", "041L09P", "041L09Q") | inlist(i10_pr`num', "041L09S", "041L0AJ", "041L0AL", "041L0AM", "0
> 41L0AN") | inlist(i10_pr`num', "041L0AP", "041L0AQ", "041L0AS", "041L0JJ", "041L0JL") | inlist(i10_pr`nu
> m', "041L0JM", "041L0JN", "041L0JP", "041L0JQ", "041L0JS") | inlist(i10_pr`num', "041L0KJ", "041L0KL", "
> 041L0KM", "041L0KN", "041L0KP") | inlist(i10_pr`num', "041L0KQ", "041L0KS", "041L0ZJ", "041L0ZL", "041L0
> ZM") | inlist(i10_pr`num', "041L0ZN", "041L0ZP", "041L0ZQ", "041L0ZS", "041L49J") | inlist(i10_pr`num', 
> "041L49L", "041L49M", "041L49N", "041L49P", "041L49Q") | inlist(i10_pr`num', "041L49S", "041L4AJ", "041L
> 4AL", "041L4AM", "041L4AN") | inlist(i10_pr`num', "041L4AP", "041L4AQ", "041L4AS", "041L4JJ", "041L4JL")
>  | inlist(i10_pr`num', "041L4JM", "041L4JN", "041L4JP", "041L4JQ", "041L4JQ") | inlist(i10_pr`num', "041
> L4JS", "041L4KJ", "041L4KL", "041L4KM", "041L4KN") | inlist(i10_pr`num', "041L4KP", "041L4KQ", "041L4KS"
> , "041L4ZJ", "041L4ZL") | inlist(i10_pr`num', "041L4ZM", "041L4ZN", "041L4ZP", "041L4ZQ", "041L4ZS") | i
> nlist(i10_pr`num', "041M09L", "041M09M", "041M09P", "041M09Q", "041M09S") | inlist(i10_pr`num', "041M0AL
> ", "041M0AM", "041M0AP", "041M0AQ", "041M0AS") | inlist(i10_pr`num', "041M0JL", "041M0JM", "041M0JP", "0
> 41M0JQ", "041M0JS") | inlist(i10_pr`num', "041M0KL", "041M0KM", "041M0KP", "041M0KQ", "041M0KS") | inlis
> t(i10_pr`num', "041M0ZL", "041M0ZM", "041M0ZP", "041M0ZQ", "041M0ZS") | inlist(i10_pr`num', "041M49L", "
> 041M49M", "041M49P", "041M49Q", "041M49S") | inlist(i10_pr`num', "041M4AL", "041M4AM", "041M4AP", "041M4
> AQ", "041M4AS") | inlist(i10_pr`num', "041M4JL", "041M4JM", "041M4JP", "041M4JQ", "041M4JS") | inlist(i1
> 0_pr`num', "041M4KL", "041M4KM", "041M4KP", "041M4KQ", "041M4KS") | inlist(i10_pr`num', "041M4ZL", "041M
> 4ZM", "041M4ZP", "041M4ZQ", "041M4ZS") | inlist(i10_pr`num', "041N09L", "041N09M", "041N09P", "041N09Q",
>  "041N09S") | inlist(i10_pr`num', "041N0AL", "041N0AM", "041N0AP", "041N0AQ", "041N0AS") | inlist(i10_pr
> `num', "041N0JL", "041N0JM", "041N0JP", "041N0JQ", "041N0JS") | inlist(i10_pr`num', "041N0KL", "041N0KM"
> , "041N0KP", "041N0KQ", "041N0KS") | inlist(i10_pr`num', "041N0ZL", "041N0ZM", "041N0ZP", "041N0ZQ", "04
> 1N0ZS") | inlist(i10_pr`num', "041N49L", "041N49M", "041N49P", "041N49Q", "041N49S") | inlist(i10_pr`num
> ', "041N4AL", "041N4AM", "041N4AP", "041N4AQ", "041N4AS") | inlist(i10_pr`num', "041N4JL", "041N4JM", "0
> 41N4JP", "041N4JQ", "041N4JS") | inlist(i10_pr`num', "041N4KL", "041N4KM", "041N4KP", "041N4KQ", "041N4K
> S") | inlist(i10_pr`num', "041N4ZL", "041N4ZM", "041N4ZP", "041N4ZQ", "041N4ZS") | inlist(i10_pr`num', "
> 04RK07Z", "04RK0JZ", "04RK0KZ", "04RK47Z", "04RK4JZ") | inlist(i10_pr`num', "04RK4KZ", "04RL07Z", "04RL0
> JZ", "04RL0KZ", "04RL47Z") | inlist(i10_pr`num', "04RL4JZ", "04RL4KZ", "04RM07Z", "04RM0JZ", "04RM0KZ") 
> | inlist(i10_pr`num', "04RM47Z", "04RM4JZ", "04RM4KZ", "04RN07Z", "04RN0JZ") | inlist(i10_pr`num', "04RN
> 0KZ", "04RN47Z", "04RN4JZ", "04RN4KZ", "04RP07Z") | inlist(i10_pr`num', "04RP0JZ", "04RP0KZ", "04RP47Z",
>  "04RP4JZ", "04RP4KZ") | inlist(i10_pr`num', "04RQ07Z", "04RQ0JZ", "04RQ0KZ", "04RQ47Z", "04RQ4JZ") | in
> list(i10_pr`num', "04RQ4KZ", "04RR07Z", "04RR0JZ", "04RR0KZ", "04RR47Z") | inlist(i10_pr`num', "04RR4JZ"
> , "04RR4KZ", "04RS07Z", "04RS0JZ", "04RS0KZ") | inlist(i10_pr`num', "04RS47Z", "04RS4JZ", "04RS4KZ", "04
> RT07Z", "04RT0JZ") | inlist(i10_pr`num', "04RT0KZ", "04RT47Z", "04RT4JZ", "04RT4KZ", "04RU07Z") | inlist
> (i10_pr`num', "04RU0JZ", "04RU0KZ", "04RU47Z", "04RU4JZ", "04RU4KZ") | inlist(i10_pr`num', "04RV07Z", "0
> 4RV0JZ", "04RV0KZ", "04RV47Z", "04RV4JZ") | inlist(i10_pr`num', "04RV4KZ", "04RW07Z", "04RW0JZ", "04RW0K
> Z", "04RW47Z") | inlist(i10_pr`num', "04RW4JZ", "04RW4KZ", "04RY07Z", "04RY0JZ", "04RY0KZ") | inlist(i10
> _pr`num', "04RY47Z", "04RY4JZ", "04RY4KZ","041P0JQ", "041P0JS") | inlist(i10_pr`num', "041P3JQ", "041P3J
> S", "041P4JQ", "041P4JS", "041W09P") | inlist(i10_pr`num', "041W09Q", "041W09S", "041W0AP", "041W0AQ", "
> 041W0AS") | inlist(i10_pr`num', "041W0JP", "041W0JQ", "041W0JS", "041W0KP", "041W0KQ") | inlist(i10_pr`n
> um', "041W0KS", "041W0ZP", "041W0ZQ", "041W0ZS", "041W3JQ") | inlist(i10_pr`num', "041W3JS", "041W49P", 
> "041W49Q", "041W49S", "041W4AP") | inlist(i10_pr`num', "041W4AQ", "041W4AS", "041W4JP", "041W4JQ", "041W
> 4JS") | inlist(i10_pr`num', "041W4KP", "041W4KQ", "041W4KS", "041W4ZP", "041W4ZQ") | inlist(i10_pr`num',
>  "041W4ZS", "041V09P", "041V09Q", "041V09S", "041V0AP") | inlist(i10_pr`num', "041V0AQ", "041V0AS", "041
> V0JP", "041V0JQ", "041V0JS") | inlist(i10_pr`num', "041V0KP", "041V0KQ", "041V0KS", "041V0ZP", "041V0ZQ"
> ) | inlist(i10_pr`num', "041V0ZS", "041V3JQ", "041V3JS", "041V49P", "041V49Q") | inlist(i10_pr`num', "04
> 1V49S", "041V4AP", "041V4AQ", "041V4AS", "041V4JP") | inlist(i10_pr`num', "041V4JQ", "041V4JS", "041V4KP
> ", "041V4KQ", "041V4KS") | inlist(i10_pr`num', "041V4ZP", "041V4ZQ", "041V4ZS", "041U09P", "041U09Q") | 
> inlist(i10_pr`num', "041U09S", "041U0AP", "041U0AQ", "041U0AS", "041U0JP") | inlist(i10_pr`num', "041U0J
> Q", "041U0JS", "041U0KP", "041U0KQ", "041U0KS") | inlist(i10_pr`num', "041U0ZP", "041U0ZQ", "041U0ZS", "
> 041U3JQ", "041U3JS") | inlist(i10_pr`num', "041U49P", "041U49Q", "041U49S", "041U4AP", "041U4AQ") | inli
> st(i10_pr`num', "041U4AS", "041U4JP", "041U4JQ", "041U4JS", "041U4KP") | inlist(i10_pr`num', "041U4KQ", 
> "041U4KS", "041U4ZP", "041U4ZQ", "041U4ZS") | inlist(i10_pr`num', "041T09P", "041T09Q", "041T09S", "041T
> 0AP", "041T0AQ") | inlist(i10_pr`num', "041T0KQ", "041T0KS", "041T0ZP", "041T0ZQ", "041T0ZS") | inlist(i
> 10_pr`num', "041T3JQ", "041T3JS", "041T49P", "041T49Q", "041T49S") | inlist(i10_pr`num', "041T4AP", "041
> T4AQ", "041T4AS", "041T4JP", "041T4JQ") | inlist(i10_pr`num', "041T4JS", "041T4KP", "041T4KQ", "041T4KS"
> , "041T4ZP") | inlist(i10_pr`num', "041T4ZQ", "041T4ZS", "041S0JQ", "041S0JS", "041S3JQ") | inlist(i10_p
> r`num', "041S3JS", "041S4JQ", "041S4JS", "041R0JQ", "041R0JS") | inlist(i10_pr`num', "041R3JQ", "041R3JS
> ", "041R4JQ", "041R4JS", "041Q0JQ") | inlist(i10_pr`num', "041Q0JS", "041Q3JQ", "041Q3JS", "041Q4JQ", "0
> 41Q4JS")
  3. }
(73 real changes made)
(42 real changes made)
(23 real changes made)
(12 real changes made)
(9 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. gen byinf = 0 

. foreach num of numlist 1/25 {
  2. replace byinf = 1 if inlist(i10_pr`num', "041H099", "041H09B", "041H09C", "041H09D", "041H09F") | inl
> ist(i10_pr`num', "041H09G", "041H0A9", "041H09B", "041H09C", "041H0AD") | inlist(i10_pr`num', "041H09H",
>  "041H09J", "041H09K", "041H09P", "041H09Q") | inlist(i10_pr`num', "041H0AF", "041H0AG", "041H0AH", "041
> H0AJ", "041H0AK") | inlist(i10_pr`num', "041H0AP", "041H0AQ", "041H0J9", "041H0JB", "041H0JC") | inlist(
> i10_pr`num', "041H0JD", "041H0JF", "041H0JG", "041H0JH", "041H0JJ") | inlist(i10_pr`num', "041H0JK", "04
> 1H0JP", "041H0JQ", "041H0K9", "041H0KB") | inlist(i10_pr`num', "041H0KC", "041H0KD", "041H0KF", "041H0KG
> ", "041H0KH") | inlist(i10_pr`num', "041H0KJ", "041H0KK", "041H0KP", "041H0KQ", "041H0Z9") | inlist(i10_
> pr`num', "041H0ZB", "041H0ZC", "041H0ZD", "041H0ZF", "041H0ZG") | inlist(i10_pr`num', "041H0ZH", "041H0Z
> J", "041H0ZK", "041H0ZP", "041H0ZQ") | inlist(i10_pr`num', "041H499", "041H49B", "041H49C", "041H49D", "
> 041H49F") | inlist(i10_pr`num', "041H49G", "041H49H", "041H49J", "041H49K", "041H49P") | inlist(i10_pr`n
> um', "041H49Q", "041H4A9", "041H4AB", "041H4AC", "041H4AD") | inlist(i10_pr`num', "041H4AF", "041H4AG", 
> "041H4AH", "041H4AJ", "041H4AK") | inlist(i10_pr`num', "041H4AP", "041H4AQ", "041H4J9", "041H4JB", "041H
> 4JC") | inlist(i10_pr`num', "041H4JD", "041H4JF", "041H4JG", "041H4JH", "041H4JJ") | inlist(i10_pr`num',
>  "041H4JK", "041H4JP", "041H4JQ", "041H4K9", "041H4KB") | inlist(i10_pr`num', "041H4KC", "041H4KD", "041
> H4KF", "041H4KG", "041H4KH") | inlist(i10_pr`num', "041H4KJ", "041H4KK", "041H4KP", "041H4KQ", "041H4Z9"
> ) | inlist(i10_pr`num', "041H4ZB", "041H4ZC", "041H4ZD", "041H4ZF", "041H4ZG") | inlist(i10_pr`num', "04
> 1H4ZH", "041H4ZJ", "041H4ZK", "041H4ZP", "041H4ZQ") | inlist(i10_pr`num', "041J099", "041J09B", "041J09C
> ", "041J09F", "041J09J") | inlist(i10_pr`num', "041J09P", "041J09Q", "041J0A9", "041J0AB", "041J0AC") | 
> inlist(i10_pr`num', "041J0AF", "041J0AJ", "041J0AP", "041J0AQ", "041J0J9") | inlist(i10_pr`num', "041J0J
> B", "041J0JC", "041J0JF", "041J0JJ", "041J0JP") | inlist(i10_pr`num', "041J0JQ", "041J0K9", "041J0KB", "
> 041J0KC", "041J0KF") | inlist(i10_pr`num', "041J0KJ", "041J0KP", "041J0KQ", "041J0Z9", "041J0ZB") | inli
> st(i10_pr`num', "041J0ZC", "041J0ZF", "041J0ZJ", "041J0ZP", "041J0ZQ") | inlist(i10_pr`num', "041J499", 
> "041J49B", "041J49C", "041J49F", "041J49J") | inlist(i10_pr`num', "041J49P", "041J49Q", "041J4A9", "041J
> 4AB", "041J4AC") | inlist(i10_pr`num', "041J4AF", "041J4AJ", "041J4AP", "041J4AQ", "041J4J9") | inlist(i
> 10_pr`num', "041J4JB", "041J4JC", "041J4JF", "041J4JJ", "041J4JP") | inlist(i10_pr`num', "041J4JQ", "041
> J094K9", "041J4KB", "041J4KC", "041J4KF") | inlist(i10_pr`num', "041J4KJ", "041J4KP", "041J4KQ", "041J4Z
> 9", "041J4ZB") | inlist(i10_pr`num', "041J4ZC", "041J4ZF", "041J4ZJ", "041J4ZP", "041J4ZQ") | inlist(i10
> _pr`num', "041J09D", "041J09G", "041J09H", "041J09K", "041J0AD") | inlist(i10_pr`num', "041J0AG", "041J0
> AH", "041J0AK", "041J0JD", "041J0JG") | inlist(i10_pr`num', "041J0JH", "041J0JK", "041J0KD", "041J0KG", 
> "041J0KH") | inlist(i10_pr`num', "041J0KK", "041J0ZD", "041J0ZG", "041J0ZH", "041J0ZK") | inlist(i10_pr`
> num', "041J49D", "041J49G", "041J49H", "041J49K", "041J4AD") | inlist(i10_pr`num', "041J4AG", "041J4AH",
>  "041J4AK", "041J4JD", "041J4JG") | inlist(i10_pr`num', "041J4JH", "041J4JK", "041J4KD", "041J4KG", "041
> J4KH") | inlist(i10_pr`num', "041J4KK", "041J4ZD", "041J4ZG", "041J4ZH", "041J4ZK") | inlist(i10_pr`num'
> , "0315096", "0315097", "0315098", "0315099", "0316096") | inlist(i10_pr`num', "0316097", "0316098", "03
> 16099", "0410096", "0410097") | inlist(i10_pr`num', "0410098", "0410099", "0410496", "0410497", "0410498
> ") | inlist(i10_pr`num', "0410499", "041E099", "031509B", "031509C", "03150A6") | inlist(i10_pr`num', "0
> 3150A7", "03150A8", "03150A9", "03150AB", "03150AC") | inlist(i10_pr`num', "03150J6", "03150J7", "03150J
> 8", "03150J9", "03150JB") | inlist(i10_pr`num', "03150JC", "03150K6", "03150K7", "03150K8", "03150K9") |
>  inlist(i10_pr`num', "03150KB", "03150KC", "03150Z6", "03150Z7", "03150Z8") | inlist(i10_pr`num', "03150
> Z9", "03150ZB", "03150ZC", "031609B", "031609C") | inlist(i10_pr`num', "03160A6", "03160A7", "03160A8", 
> "03160A9", "03160AB") | inlist(i10_pr`num', "03160AC", "03160J6", "03160J7", "03160J8", "03160J9") | inl
> ist(i10_pr`num', "03160JB", "03160JC", "03160Z6", "03160Z7", "03160Z8") | inlist(i10_pr`num', "03160Z9",
>  "03160ZB", "03160ZC", "041009B", "041009C") | inlist(i10_pr`num', "041009D", "041009F", "041009G", "041
> 009H", "041009J") | inlist(i10_pr`num', "041009K", "041009Q", "041009R", "04100A6", "04100A7") | inlist(
> i10_pr`num', "04100A8", "04100A9", "04100AB", "04100AC", "04100AD") | inlist(i10_pr`num', "04100AF", "04
> 100AG", "04100AH", "04100AJ", "04100AK") | inlist(i10_pr`num', "04100AQ", "04100AR", "04100J6", "04100J7
> ", "04100J8") | inlist(i10_pr`num', "04100J9", "04100JB", "04100JC", "04100JD", "04100JF") | inlist(i10_
> pr`num', "04100JG", "04100JH", "04100JJ", "04100JK", "04100JQ") | inlist(i10_pr`num', "04100JR", "04100K
> 6", "04100K7", "04100K8", "04100K9") | inlist(i10_pr`num', "04100KB", "04100KC", "04100KD", "04100KF", "
> 04100KG") | inlist(i10_pr`num', "04100KH", "04100KJ", "04100KK", "04100KQ", "04100KR") | inlist(i10_pr`n
> um', "04100Z6", "04100Z7", "04100Z8", "04100Z9", "04100ZB") | inlist(i10_pr`num', "04100ZC", "04100ZD", 
> "04100ZF", "04100ZG", "04100ZH") | inlist(i10_pr`num', "04100ZJ", "04100ZK", "04100ZQ", "04100ZR", "0410
> 49B") | inlist(i10_pr`num', "041049C", "041049D", "041049F", "041049G", "041049H") | inlist(i10_pr`num',
>  "041049J", "041049K", "041049Q", "041049R", "04104A6") | inlist(i10_pr`num', "04104A7", "04104A8", "041
> 04A9", "04104AB", "04104AC") | inlist(i10_pr`num', "04104AD", "04104AF", "04104AG", "04104AH", "04104AJ"
> ) | inlist(i10_pr`num', "04104AK", "04104AQ", "04104AR", "04104J6", "04104J7") | inlist(i10_pr`num', "04
> 104J8", "04104J9", "04104JB", "04104JC", "04104JD")
  3. }
(43 real changes made)
(15 real changes made)
(7 real changes made)
(5 real changes made)
(1 real change made)
(2 real changes made)
(3 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *cont byinf
. foreach num of numlist 1/25 {
  2. replace byinf = 1 if inlist(i10_pr`num', "04104JF", "04104JG", "04104JH", "04104JJ", "04104JK") | inl
> ist(i10_pr`num', "04104JQ", "04104JR", "04104K6", "04104K7", "04104K8") | inlist(i10_pr`num', "04104K9",
>  "04104KB", "04104KC", "04104KD", "04104KF") | inlist(i10_pr`num', "04104ZB", "04104ZC", "04104ZD", "041
> 04ZF", "04104ZG") | inlist(i10_pr`num', "04104ZH", "04104ZJ", "04104ZK", "04104ZQ", "04104ZR") | inlist(
> i10_pr`num', "041C096", "041C097", "041C098", "041C099", "041C09B") | inlist(i10_pr`num', "041C09C", "04
> 1C09D", "041C09F", "041C09G", "041C09H") | inlist(i10_pr`num', "041C09J", "041C09K", "041C09Q", "041C09R
> ", "041C0A6") | inlist(i10_pr`num', "041C0A7", "041C0A8", "041C0A9", "041C0AB", "041C0AC") | inlist(i10_
> pr`num', "041C0AD", "041C0AF", "041C0AG", "041C0AH", "041C0AJ") | inlist(i10_pr`num', "041C0AK", "041C0A
> Q", "041C0AR", "041C0J6", "041C0J7") | inlist(i10_pr`num', "041C0J8", "041C0J9", "041C0JB", "041C0JC", "
> 041C0JD") | inlist(i10_pr`num', "041C0JF", "041C0JG", "041C0JH", "041C0JJ", "041C0JK") | inlist(i10_pr`n
> um', "041C0JQ", "041C0JR", "041C0K6", "041C0K7", "041C0K8") | inlist(i10_pr`num', "041C0K9", "041C0KB", 
> "041C0KC", "041C0KD", "041C0KF") | inlist(i10_pr`num', "041C0KG", "041C0KH", "041C0KJ", "041C0KK", "041C
> 0KQ") | inlist(i10_pr`num', "041C0KR", "041C0Z6", "041C0Z7", "041C0Z8", "041C0Z9") | inlist(i10_pr`num',
>  "041C0ZB", "041C0ZC", "041C0ZD", "041C0ZF", "041C0ZG") | inlist(i10_pr`num', "041C0ZH", "041C0ZJ", "041
> C0ZK", "041C0ZQ", "041C0ZR") | inlist(i10_pr`num', "041C496", "041C497", "041C498", "041C499", "041C49B"
> ) | inlist(i10_pr`num', "041C49C", "041C49D", "041C49F", "041C49G", "041C49H") | inlist(i10_pr`num', "04
> 1C49J", "041C49K", "041C49Q", "041C49R", "041C4A6") | inlist(i10_pr`num', "041C4A7", "041C4A8", "041C4A9
> ", "041C4AB", "041C4AC") | inlist(i10_pr`num', "041C4AD", "041C4AF", "041C4AG", "041C4AH", "041C4AJ") | 
> inlist(i10_pr`num', "041C4AK", "041C4AQ", "041C4AR", "041C4J6", "041C4J7") | inlist(i10_pr`num', "041C4J
> 8", "041C4J9", "041C4JB", "041C4JC", "041C4JD") | inlist(i10_pr`num', "041C4JF", "041C4JG", "041C4JH", "
> 041C4JJ", "041C4JK") | inlist(i10_pr`num', "041C4JQ", "041C4JR", "041C4K6", "041C4K7", "041C4K8") | inli
> st(i10_pr`num', "041C4K9", "041C4KB", "041C4KC", "041C4KD", "041C4KF") | inlist(i10_pr`num', "041C4KG", 
> "041C4KH", "041C4KJ", "041C4KK", "041C4KQ") | inlist(i10_pr`num', "041C4KR", "041C4Z6", "041C4Z7", "041C
> 4Z8", "041C4Z9") | inlist(i10_pr`num', "041C4ZB", "041C4ZC", "041C4ZD", "041C4ZF", "041C4ZG") | inlist(i
> 10_pr`num', "041C4ZH", "041C4ZJ", "041C4ZK", "041C4ZQ", "041C4ZR") | inlist(i10_pr`num', "041D096", "041
> D097", "041D098", "041D099", "041D09B") | inlist(i10_pr`num', "041D09C", "041D09D", "041D09F", "041D09G"
> , "041D09H") | inlist(i10_pr`num', "041D09J", "041D09K", "041D09Q", "041D09R", "041D0A6") | inlist(i10_p
> r`num', "041D0A7", "041D0A8", "041D0A9", "041D0AB", "041D0AC") | inlist(i10_pr`num', "041D0AD", "041D0AF
> ", "041D0AG", "041D0AH", "041D0AJ") | inlist(i10_pr`num', "041D0AK", "041D0AQ", "041D0AR", "041D0J6", "0
> 41D0J7") | inlist(i10_pr`num', "041D0J8", "041D0J9", "041D0JB", "041D0JC", "041D0JD") | inlist(i10_pr`nu
> m', "041D0JF", "041D0JG", "041D0JH", "041D0JJ", "041D0JK") | inlist(i10_pr`num', "041D0JQ", "041D0JR", "
> 041D0K6", "041D0K7", "041D0K8") | inlist(i10_pr`num', "041D0K9", "041D0KB", "041D0KC", "041D0KD", "041D0
> KF") | inlist(i10_pr`num', "041D0KG", "041D0KH", "041D0KJ", "041D0KK", "041D0KQ") | inlist(i10_pr`num', 
> "041D0KR", "041D0Z6", "041D0Z7", "041D0Z8", "041D0Z9") | inlist(i10_pr`num', "041D0ZB", "041D0ZC", "041D
> 0ZD", "041D0ZF", "041D0ZG") | inlist(i10_pr`num', "041D0ZH", "041D0ZJ", "041D0ZK", "041D0ZQ", "041D0ZR")
>  | inlist(i10_pr`num', "041D496", "041D497", "041D498", "041D499", "041D49B") | inlist(i10_pr`num', "041
> D49C", "041D49D", "041D49F", "041D49G", "041D49H") | inlist(i10_pr`num', "04104AD", "04104AF", "04104AG"
> , "04104AH", "04104AJ") | inlist(i10_pr`num', "041D49J", "041D49K", "041D49Q", "041D49R", "041D4A6") | i
> nlist(i10_pr`num', "041D4A7", "041D4A8", "041D4A9", "041D4AB", "041D4AC") | inlist(i10_pr`num', "041D4AD
> ", "041D4AF", "041D4AG", "041D4AH", "041D4AJ") | inlist(i10_pr`num', "041D4AK", "041D4AQ", "041D4AR", "0
> 41D4J6", "041D4J7") | inlist(i10_pr`num', "041D4J8", "041D4J9", "041D4JB", "041D4JC", "041D4JD") | inlis
> t(i10_pr`num', "041D4JF", "041D4JG", "041D4JH", "041D4JJ", "041D4JK") | inlist(i10_pr`num', "041D4JQ", "
> 041D4JR", "041D4K6", "041D4K7", "041D4K8")
  3. }
(2 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *cont byinf
. foreach num of numlist 1/25 {
  2. replace byinf = 1 if inlist(i10_pr`num', "041D4K9", "041D4KB", "041D4KC", "041D4KD", "041D4KF") | inl
> ist(i10_pr`num', "041D4KG", "041D4KH", "041D4KJ", "041D4KK", "041D4KQ") | inlist(i10_pr`num', "041D4KR",
>  "041D4Z6", "041D4Z7", "041D4Z8", "041D4Z9") | inlist(i10_pr`num', "041D4ZB", "041D4ZC", "041D4ZD", "041
> D4ZF", "041D4ZG") | inlist(i10_pr`num', "041D4ZH", "041D4ZJ", "041D4ZK", "041D4ZQ", "041D4ZR") | inlist(
> i10_pr`num', "041E09B", "041E09C", "041E09D", "041E09F", "041E09G") | inlist(i10_pr`num', "041E09H", "04
> 1E09J", "041E09K", "041E09P", "041E09Q") | inlist(i10_pr`num', "041E0A9", "041E0AB", "041E0AC", "041E0AD
> ", "041E0AF") | inlist(i10_pr`num', "041E0AG", "041E0AH", "041E0AJ", "041E0AK", "041E0AP") | inlist(i10_
> pr`num', "041E0AQ", "041E0J9", "041E0JB", "041E0JC", "041E0JD") | inlist(i10_pr`num', "041E0JF", "041E0J
> G", "041E0JH", "041E0JJ", "041E0JK") | inlist(i10_pr`num', "041E0JP", "041E0JQ", "041E0K9", "041E0KB", "
> 041E0KC") | inlist(i10_pr`num', "041E0KD", "041E0KF", "041E0KG", "041E0KH", "041E0KJ") | inlist(i10_pr`n
> um', "041E0KK", "041E0KP", "041E0KQ", "041E0Z9", "041E0ZB") | inlist(i10_pr`num', "041E0ZC", "041E0ZD", 
> "041E0ZF", "041E0ZG", "041E0ZH") | inlist(i10_pr`num', "041E0ZJ", "041E0ZK", "041E0ZP", "041E0ZQ", "041E
> 499") | inlist(i10_pr`num', "041E49B", "041E49C", "041E49D", "041E49F", "041E49G") | inlist(i10_pr`num',
>  "041E49H", "041E49J", "041E49K", "041E49P", "041E49Q") | inlist(i10_pr`num', "041E4A9", "041E4AB", "041
> E4AC", "041E4AD", "041E4AF") | inlist(i10_pr`num', "041E4AG", "041E4AH", "041E4AJ", "041E4AK", "041E4AP"
> ) | inlist(i10_pr`num', "041E4AQ", "041E4J9", "041E4JB", "041E4JC", "041E4JD") | inlist(i10_pr`num', "04
> 1E4JF", "041E4JG", "041E4JH", "041E4JJ", "041E4JK") | inlist(i10_pr`num', "041E4JP", "041E4JQ", "041E4K9
> ", "041E4KB", "041E4KC") | inlist(i10_pr`num', "041E4KD", "041E4KF", "041E4KG", "041E4KH", "041E4KJ") | 
> inlist(i10_pr`num', "041E4KK", "041E4KP", "041E4KQ", "041E4Z9", "041E4ZB") | inlist(i10_pr`num', "041E4Z
> C", "041E4ZD", "041E4ZF", "041E4ZG", "041E4ZH") | inlist(i10_pr`num', "041E4ZJ", "041E4ZK", "041E4ZP", "
> 041E4ZQ", "041F099") | inlist(i10_pr`num', "041F09B", "041F09C", "041F09D", "041F09F", "041F09G") | inli
> st(i10_pr`num', "041F09H", "041F09J", "041F09K", "041F09P", "041F09Q") | inlist(i10_pr`num', "041F0A9", 
> "041F0AB", "041F0AC", "041F0AD", "041F0AF") | inlist(i10_pr`num', "041F0AG", "041F0AH", "041F0AJ", "041F
> 0AK", "041F0AP") | inlist(i10_pr`num', "041F0AQ", "041F0J9", "041F0JB", "041F0JC", "041F0JD") | inlist(i
> 10_pr`num', "041F0JF", "041F0JG", "041F0JH", "041F0JJ", "041F0JK") | inlist(i10_pr`num', "041F0JP", "041
> F0JQ", "041F0K9", "041F0KB", "041F0KC") | inlist(i10_pr`num', "041F0KD", "041F0KF", "041F0KG", "041F0KH"
> , "041F0KJ") | inlist(i10_pr`num', "041F0KK", "041F0KP", "041F0KQ", "041F0Z9", "041F0ZB") | inlist(i10_p
> r`num', "041F0ZC", "041F0ZD", "041F0ZF", "041F0ZG", "041F0ZH") | inlist(i10_pr`num', "041F0ZJ", "041F0ZK
> ", "041F0ZP", "041F0ZQ", "041F499") | inlist(i10_pr`num', "041F49B", "041F49C", "041F49D", "041F49F", "0
> 41F49G") | inlist(i10_pr`num', "041F49H", "041F49J", "041F49K", "041F49P", "041F49Q") | inlist(i10_pr`nu
> m', "041F4A9", "041F4AB", "041F4AC", "041F4AD", "041F4AF") | inlist(i10_pr`num', "041F4AG", "041F4AH", "
> 041F4AJ", "041F4AK", "041F4AP") | inlist(i10_pr`num', "041F4AQ", "041F4J9", "041F4JB", "041F4JC", "041F4
> JD") | inlist(i10_pr`num', "041F4JF", "041F4JG", "041F4JH", "041F4JJ", "041F4JK") | inlist(i10_pr`num', 
> "041F4JP", "041F4JQ", "041F4K9", "041F4KB", "041F4KC") | inlist(i10_pr`num', "041F4KD", "041F4KF", "041F
> 4KG", "041F4KH", "041F4KJ") | inlist(i10_pr`num', "041F4KK", "041F4KP", "041F4KQ", "041F4Z9", "041F4ZB")
>  | inlist(i10_pr`num', "041F4ZJ", "041F4ZK", "041F4ZP", "041F4ZQ")
  3. }
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *Endovascular Suprainguinal + Infrainguinal Revascularization
. gen endosup = 0 

. foreach num of numlist 1/25 {
  2. replace endosup = 1 if inlist(i10_pr`num', "047C041", "047C04Z", "047C05Z", "047C06Z", "047C07Z") | i
> nlist(i10_pr`num', "047C0D1") | inlist(i10_pr`num', "047C0DZ", "047C0EZ", "047C0FZ") | inlist(i10_pr`num
> ', "047C0GZ", "047C0Z1", "047C0ZZ", "047C341", "047C34Z") | inlist(i10_pr`num', "047C35Z", "047C36Z", "0
> 47C37Z", "047C3D1", "047C3DZ") | inlist(i10_pr`num', "047C3EZ", "047C3FZ", "047C3GZ", "047C3Z1", "047C3Z
> Z") | inlist(i10_pr`num', "047C441", "047C44Z", "047C45Z", "047C46Z", "047C47Z") | inlist(i10_pr`num', "
> 047C4D1", "047C4DZ", "047C4EZ", "047C4FZ", "047C4GZ") | inlist(i10_pr`num', "047C4Z1", "047C4ZZ", "047D0
> 41", "047D04Z", "047D05Z") | inlist(i10_pr`num', "047D06Z", "047D07Z", "047D0D1", "047D0DZ", "047D0EZ") 
> | inlist(i10_pr`num', "047D0FZ", "047D0GZ", "047D0Z1", "047D0ZZ", "047D341") | inlist(i10_pr`num', "047D
> 34Z", "047D35Z", "047D36Z", "047D37Z", "047D3D1") | inlist(i10_pr`num', "047D3DZ", "047D3EZ", "047D3FZ",
>  "047D3GZ", "047D3Z1") | inlist(i10_pr`num', "047D3ZZ", "047D441", "047D44Z", "047D45Z", "047D46Z") | in
> list(i10_pr`num', "047D47Z", "047D4D1", "047D4DZ", "047D4EZ", "047D4FZ") | inlist(i10_pr`num', "047D4GZ"
> , "047D4Z1", "047D4ZZ", "047E041", "047E04Z") | inlist(i10_pr`num', "047E05Z", "047E06Z", "047E07Z", "04
> 7E0D1", "047E0DZ") | inlist(i10_pr`num', "047E0EZ", "047E0FZ", "047E0GZ", "047E0Z1", "047E0ZZ") | inlist
> (i10_pr`num', "047E341", "047E34Z", "047E35Z", "047E36Z", "047E37Z") | inlist(i10_pr`num', "047E3D1", "0
> 47E3DZ", "047E3EZ", "047E3FZ", "047E3GZ") | inlist(i10_pr`num', "047E3Z1", "047E3ZZ", "047E441", "047E44
> Z", "047E45Z") | inlist(i10_pr`num', "047E46Z", "047E47Z", "047E4D1", "047E4DZ", "047E4EZ") | inlist(i10
> _pr`num', "047E4FZ", "047E4GZ", "047E4Z1", "047E4ZZ", "047F041") | inlist(i10_pr`num', "047F04Z", "047F0
> 5Z", "047F06Z", "047F07Z", "047F0D1") | inlist(i10_pr`num', "047F0DZ", "047F0EZ", "047F0FZ", "047F0GZ", 
> "047F0Z1") | inlist(i10_pr`num', "047F0ZZ", "047F341", "047F34Z", "047F35Z", "047F36Z") | inlist(i10_pr`
> num', "047F37Z", "047F3D1", "047F3DZ", "047F3EZ", "047F3FZ") | inlist(i10_pr`num', "047F3GZ", "047F3Z1",
>  "047F3ZZ", "047F441", "047F44Z") | inlist(i10_pr`num', "047F45Z", "047F46Z", "047F47Z", "047F4D1", "047
> F4DZ") | inlist(i10_pr`num', "047F4EZ", "047F4FZ", "047F4GZ", "047F4Z1", "047F4ZZ") | inlist(i10_pr`num'
> , "047H041", "047H04Z", "047H05Z", "047H06Z", "047H07Z") | inlist(i10_pr`num', "047H0D1", "047H0DZ", "04
> 7H0EZ", "047H0FZ", "047H0GZ") | inlist(i10_pr`num', "047H0Z1", "047H0ZZ", "047H341", "047H34Z", "047H35Z
> ") | inlist(i10_pr`num', "047H36Z", "047H37Z", "047H3D1", "047H3DZ", "047H3EZ") | inlist(i10_pr`num', "0
> 47H3FZ", "047H3GZ", "047H3Z1", "047H3ZZ", "047H441") | inlist(i10_pr`num', "047H44Z", "047H45Z", "047H46
> Z", "047H47Z", "047H4D1") | inlist(i10_pr`num', "047H4DZ", "047H4EZ", "047H4FZ", "047H4GZ", "047H4Z1") |
>  inlist(i10_pr`num', "047H4ZZ", "047J041", "047J04Z", "047J05Z", "047J06Z") | inlist(i10_pr`num', "047J0
> 7Z", "047J0D1", "047J0DZ", "047J0EZ", "047J0FZ") | inlist(i10_pr`num', "047J0GZ", "047J0Z1", "047J0ZZ", 
> "047J341", "047J34Z") | inlist(i10_pr`num', "047J35Z", "047J36Z", "047J37Z", "047J3D1", "047J3DZ") | inl
> ist(i10_pr`num', "047J3EZ", "047J3FZ", "047J3GZ", "047J3Z1", "047J3ZZ") | inlist(i10_pr`num', "047J441",
>  "047J44Z", "047J45Z", "047J46Z", "047J47Z") | inlist(i10_pr`num', "047J4D1", "047J4DZ", "047J4EZ", "047
> J4FZ", "047J4GZ") | inlist(i10_pr`num', "047J4Z1", "047J4ZZ")
  3. }
(52 real changes made)
(32 real changes made)
(24 real changes made)
(11 real changes made)
(8 real changes made)
(4 real changes made)
(6 real changes made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. gen endoinf = 0 

. foreach num of numlist 1/25 {
  2. replace endoinf = 1 if inlist(i10_pr`num', "047K041", "047K04Z", "047K05Z", "047K06Z", "047K07Z") | i
> nlist(i10_pr`num', "047K0D1") | inlist(i10_pr`num', "047K0DZ", "047K0EZ", "047K0FZ") | inlist(i10_pr`num
> ', "047K0GZ", "047K0Z1", "047K0ZZ", "047K341", "047K34Z") | inlist(i10_pr`num', "047K35Z", "047K36Z", "0
> 47K37Z", "047K3D1", "047K3DZ") | inlist(i10_pr`num', "047K3EZ", "047K3FZ", "047K3GZ", "047K3Z1", "047K3Z
> Z") | inlist(i10_pr`num', "047K441", "047K44Z", "047K45Z", "047K46Z", "047K47Z") | inlist(i10_pr`num', "
> 047K4D1", "047K4DZ", "047K4EZ", "047K4FZ", "047K4GZ") | inlist(i10_pr`num', "047K4Z1", "047K4ZZ", "047L0
> 41", "047L04Z", "047L05Z") | inlist(i10_pr`num', "047L06Z", "047L07Z", "047L0D1", "047L0DZ", "047L0EZ") 
> | inlist(i10_pr`num', "047L0FZ", "047L0GZ", "047L0Z1", "047L0ZZ", "047L341") | inlist(i10_pr`num', "047L
> 34Z", "047L35Z", "047L36Z", "047L37Z", "047L3D1") | inlist(i10_pr`num', "047L3DZ", "047L3EZ", "047L3FZ",
>  "047L3GZ", "047L3Z1") | inlist(i10_pr`num', "047L3ZZ", "047L441", "047L44Z", "047L45Z", "047L46Z") | in
> list(i10_pr`num', "047L47Z", "047L4D1", "047L4DZ", "047L4EZ", "047L4FZ") | inlist(i10_pr`num', "047L4GZ"
> , "047L4Z1", "047L4ZZ", "047M041", "047M04Z") | inlist(i10_pr`num', "047M05Z", "047M06Z", "047M07Z", "04
> 7M0D1", "047M0DZ") | inlist(i10_pr`num', "047M0EZ", "047M0FZ", "047M0GZ", "047M0Z1", "047M0ZZ") | inlist
> (i10_pr`num', "047M341", "047M34Z", "047M35Z", "047M36Z", "047M37Z") | inlist(i10_pr`num', "047M3D1", "0
> 47M3DZ", "047M3EZ", "047M3FZ", "047M3GZ") | inlist(i10_pr`num', "047M3Z1", "047M3ZZ", "047M441", "047M44
> Z", "047M45Z") | inlist(i10_pr`num', "047M46Z", "047M47Z", "047M4D1", "047M4DZ", "047M4EZ") | inlist(i10
> _pr`num', "047M4FZ", "047M4GZ", "047M4Z1", "047M4ZZ", "047N041") | inlist(i10_pr`num', "047N04Z", "047N0
> 5Z", "047N06Z", "047N07Z", "047N0D1") | inlist(i10_pr`num', "047N0DZ", "047N0EZ", "047N0FZ", "047N0GZ", 
> "047N0Z1") | inlist(i10_pr`num', "047N0ZZ", "047N341", "047N34Z", "047N35Z", "047N36Z") | inlist(i10_pr`
> num', "047N37Z", "047N3D1", "047N3DZ", "047N3EZ", "047N3FZ") | inlist(i10_pr`num', "047N3GZ", "047N3Z1",
>  "047N3ZZ", "047N441", "047N44Z") | inlist(i10_pr`num', "047N45Z", "047N46Z", "047N47Z", "047N4D1", "047
> N4DZ") | inlist(i10_pr`num', "047N4EZ", "047N4FZ", "047N4GZ", "047N4Z1", "047N4ZZ") | inlist(i10_pr`num'
> , "047P041", "047P04Z", "047P05Z", "047P06Z", "047P07Z") | inlist(i10_pr`num', "047P0D1", "047P0DZ", "04
> 7P0EZ", "047P0FZ", "047P0GZ") | inlist(i10_pr`num', "047P0Z1", "047P0ZZ", "047P341", "047P34Z", "047P35Z
> ") | inlist(i10_pr`num', "047P36Z", "047P37Z", "047P3D1", "047P3DZ", "047P3EZ") | inlist(i10_pr`num', "0
> 47P3FZ", "047P3GZ", "047P3Z1", "047P3ZZ", "047P441") | inlist(i10_pr`num', "047P44Z", "047P45Z", "047P46
> Z", "047P47Z", "047P4D1") | inlist(i10_pr`num', "047P4DZ", "047P4EZ", "047P4FZ", "047P4GZ", "047P4Z1") |
>  inlist(i10_pr`num', "047P4ZZ", "047Q041", "047Q04Z", "047Q05Z", "047Q06Z") | inlist(i10_pr`num', "047Q0
> 7Z", "047Q0D1", "047Q0DZ", "047Q0EZ", "047Q0FZ") | inlist(i10_pr`num', "047Q0GZ", "047Q0Z1", "047Q0ZZ", 
> "047Q341", "047Q34Z") | inlist(i10_pr`num', "047Q35Z", "047Q36Z", "047Q37Z", "047Q3D1", "047Q3DZ") | inl
> ist(i10_pr`num', "047Q3EZ", "047Q3FZ", "047Q3GZ", "047Q3Z1", "047Q3ZZ") | inlist(i10_pr`num', "047Q441",
>  "047Q44Z", "047Q45Z", "047Q46Z", "047Q47Z") | inlist(i10_pr`num', "047Q4D1", "047Q4DZ", "047Q4EZ", "047
> Q4FZ", "047Q4GZ") | inlist(i10_pr`num', "047Q4Z1", "047Q4ZZ") | inlist(i10_pr`num', "047R041", "047R04Z"
> , "047R05Z", "047R06Z", "047R07Z") | inlist(i10_pr`num', "047R0D1") | inlist(i10_pr`num', "047R0DZ", "04
> 7R0EZ", "047R0FZ") | inlist(i10_pr`num', "047R0GZ", "047R0Z1", "047R0ZZ", "047R341", "047R34Z") | inlist
> (i10_pr`num', "047R35Z", "047R36Z", "047R37Z", "047R3D1", "047R3DZ") | inlist(i10_pr`num', "047R3EZ", "0
> 47R3FZ", "047R3GZ", "047R3Z1", "047R3ZZ") | inlist(i10_pr`num', "047R441", "047R44Z", "047R45Z", "047R46
> Z", "047R47Z") | inlist(i10_pr`num', "047R4D1", "047R4DZ", "047R4EZ", "047R4FZ", "047R4GZ") | inlist(i10
> _pr`num', "047R4Z1", "047R4ZZ", "047S041", "047S04Z", "047S05Z") | inlist(i10_pr`num', "047S06Z", "047S0
> 7Z", "047S0D1", "047S0DZ", "047S0EZ") | inlist(i10_pr`num', "047S0FZ", "047S0GZ", "047S0Z1", "047S0ZZ", 
> "047S341") | inlist(i10_pr`num', "047S34Z", "047S35Z", "047S36Z", "047S37Z", "047S3D1") | inlist(i10_pr`
> num', "047S3DZ", "047S3EZ", "047S3FZ", "047S3GZ", "047S3Z1") | inlist(i10_pr`num', "047S3ZZ", "047S441",
>  "047S44Z", "047S45Z", "047S46Z") | inlist(i10_pr`num', "047S47Z", "047S4D1", "047S4DZ", "047S4EZ", "047
> S4FZ") | inlist(i10_pr`num', "047S4GZ", "047S4Z1", "047S4ZZ", "047T041", "047T04Z") | inlist(i10_pr`num'
> , "047T05Z", "047T06Z", "047T07Z", "047T0D1", "047T0DZ") | inlist(i10_pr`num', "047T0EZ", "047T0FZ", "04
> 7T0GZ", "047T0Z1", "047T0ZZ") | inlist(i10_pr`num', "047T341", "047T34Z", "047T35Z", "047T36Z", "047T37Z
> ") | inlist(i10_pr`num', "047T3D1", "047T3DZ", "047T3EZ", "047T3FZ", "047T3GZ") | inlist(i10_pr`num', "0
> 47T3Z1", "047T3ZZ", "047T441", "047T44Z", "047T45Z") | inlist(i10_pr`num', "047T46Z", "047T47Z", "047T4D
> 1", "047T4DZ", "047T4EZ") | inlist(i10_pr`num', "047T4FZ", "047T4GZ", "047T4Z1", "047T4ZZ", "047U041") |
>  inlist(i10_pr`num', "047U04Z", "047U05Z", "047U06Z", "047U07Z", "047U0D1") | inlist(i10_pr`num', "047U0
> DZ", "047U0EZ", "047U0FZ", "047U0GZ", "047U0Z1") | inlist(i10_pr`num', "047U0ZZ", "047U341", "047U34Z", 
> "047U35Z", "047U36Z") | inlist(i10_pr`num', "047U37Z", "047U3D1", "047U3DZ", "047U3EZ", "047U3FZ") | inl
> ist(i10_pr`num', "047U3GZ", "047U3Z1", "047U3ZZ", "047U441", "047U44Z") | inlist(i10_pr`num', "047U45Z",
>  "047U46Z", "047U47Z", "047U4D1", "047U4DZ") | inlist(i10_pr`num', "047U4EZ", "047U4FZ", "047U4GZ", "047
> U4Z1", "047U4ZZ") | inlist(i10_pr`num', "047V041", "047V04Z", "047V05Z", "047V06Z", "047V07Z") | inlist(
> i10_pr`num', "047V0D1", "047V0DZ", "047V0EZ", "047V0FZ", "047V0GZ") | inlist(i10_pr`num', "047V0Z1", "04
> 7V0ZZ", "047V341", "047V34Z", "047V35Z") | inlist(i10_pr`num', "047V36Z", "047V37Z", "047V3D1", "047V3DZ
> ", "047V3EZ") | inlist(i10_pr`num', "047V3FZ", "047V3GZ", "047V3Z1", "047V3ZZ", "047V441") | inlist(i10_
> pr`num', "047V44Z", "047V45Z", "047V46Z", "047V47Z", "047V4D1") | inlist(i10_pr`num', "047V4DZ", "047V4E
> Z", "047P4FZ", "047P4GZ", "047V4Z1") | inlist(i10_pr`num', "047V4ZZ", "047W041", "047W04Z", "047W05Z", "
> 047W06Z") | inlist(i10_pr`num', "047W07Z", "047W0D1", "047W0DZ", "047W0EZ", "047W0FZ") | inlist(i10_pr`n
> um', "047W0GZ", "047W0Z1", "047W0ZZ", "047W341", "047W34Z") | inlist(i10_pr`num', "047W35Z", "047W36Z", 
> "047W37Z", "047W3D1", "047W3DZ") | inlist(i10_pr`num', "047W3EZ", "047W3FZ", "047W3GZ", "047W3Z1", "047W
> 3ZZ") | inlist(i10_pr`num', "047W441", "047W44Z", "047W45Z", "047W46Z", "047W47Z") | inlist(i10_pr`num',
>  "047W4D1", "047W4DZ", "047W4EZ", "047W4FZ", "047W4GZ") | inlist(i10_pr`num', "047W4Z1", "047W4ZZ") | in
> list(i10_pr`num',  "047Y041", "047Y04Z") | inlist(i10_pr`num', "047Y0D1", "047Y0DZ") | inlist(i10_pr`num
> ', "047Y0Z1", "047Y0ZZ", "047Y341", "047Y34Z") | inlist(i10_pr`num', "047Y3D1", "047Y3DZ") | inlist(i10_
> pr`num', "047Y3Z1", "047Y3ZZ") | inlist(i10_pr`num', "047Y441", "047Y44Z") | inlist(i10_pr`num', "047Y4D
> 1", "047Y4DZ") | inlist(i10_pr`num', "047Y4Z1", "047Y4ZZ")
  3. }
(252 real changes made)
(197 real changes made)
(99 real changes made)
(72 real changes made)
(37 real changes made)
(25 real changes made)
(10 real changes made)
(4 real changes made)
(3 real changes made)
(5 real changes made)
(3 real changes made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *Femoral Endarterectomy
. gen fem = 0

. foreach num of numlist 1/25 {
  2. replace fem = 1 if inlist(i10_pr`num', "047K0ZZ", "04CLOZZ")
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *Making overall amputation variable
. foreach num of numlist 1/25 {
  2.         gen ampu_`num' = 0
  3.         replace ampu_`num' = 1 if inlist(i10_pr`num', "0Y620ZZ", "0Y630ZZ", "0Y640ZZ", "0Y670ZZ", "0Y
> 680ZZ") | inlist(i10_pr`num', "0Y6C0Z1", "0Y6C0Z2", "0Y6C0Z3", "0Y6D0Z1", "0Y6D0Z2") | inlist(i10_pr`num
> ', "Y6D0Z3", "0Y6F0ZZ", "0Y6G0ZZ", "0Y6H0Z1", "0Y6H0Z2") | inlist(i10_pr`num', "0Y6H0Z3", "0Y6J0Z1",  "0
> Y6J0Z2" , "0Y6J0Z3") | inlist(i10_pr`num', "0Y6M0Z0", "0Y6M0Z4" , "0Y6M0Z5", "0Y6M0Z6", "0Y6M0Z7", "0Y6M
> 0Z8") | inlist(i10_pr`num', "0Y6M0Z9", "0Y6M0ZB" , "0Y6M0ZC", "0Y6M0ZD", "0Y6M0ZF", "0Y6N0Z0") | inlist(
> i10_pr`num', "0Y6N0Z4", "0Y6N0Z5" , "0Y6N0Z6", "0Y6N0Z7", "0Y6N0Z8", "0Y6N0Z9")  | inlist(i10_pr`num', "
> 0Y6N0ZB", "0Y6N0ZC" , "0Y6N0ZD", "0Y6N0ZF")
  4. }
(2,059 real changes made)
(922 real changes made)
(552 real changes made)
(456 real changes made)
(402 real changes made)
(208 real changes made)
(125 real changes made)
(100 real changes made)
(68 real changes made)
(57 real changes made)
(29 real changes made)
(15 real changes made)
(8 real changes made)
(11 real changes made)
(8 real changes made)
(5 real changes made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(2 real changes made)
(0 real changes made)

. 
. foreach num of numlist 1/25 {
  2.         replace ampu_`num'= 0 if prday`num' > 2
  3. }
(1,132 real changes made)
(611 real changes made)
(357 real changes made)
(299 real changes made)
(265 real changes made)
(164 real changes made)
(103 real changes made)
(87 real changes made)
(55 real changes made)
(48 real changes made)
(26 real changes made)
(10 real changes made)
(5 real changes made)
(10 real changes made)
(8 real changes made)
(5 real changes made)
(6 real changes made)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)

. 
. gen amputot = 0

. foreach num of numlist 1/25 {
  2.         replace amputot= 1 if ampu_`num'==1
  3. }
(927 real changes made)
(116 real changes made)
(41 real changes made)
(15 real changes made)
(12 real changes made)
(5 real changes made)
(4 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)

. 
.    *Major/minor amputations
. foreach num of numlist 1/25 {
  2.         gen majamp_`num' = 0
  3.         gen minamp_`num' = 0
  4.         replace majamp_`num' = 1 if inlist(i10_pr`num', "0Y620ZZ", "0Y630ZZ", "0Y640ZZ", "0Y670ZZ", "
> 0Y680ZZ") | inlist(i10_pr`num', "0Y6C0Z1", "0Y6C0Z2", "0Y6C0Z3", "0Y6D0Z1", "0Y6D0Z2") | inlist(i10_pr`n
> um', "Y6D0Z3", "0Y6F0ZZ", "0Y6G0ZZ", "0Y6H0Z1", "0Y6H0Z2") | inlist(i10_pr`num', "0Y6H0Z3", "0Y6J0Z1",  
> "0Y6J0Z2" , "0Y6J0Z3")
  5.         replace minamp_`num' = 1 if inlist(i10_pr`num', "0Y6M0Z0", "0Y6M0Z4" , "0Y6M0Z5", "0Y6M0Z6", 
> "0Y6M0Z7", "0Y6M0Z8") | inlist(i10_pr`num', "0Y6M0Z9", "0Y6M0ZB" , "0Y6M0ZC", "0Y6M0ZD", "0Y6M0ZF", "0Y6
> N0Z0") | inlist(i10_pr`num', "0Y6N0Z4", "0Y6N0Z5" , "0Y6N0Z6", "0Y6N0Z7", "0Y6N0Z8", "0Y6N0Z9")  | inlis
> t(i10_pr`num', "0Y6N0ZB", "0Y6N0ZC" , "0Y6N0ZD", "0Y6N0ZF")
  6. }       
(1,227 real changes made)
(832 real changes made)
(403 real changes made)
(519 real changes made)
(142 real changes made)
(410 real changes made)
(82 real changes made)
(374 real changes made)
(52 real changes made)
(350 real changes made)
(27 real changes made)
(181 real changes made)
(26 real changes made)
(99 real changes made)
(19 real changes made)
(81 real changes made)
(11 real changes made)
(57 real changes made)
(11 real changes made)
(46 real changes made)
(8 real changes made)
(21 real changes made)
(2 real changes made)
(13 real changes made)
(2 real changes made)
(6 real changes made)
(6 real changes made)
(5 real changes made)
(1 real change made)
(7 real changes made)
(2 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. foreach num of numlist 1/25 {
  2.         replace majamp_`num'= 0 if prday`num' > 2
  3.         replace minamp_`num'= 0 if prday`num' > 2
  4. }
(740 real changes made)
(392 real changes made)
(324 real changes made)
(287 real changes made)
(117 real changes made)
(240 real changes made)
(72 real changes made)
(227 real changes made)
(47 real changes made)
(218 real changes made)
(22 real changes made)
(142 real changes made)
(23 real changes made)
(80 real changes made)
(18 real changes made)
(69 real changes made)
(9 real changes made)
(46 real changes made)
(11 real changes made)
(37 real changes made)
(8 real changes made)
(18 real changes made)
(0 real changes made)
(10 real changes made)
(2 real changes made)
(3 real changes made)
(5 real changes made)
(5 real changes made)
(1 real change made)
(7 real changes made)
(2 real changes made)
(3 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(3 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. 
. gen majamptot = 0

. gen minamptot = 0

. foreach num of numlist 1/25 {
  2.         replace majamptot= 1 if majamp_`num'==1
  3.         replace minamptot= 1 if minamp_`num'==1
  4. }
(487 real changes made)
(440 real changes made)
(52 real changes made)
(74 real changes made)
(19 real changes made)
(23 real changes made)
(7 real changes made)
(11 real changes made)
(5 real changes made)
(8 real changes made)
(5 real changes made)
(3 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. foreach var of varlist majamptot minamptot amputot bysup byinf endosup endoinf fem {
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
majamptot |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1943605.0679784622     8755.0082979000  1952360.0762763622
        1 |    2564.9986304000      350.0011893000     2914.9998197000
          | 
    Total | 1946170.0666088623     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 1677.9377
    Design-based  F(1, 3987)      = 1553.7000     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
minamptot |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1943605.0666707656     8860.0087751000  1952465.0754458657
        1 |    2564.9999381000      245.0007121000     2810.0006502000
          | 
    Total | 1946170.0666088657     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  827.1084
    Design-based  F(1, 3987)      =  848.7198     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
  amputot |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1941120.0675151979     8520.0075723000  1949640.0750874979
        1 |    5049.9990937000      585.0019149000     5635.0010086000
          | 
    Total | 1946170.0666088976     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 2397.7134
    Design-based  F(1, 3987)      = 2253.7010     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    bysup |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945560.0657658370     8850.0093083000  1954410.0750741372
        1 |     610.0008430000      255.0001789000      865.0010219000
          | 
    Total | 1946170.0666088369     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 3143.4839
    Design-based  F(1, 3987)      = 3404.7225     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
    byinf |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945795.0669073367     9045.0094503000  1954840.0763576368
        1 |     374.9997015000       60.0000369000      434.9997384000
          | 
    Total | 1946170.0666088369     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  333.4761
    Design-based  F(1, 3987)      =  327.3120     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
  endosup |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945660.0672035385     8885.0091732000  1954545.0763767385
        1 |     509.9994053000      220.0003140000      729.9997193000
          | 
    Total | 1946170.0666088385     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         = 2774.2448
    Design-based  F(1, 3987)      = 2448.3272     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
  endoinf |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1943655.0631729630     8040.0069585000  1951695.0701314630
        1 |    2515.0034359000     1065.0025287000     3580.0059646000
          | 
    Total | 1946170.0666088627     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  1.33e+04
    Design-based  F(1, 3987)      =  1.30e+04     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
      fem |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1946155.0666777336     9105.0094872000  1955260.0761649339
        1 |      14.9999311000        0.0000000000       14.9999311000
          | 
    Total | 1946170.0666088336     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.0140
    Design-based  F(1, 3987)      =    0.0141     P = 0.9056

. svy: prop majamptot minamptot bysup byinf endosup endoinf fem if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   majamptot |
          0  |   .9615595   .0045958      .9514535    .9696289
          1  |   .0384405   .0045958      .0303711    .0485465
             |
   minamptot |
          0  |   .9730917   .0037716      .9646135    .9795816
          1  |   .0269083   .0037716      .0204184    .0353865
             |
       bysup |
          0  |   .9719934   .0038082      .9634698    .9785724
          1  |   .0280066   .0038082      .0214276    .0365302
             |
       byinf |
          0  |   .9934102   .0018824       .988472    .9962411
          1  |   .0065898   .0018824      .0037589     .011528
             |
     endosup |
          0  |   .9758374   .0038008       .967143    .9822734
          1  |   .0241626   .0038008      .0177266     .032857
             |
     endoinf |
          0  |   .8830311   .0077592      .8669254    .8974183
          1  |   .1169689   .0077592      .1025817    .1330746
             |
       0.fem |          1          .             .           .
--------------------------------------------------------------

. svy: prop majamptot minamptot bysup byinf endosup endoinf fem if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1           Number of obs   =   389,234
Number of PSUs   = 3,987           Population size = 1,946,170
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   majamptot |
          0  |    .998682   .0000655      .9985471    .9988045
          1  |    .001318   .0000655      .0011955    .0014529
             |
   minamptot |
          0  |    .998682   .0000648      .9985487    .9988031
          1  |    .001318   .0000648      .0011969    .0014513
             |
       bysup |
          0  |   .9996866    .000029      .9996243    .9997385
          1  |   .0003134    .000029      .0002615    .0003757
             |
       byinf |
          0  |   .9998073    .000023      .9997566    .9998475
          1  |   .0001927    .000023      .0001525    .0002434
             |
     endosup |
          0  |   .9997379    .000027      .9996793    .9997859
          1  |   .0002621    .000027      .0002141    .0003207
             |
     endoinf |
          0  |   .9987077   .0000664      .9985707    .9988316
          1  |   .0012923   .0000664      .0011684    .0014293
             |
         fem |
          0  |   .9999923   4.44e-06      .9999761    .9999975
          1  |   7.71e-06   4.44e-06      2.49e-06    .0000239
--------------------------------------------------------------

. 
. *Create categorical variables and run test
. gen catamp=0

. replace catamp=1 if minamptot==1
(562 real changes made)

. replace catamp=2 if majamptot==1
(583 real changes made)

. svy: tab catamp allPAD, count format (%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
   catamp |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1941120.0675151979     8520.0075723000  1949640.0750874979
        1 |    2485.0004633000      235.0007256000     2720.0011889000
        2 |    2564.9986304000      350.0011893000     2914.9998197000
          | 
    Total | 1946170.0666088976     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(2)         = 2466.5516
    Design-based  F(1.99, 7920.57)= 1220.9520     P = 0.0000

. 
. gen catproc=0

. replace catproc=1 if bysup ==1
(173 real changes made)

. replace catproc=2 if endosup ==1
(146 real changes made)

. replace catproc=3 if endoinf ==1
(716 real changes made)

. replace catproc=4 if endosup ==1
(146 real changes made)

. replace catproc=5 if fem ==1
(3 real changes made)

. svy: tab catproc allPAD, count format (%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
          |                           allPAD                          
  catproc |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1942795.0630849779     7730.0066294000  1950525.0697143779
        1 |     515.0006496000      215.0000855000      730.0007351000
        3 |    2335.0035379000      940.0024583000     3275.0059962000
        4 |     509.9994053000      220.0003140000      729.9997193000
        5 |      14.9999311000        0.0000000000       14.9999311000
          | 
    Total | 1946170.0666088781     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(4)         =  1.67e+04
    Design-based  F(3.98, 15874.36)= 4100.0110    P = 0.0000

. 
. *Hosp LOS (mean + SD)
. *extended LOS is days above median LOS
. gen extLOS = 0 

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. summarize los, detail

                  Length of stay (cleaned)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs             391,045
25%            3              0       Sum of wgt.     391,045

50%            5                      Mean           7.600749
                        Largest       Std. dev.      8.745893
75%            9            356
90%           15            359       Variance       76.49064
95%           21            363       Skewness       7.345867
99%           40            365       Kurtosis       138.6261

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. replace extLOS = los-r(p50) if los >r(p50)
(185,990 real changes made, 10 to missing)

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. svy: mean extLOS if allPAD==1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,821
Number of PSUs   = 1,041          Population size = 9,105.0095
                                  Design df       =      1,040

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |   6.406916   .2476878      5.920891    6.892941
--------------------------------------------------------------

. svy: mean extLOS if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   389,224
Number of PSUs   = 3,987           Population size = 1,946,120
                                   Design df       =     3,986

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      extLOS |   3.569156   .0408483      3.489071    3.649242
--------------------------------------------------------------

. svy:regress extLOS allPAD
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   =   391,045
Number of PSUs   = 3,988                           Population size = 1,955,225
                                                   Design df       =     3,987
                                                   F(1, 3987)      =    140.38
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0006

------------------------------------------------------------------------------
             |             Linearized
      extLOS | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      allPAD |    2.83776   .2395123    11.85   0.000     2.368181    3.307338
       _cons |   3.569156   .0408483    87.38   0.000     3.489071    3.649242
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/p1/7cgjkzw95kv30_bk198wcbc40000gn/T//SD00429.000000"

. *Making Location of Hospital Discharges
. replace dispuniform = 3 if dispuniform==.
(0 real changes made)

. replace dispuniform = 4 if dispuniform==20
(39,657 real changes made)

. replace dispuniform = 8 if dispuniform==21
(0 real changes made)

. replace dispuniform = 9 if dispuniform==99
(86 real changes made)

. label define dispuniform 1 "Routine" 2 "Transfer to short-term hospital" 3 "Missing" 4 "Died in hospital
> " 5 "Transfer other" 6 "HHC" 7 "AMA"  8"Discharged to court/law enforcement" 9 "Discharged alive, destin
> ation unknown (may have expired elsewhere)"

. label value dispuniform dispuniform

. 
. foreach n of numlist 1/9 {
  2. gen dispuniform`n' = 0
  3. replace dispuniform`n' = 1 if dispuniform ==`n'
  4. }
(130,768 real changes made)
(12,944 real changes made)
(0 real changes made)
(39,657 real changes made)
(126,879 real changes made)
(75,839 real changes made)
(4,882 real changes made)
(0 real changes made)
(86 real changes made)

. 
. foreach var of varlist dispuniform1 dispuniform2 dispuniform3 dispuniform4 dispuniform5 dispuniform6 dis
> puniform7 dispuniform8 dispuniform9{
  2.         svy: tab `var' allPAD,  count format(%20.10f) pearson
  3. }
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm1       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1294210.1814020611     7225.0074235000  1301435.1888255612
        1 |  651959.8852081076     1880.0020637000   653839.8872718076
          | 
    Total | 1946170.0666101687     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =  134.4999
    Design-based  F(1, 3987)      =  131.5087     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm2       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1881740.1438262772     8815.0093781000  1890555.1532043770
        1 |   64429.9227830002      290.0001091000    64719.9228921002
          | 
    Total | 1946170.0666092774     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.0893
    Design-based  F(1, 3987)      =    0.0901     P = 0.7640
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

------------------------------
   allPAD |              count
----------+-------------------
        0 | 1946170.0666088334
        1 |    9105.0094872000
          | 
    Total | 1955275.0760960332
------------------------------
Key:    count = Weighted count

  Only one row category.
  Statistics cannot be computed.

  Pearson:
    Uncorrected   chi2(0)         =         .
    Design-based  F(., .)         =         .     P =      .
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm4       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1749005.0374894808     7985.0081021000  1756990.0455915809
        1 |  197165.0291202952     1120.0013851000   198285.0305053952
          | 
    Total | 1946170.0666097759     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    9.3662
    Design-based  F(1, 3987)      =    9.2029     P = 0.0024
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm5       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1315679.9072462393     5200.0052175000  1320879.9124637393
        1 |  630490.1593638221     3905.0042697000   634395.1636335221
          | 
    Total | 1946170.0666100616     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =   91.0328
    Design-based  F(1, 3987)      =   91.6536     P = 0.0000
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm6       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1568769.9977986175     7310.0079191000  1576080.0057177173
        1 |  377400.0688113567     1795.0015681000   379195.0703794567
          | 
    Total | 1946170.0666099743     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.1206
    Design-based  F(1, 3987)      =    0.1188     P = 0.7304
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm7       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1921875.0691297564     8990.0093957000  1930865.0785254564
        1 |   24294.9974792001      115.0000915000    24409.9975707001
          | 
    Total | 1946170.0666089563     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.0032
    Design-based  F(1, 3987)      =    0.0032     P = 0.9548
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

------------------------------
   allPAD |              count
----------+-------------------
        0 | 1946170.0666088334
        1 |    9105.0094872000
          | 
    Total | 1955275.0760960332
------------------------------
Key:    count = Weighted count

  Only one row category.
  Statistics cannot be computed.

  Pearson:
    Uncorrected   chi2(0)         =         .
    Design-based  F(., .)         =         .     P =      .
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
dispunifo |                           allPAD                          
rm9       |                  0                   1               Total
----------+-----------------------------------------------------------
        0 | 1945740.0627654390     9105.0094872000  1954845.0722526393
        1 |     430.0038434000        0.0000000000      430.0038434000
          | 
    Total | 1946170.0666088392     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(1)         =    0.4024
    Design-based  F(1, 3987)      =    0.1547     P = 0.6941

. svy: prop dispuniform if allPAD==1
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                              Number of obs   =      1,821
Number of PSUs   = 1,041                              Population size = 9,105.0095
                                                      Design df       =      1,040

----------------------------------------------------------------------------------
                                 |             Linearized            Logit
                                 | Proportion   std. err.     [95% conf. interval]
---------------------------------+------------------------------------------------
                     dispuniform |
                        Routine  |     .20648   .0097405      .1880196    .2262478
Transfer to short-term hospital  |   .0318506   .0041142      .0246953     .040992
               Died in hospital  |   .1230094    .007826      .1084583    .1392078
                 Transfer other  |   .4288852   .0116453      .4062012    .4518721
                            HHC  |   .1971444   .0094548      .1792475    .2163571
                            AMA  |   .0126304   .0026133      .0084081    .0189327
----------------------------------------------------------------------------------

. svy: prop dispuniform if allPAD==0
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =     1                                                      Number of obs   =   389,234
Number of PSUs   = 3,987                                                      Population size = 1,946,170
                                                                              Design df       =     3,986

---------------------------------------------------------------------------------------------------------
                                                        |             Linearized            Logit
                                                        | Proportion   std. err.     [95% conf. interval]
--------------------------------------------------------+------------------------------------------------
                                            dispuniform |
                                               Routine  |   .3349964   .0020702      .3309499    .3390672
                       Transfer to short-term hospital  |    .033106   .0006918      .0317762    .0344895
                                      Died in hospital  |   .1013092   .0008856      .0995861    .1030588
                                        Transfer other  |   .3239646   .0018992      .3202522    .3276992
                                                   HHC  |   .1939194   .0016497      .1907054    .1971743
                                                   AMA  |   .0124835   .0003348      .0118438    .0131573
Discharged alive, destination unknown (may have exp..)  |   .0002209   .0000388      .0001566    .0003118
---------------------------------------------------------------------------------------------------------

. svy: tab dispuniform allPAD, count format(%20.10f) pearson
(running tabulate on estimation sample)

Number of strata =     1                           Number of obs   =   391,055
Number of PSUs   = 3,988                           Population size = 1,955,275
                                                   Design df       =     3,987

----------------------------------------------------------------------
Dispositi |
on of     |
patient   |                           allPAD                          
(uniform) |                  0                   1               Total
----------+-----------------------------------------------------------
  Routine |  651959.8852081076     1880.0020637000   653839.8872718076
 Transfer |   64429.9227830002      290.0001091000    64719.9228921002
  Died in |  197165.0291202952     1120.0013851000   198285.0305053952
 Transfer |  630490.1593638221     3905.0042697000   634395.1636335221
      HHC |  377400.0688113567     1795.0015681000   379195.0703794567
      AMA |   24294.9974792001      115.0000915000    24409.9975707001
 Discharg |     430.0038434000        0.0000000000      430.0038434000
          | 
    Total | 1946170.0666091822     9105.0094872000  1955275.0760959464
----------------------------------------------------------------------
Key: Weighted count

  Pearson:
    Uncorrected   chi2(6)         =  160.0257
    Design-based  F(4.91, 19579.04)=   21.0003    P = 0.0000

. 
. *Hospital Charges (mean + SD)
. svy: mean totchg if allPAD==1 
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =     1,807
Number of PSUs   = 1,035           Population size = 9,035.009
                                   Design df       =     1,034

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      totchg |   124199.9    3753.74      116834.1    131565.7
--------------------------------------------------------------

. svy: mean totchg if allPAD==0
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1           Number of obs   =   387,879
Number of PSUs   = 3,982           Population size = 1,939,395
                                   Design df       =     3,981

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      totchg |   87006.28   1323.074      84412.32    89600.25
--------------------------------------------------------------

. svy:regress totchg allPAD
(running regress on estimation sample)

Survey: Linear regression

Number of strata =     1                           Number of obs   =   389,686
Number of PSUs   = 3,983                           Population size = 1,948,430
                                                   Design df       =     3,982
                                                   F(1, 3982)      =    115.11
                                                   Prob > F        =    0.0000
                                                   R-squared       =    0.0003

------------------------------------------------------------------------------
             |             Linearized
      totchg | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      allPAD |   37193.59   3466.682    10.73   0.000     30396.95    43990.23
       _cons |   87006.28   1323.074    65.76   0.000     84412.32    89600.25
------------------------------------------------------------------------------

. 
. save "/Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /All Sepsis.dta", replace
(file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /All Sepsis.dta not found)
file /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /All Sepsis.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/Stuthi/Documents/Stuthi/Year 2 Pitt MPH/Work-Related/CLI:Sepsis /Table 1.log
  log type:  text
 closed on:  16 Apr 2023, 12:27:56
----------------------------------------------------------------------------------------------------------
